[{"id": 1, "name": "Vor's Price", "tipe": "M", "description": "After centuries of sleep you are awake. Your Warframe armor is weak. Your skills all but forgotten. A Grineer General, Vor, stands over you. \"You are mine, Tenno!\"", "image": "codex/quests/vors-price.png", "slug": "vors-price", "quest_order": 1, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 2, "name": "Saya's Vigil", "tipe": "O", "description": "Saya's Vigil is a quest introduced in Update 22.0, revolving around the mystery behind a long-lost Eidolon researcher and the Ostron people. Completing this quest will reward players with the blueprint for the Gara Warframe.", "image": "codex/quests/sayas-vigil.png", "slug": "sayas-vigil", "quest_order": 2, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 23, "name": "Vox Solaris", "tipe": "O", "description": "Vox Solaris is an optional solo-only quest where the Tenno aids the people of Fortuna to reignite the Solaris United rebellion against Nef Anyo. Completing this quest allows full access to Solaris United syndicate, a K-Drive Launcher, and the blueprint for the Garuda Warframe.", "image": "codex/quests/vox-solaris.png", "slug": "vox-solaris", "quest_order": 3, "is_replayable": "1", "date_created": "2018-12-13 15:15:49", "date_updated": "2018-12-13 15:15:49"}, {"id": 3, "name": "Howl of the Kubrow", "tipe": "O", "description": "Howl of the Kubrow is an optional Quest introduced in Update 14.0. This short quest tasks players with finding the equipment necessary to create their own personal Kubrow.", "image": "codex/quests/howl-of-the-kubrow.png", "slug": "howl-of-the-kubrow", "quest_order": 4, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 4, "name": "Once Awake", "tipe": "M", "description": "Once Awake is the second main storyline Quest that introduces new players to the Infested faction, as well as the Spy and Defense mission modes. As of the Specters of the Rail update, this quest is unlocked through the Mercury Junction, on Venus. The tasks required for any junction can be viewed by mousing over the junction in your Starmap.", "image": "codex/quests/once-awake.png", "slug": "once-awake", "quest_order": 5, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 5, "name": "The Archwing", "tipe": "M", "description": "The Archwing is a main Quest introduced in Update 15.0 that introduces and familiarizes players with the Archwing flight system, along the way they will also be introduced to Orokin Sabotage and Excavation missions. This quest is awarded upon unlocking the Mars Junction on Earth.", "image": "codex/quests/the-archwing.png", "slug": "the-archwing", "quest_order": 6, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 6, "name": "A Man of Few Words", "tipe": "O", "description": "A Man of Few Words is a Quest given by Darvo in any Relay. It tasks the player with rescuing a Grineer contractor of Darvo, who is disobedient to the Grineer Queens. This quest can be replayed via the Codex.", "image": "codex/quests/a-man-of-few-words.png", "slug": "a-man-of-few-words", "quest_order": 7, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 7, "name": "Stolen Dreams", "tipe": "M", "description": "Stolen Dreams is a Quest involving the search for Arcane Codices, enigmatic artifacts which several different factions have expressed an interest in. This quest can be replayed via the Codex.", "image": "codex/quests/stolen-dreams.png", "slug": "stolen-dreams", "quest_order": 8, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 8, "name": "The Limbo Theorem", "tipe": "L", "description": "The Limbo Theorem is an optional lore Quest introduced in Update 15.0, in which players piece together the meaning behind a mysterious theorem. Completing this quest will provide the parts necessary to construct the Limbo Warframe. Players must complete The Archwing quest or purchase an Archwing before performing this quest.", "image": "codex/quests/the-limbo-theorem.png", "slug": "the-limbo-theorem", "quest_order": 9, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 9, "name": "The New Strange", "tipe": "M", "description": "The New Strange is a Quest introduced in Update 16.0 continuing the events after the Stolen Dreams Quest, involving Cephalon Simaris as he searches for mysterious information. Completing this quest will provide the blueprint for Chroma, and players are given access to the Sanctuary Onslaught.", "image": "codex/quests/the-new-strange.png", "slug": "the-new-strange", "quest_order": 10, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 10, "name": "Natah", "tipe": "M", "description": "Natah is a main quest involving the mystery behind a strange drone that appears interested in the Tenno, as well as hints to the identity of the Lotus. Completing this Quest will award players with an Exilus Adapter and allow purchase of their blueprints from Cephalon Simaris. The continuation of this quest is The Second Dream.", "image": "codex/quests/natah.png", "slug": "natah", "quest_order": 11, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 11, "name": "The Second Dream", "tipe": "M", "description": "The Second Dream is a Main Quest added in Update 18.0, serving as a continuation of Stolen Dreams and Natah. It is the first Cinematic Quest, and yields significant lore on both the Sentients and the Stalker, along with the origin of the Tenno. This quest can be accessed in the Codex upon completing the Neptune Junction.", "image": "codex/quests/the-second-dream.png", "slug": "the-second-dream", "quest_order": 12, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 12, "name": "The War Within", "tipe": "M", "description": "The War Within is a cinematic quest released in Update 19.0. This questline explores the origin of the Twin Queens, Teshin, the truth behind the Zariman Ten-Zero incident, and a series of trials the Tenno must face.", "image": "codex/quests/the-war-within.png", "slug": "the-war-within", "quest_order": 13, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 24, "name": "Mask of the Revenant", "tipe": "O", "description": "Mask of the Revenant is an an optional quest that revolves around a decorative mask for the Operator. The mask tells the tale of a warframe left behind to prevent the return of the Sentient Eidolon, and upon completion: rewards the blueprint for the Revenant warframe.", "image": "codex/quests/mask-of-the-revenant.png", "slug": "mask-of-the-revenant", "quest_order": 14, "is_replayable": "1", "date_created": "2018-12-13 15:15:49", "date_updated": "2018-12-13 15:15:49"}, {"id": 13, "name": "Hidden Messages", "tipe": "O", "description": "Hidden Messages is an optional lore Quest introduced in Update 14.0 revolving around the lost warframe design, Mirage, as players attempt to decipher the meaning behind a series of cryptic poems discovered from an ancient Orokin artifact. Completing this quest will provide the parts necessary to construct the Mirage Warframe. The Quest can be obtained through the Sedna Junction from Pluto.", "image": "codex/quests/hidden-messages.png", "slug": "hidden-messages", "quest_order": 15, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 14, "name": "Chains of Harrow", "tipe": "M", "description": "Chains of Harrow is a solo-only main Quest featuring the Red Veil, revolving around the mysteries behind an abandoned Steel Meridian ship, and the horrors that lie within. Completing this quest will reward the player with the blueprint of the Harrow Warframe. The tie-in webcomic prequel, Rell can be found on the official website.", "image": "codex/quests/chains-of-harrow.png", "slug": "chains-of-harrow", "quest_order": 16, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 15, "name": "Apostasy Prologue", "tipe": "M", "description": "Apostasy Prologue is a short main Quest released in Update 22.8, not found in the Codex until completion. This quest relives Margulis' final moments with Ballas and the latter's meeting with the Lotus. This quest can be accessed after completing the Chains of Harrow quest and building the Orbiter's Personal Quarters by interacting with the holographic, violet Lua orb.", "image": "codex/quests/apostasy-prologue.png", "slug": "apostasy-prologue", "quest_order": 17, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 16, "name": "The Sacrifice", "tipe": "M", "description": "The Sacrifice is a solo-only main quest that follows the Operator's search for the Lotus, who has been taken by Ballas for unknown reasons. The Operator is aided by a new Warframe, Excalibur Umbra, who possesses unusual anti-Sentient abilities and abnormal memories linked to Ballas and the origin of the Warframes. The quest was first teased at TennoCon 2017 and was teased on the WARFRAME site. The Sacrifice was released on PC June 14, 2018 with Update 23.0. PS4 and Xbox One received it 3 weeks later, on July 5, 2018.", "image": "codex/quests/the-sacrifice.png", "slug": "the-sacrifice", "quest_order": 18, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:16:19"}, {"id": 25, "name": "Chimera Prologue", "tipe": "M", "description": "Chimera Prologue is a short main Quest released in Update 23.10, not found in the Codex until completion. This short quest explores the fate of Ballas after the events of The Sacrifice.", "image": "codex/quests/chimera-prologue.png", "slug": "chimera-prologue", "quest_order": 19, "is_replayable": "1", "date_created": "2018-12-13 15:15:49", "date_updated": "2018-12-13 15:15:49"}, {"id": 17, "name": "Sands of Inaros", "tipe": "O", "description": "Sands of Inaros is an optional Quest introduced in Update 18.5, involving Baro Ki'Teer's interest in the hidden treasures underneath Mars. Completing this quest will reward the blueprint and parts to craft the Inaros Warframe.", "image": "codex/quests/sands-of-inaros.png", "slug": "sands-of-inaros", "quest_order": 20, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 18, "name": "The Silver Grove", "tipe": "O", "description": "The Silver Grove is an optional quest introduced in Update: The Silver Grove, which sees the Tenno working with New Loka to uncover an ancient, mysterious power. Completing this quest will reward players with parts for the Titania Warframe.", "image": "codex/quests/the-silver-grove.png", "slug": "the-silver-grove", "quest_order": 21, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 19, "name": "The Glast Gambit", "tipe": "O", "description": "The Glast Gambit is an optional quest offered by Ergo Glast of The Perrin Sequence, which pits the Tenno against Nef Anyo's schemes as they attempt to unearth the mysteries behind the people known as the Mycona and the Infested.  Completing this quest will reward the blueprint for the Nidus Warframe.", "image": "codex/quests/the-glast-gambit.png", "slug": "the-glast-gambit", "quest_order": 22, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 20, "name": "Octavia's Anthem", "tipe": "O", "description": "Octavia's Anthem is an optional solo-only quest introduced in Update 20.0. This quest focuses on Cephalon Suda and the mystery behind her obsession with music and the resulting glitches that may hide a darker secret. Completing this quest will reward players with the blueprint for the Octavia Warframe. The tie-in webcomic What Remains can be found on the official website.", "image": "codex/quests/octavias-anthem.png", "slug": "octavias-anthem", "quest_order": 23, "is_replayable": "1", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 21, "name": "Patient Zero", "tipe": "L", "description": "Patient Zero is a quest to search for Mutalist Alad V, introduced in Update 15.5, where players must find and locate Alad V's new Infested form to stop his plans of dominating the Origin System. Completing this quest will provide the blueprint necessary to create a Mutalist Alad V Assassinate Key, which is required to access the Mutalist Alad V Assassination mission that drops components for the Mesa Warframe.", "image": "codex/quests/patient-zero.png", "slug": "patient-zero", "quest_order": 24, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}, {"id": 22, "name": "The Jordas Precept", "tipe": "O", "description": "The Jordas Precept is a Quest involving a Cephalon in distress, who seeks help in eradicating an Infestation. Completing this quest rewards the blueprint necessary to construct the Atlas Warframe, as well as access to the second area of Eris, the Jordas Golem.", "image": "codex/quests/the-jordas-precept.png", "slug": "the-jordas-precept", "quest_order": 25, "is_replayable": "0", "date_created": "2018-12-12 21:39:57", "date_updated": "2018-12-13 15:15:49"}]