[{"id": 161, "quest": 22, "name": "Assassinate the Golem", "description": "<p>Before embarking on this mission, players must equip the Potent Pherliac Pods in their Gear, and ensure that they are capable of using an Archwing.</p>\r\n\r\n<p>The Tenno must now find the Golem in order to defeat them, which can be located in its own node on Eris. As the Tenno go deeper into the Infested Ship, Jordas, questioning the player about their Pherliac Pods, begins to accuse the Tenno of being greedy scavengers only there for the Warframe parts, at which point Ordis begins to question Jordas&#39; actions with foreboding, asking the Tenno what he has gotten them into.</p>\r\n\r\n<p>Upon reaching a massive room with a large Infested mass in the middle, the Tenno will fight a Juggernaut Behemoth, with Ordis realizing that Jordas&#39; strange and conflicting actions was him luring them into a trap. Once the Juggernaut Behemoth is defeated, Ordis detects a much larger Infested lifeform as the spacecraft they are in begins to break apart.&nbsp;</p>\r\n\r\n<p>Transitioning into an Archwing Free Space environment, the player then encounters the gigantic Jordas Golem, which they must defeat in order to clear the mission.&nbsp;</p>\r\n\r\n<p>Upon defeating the Golem, Jordas, free from Infested influence, thanks the player as his final words.&nbsp;</p>\r\n\r\n<p>After Ordis muses upon his feelings on the entire ordeal, the quest will finish by rewarding the player with the blueprint for the Atlas Warframe, and the unlocking of the Jordas Golem Assassination mission on Eris.</p>"}, {"id": 160, "quest": 22, "name": "Craft Potent Pherliac Pods in Foundry", "description": "<p>After completing the Isos mission, Jordas will send an inbox message that contains the blueprint to construct a Potent Pherliac Pod, which will need to be built. If the Potent Pherliac Pod cannot be found in the foundry, be sure to check your inbox to receive Jordas&#39; message as well as the blueprint.</p>\r\n\r\n<table class=\"bg-black-t mr-3 my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>7500 Credits</td>\r\n\t\t\t<td>1 Pherliac Pod</td>\r\n\t\t\t<td>3 Argon Crystal</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t\t<td>Time: 8h</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>Once built, Ordis extols the player&#39;s greatness, while Jordas appears eager to have the Tenno come to him.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Cephalon, we have irradiated the Pherliac pods. My Operator is ready to save you! Do you see how great the Operator is?</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Ordis</strong></p>\r\n</div>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Yes. I cannot wait to meet this Operator! Bring them to Eris! Hurry. Don&#39;t regret this.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Jordas</strong></p>\r\n</div>"}, {"id": 159, "quest": 22, "name": "Test the Pherliac Pods on Infested", "description": "<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>The pods are ready. Tell us your location.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Ordis</strong></p>\r\n</div>\r\n\r\n<p>This mission requires that the player equip their newly completed Pherliac Pod in their Gear.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Really? No, they will need calibration.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Jordas</strong></p>\r\n</div>\r\n\r\n<p>After acquiring a Pherliac Pod, Jordas and Ordis task the player with testing the effectiveness of the Pods against Infested on an Exterminate mission in Isos, Eris.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Any severe Infestation should be enough.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Jordas</strong></p>\r\n</div>\r\n\r\n<p>Upon deploying a Pherliac Pod, Jordas informs the player that they require a more potent Pod stating that the Golem requires more, and tells them that he has sent them a blueprint for an irradiated Pod.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Dangerous but beautiful I can almost taste them, but the Golem needs something more potent.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Jordas</strong></p>\r\n</div>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Oh well yes. I suppose this is something my Operator can arrange. /glitch isn't it, Operator.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Ordis</strong></p>\r\n</div>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Hurry! No rush.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Jordas</strong></p>\r\n</div>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>I would never abandon a fellow Cephalon but centuries adrift have not been kind. I suppose all Cephalons degrade, don't they?</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Ordis</strong></p>\r\n</div>"}, {"id": 158, "quest": 22, "name": "Harvest Pherliac Pods from Juggernauts", "description": "<p>In order to create Pherliac Pods, players must hunt down Infested Juggernauts that can be found throughout Infested-occupied space, and harvest the parts and Blueprint necessary to build them. This part of the quest is not tied down to any one node, and can be accomplished in any node the player desires, so long as they can find Juggernauts and defeat them for the Pherliac Pod components. You do not need to defeat infested to get the warning for the Juggernaut (first roar), instead its a common practice to run past enemies until first roar then kill all trailing infested, making the Juggernaut show up (second roar).</p>\r\n\r\n<p>Once the player has collected all the necessary parts, they must then construct the Pods in the Foundry and await its completion, which will take about 8 hours.</p>\r\n\r\n<p>If the player already has Pherliac Pods prior to the quest, they will immediately be skipped to the next part of the quest.</p>"}, {"id": 157, "quest": 22, "name": "Contact the Stranded Cephalon", "description": "<p>The quest begins with Cephalon Jordas, the sender of the distress signal, asking for help in eradicating the Infestation that has beset him. Ordis, compelled by his protocol to assist his fellow Cephalon, offers the aid of the Tenno to assist Jordas. Jordas however appears to be unable to make up his mind whether he wants the Tenno to rescue him or not. He laments the chances of the Tenno&#39;s success, though he mentions that they may have a chance if they can acquire Pherliac Pods. Though unaware of what a Pherliac Pod is, Ordis nonetheless asks the Tenno to acquire them. Jordas also mentions that the fossilized parts of a fallen Warframe could be found at his location, though Ordis claims that the Tenno do not work for rewards.</p>"}, {"id": 156, "quest": 22, "name": "Starting the Quest", "description": "<p>The quest is automatically acquired after the player completes the Pluto-Eris Junction, which will prompt the following message to be sent to their inbox:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>CALLING ALL CEPHALONS, PRECEPT 44</em></p>\r\n\r\n<p><em>CEPHALON STRANDED. SHIP IMMOBILIZED. POWER FAILING. EXTINCTION EVENT.</em></p>\r\n\r\n<p><em>Please help me! Assemble this communication endpoint to establish contact.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Cephalon Jordas</strong></p>\r\n</div>\r\n\r\n<p>The quest must then be initiated by finding &quot;The Jordas Precept&quot; under Quests in the Codex, and clicking Begin.</p>"}, {"id": 155, "quest": 21, "name": "Mutalist Warframe", "description": "<p>With the laboratory&#39;s location uncovered, the Lotus sends in the Tenno to Xini, Eris, to destroy the lab, ensuring that Alad V cannot create any more Mutalist Infested even if he has already escaped from the area. Players are tasked with a Sabotage mission aboard a Corpus Ship to destroy its reactor core.</p>\r\n\r\n<p>After the reactor core is destroyed, Alad V will send in an Infested Mesa against the player to show off his work. The Lotus immediately insists that the Mesa, was in fact &quot;not a Tenno. That&#39;s a hollow Warframe being puppeted by Infested flesh. Put it out of its misery.&quot; The Infested Mesa uses her Regulator Pistols and a Plasma Sword as her weapons, and can parry player attacks. Players must kill the Infested Mesa before they can continue to extraction.</p>\r\n\r\n<p>Completing the mission rewards the Mutalist Alad V Assassinate Key blueprint.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Tenno,</em></p>\r\n\r\n<p><em>By destroying Alad V&#39;s ship you have destroyed his ability to make new Infested. Now you need to go after the man himself. He&#39;s on the run and it&#39;s up to you to track him down. Use the attached tracker to find him.</em></p>\r\n\r\n<p><em>Good Luck Tenno.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>The Lotus</strong></p>\r\n</div>"}, {"id": 154, "quest": 21, "name": "Triangulation III", "description": "<p>The third and final Hive Sabotage mission is set on Kala-azar, Eris. Alad V now expresses his complete disregard of Corpus philosophy by denouncing the ideals of profit. At the conclusion of the mission, the Lotus finally finishes tracking down the location of Alad V&#39;s laboratory.</p>\r\n\r\n<p>At this point, Lotus, referring to how Alad V seems to have changed, remarks that the Infestation has gotten to his mind and that he is not using the Infested as a weapon, he is Infested.&nbsp;</p>"}, {"id": 153, "quest": 21, "name": "Triangulation II", "description": "<p>The Hive Sabotage mission takes place on Saxis, Eris. Here, Alad V expresses his admiration for his Mutalists, and details his plans on making a Mutalist Warframe. At the end of the mission, a nervous Ordis asks whether it is possible for a Warframe to be infested.</p>"}, {"id": 152, "quest": 21, "name": "Triangulation I", "description": "<p>In order to triangulate Alad V&#39;s location, the Lotus sends the Tenno to sabotage three Infested Ships, with the first ship being located on Brugia, Eris. Once again Alad V contacts the player during the mission, telling them of his plans for evolution and further spreading the Infestation. Lotus comments that the Infestation is changing Alad V&#39;s mind, making him think like an Infested.</p>"}, {"id": 151, "quest": 21, "name": "Mutalist Empire", "description": "<p>Upon starting the quest, the players will receive an inbox message from Alad V himself, heavily infected by the Infestation, announcing the now-evolved Infested species (which he calls its empire). The transmission reads as follows:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Hello, inhabitants of the Origin System!</em></p>\r\n\r\n<p><em>It is my singular pleasure to announce that today is the first day of a new empire. An empire populated not by Corpus, not by Grineer, and certainly not by Tenno. No, the Mutalist Empire will be populated by you. A glorious new you, baptized by Mutalist Flesh.</em></p>\r\n\r\n<p><em>You call this a disease, an infestation? I call it Unity, one army under me. Welcome to your new species.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Alad V</strong></p>\r\n</div>\r\n\r\n<p>Upon hearing the news, the Lotus immediately sends the Tenno to a Corpus Ship on Naeglar, Eris to extract data that would reveal what the Corpus know about Alad V, playing out as a Spy mission. The Corpus had been searching for Alad V for months due to his devastating attacks on their ships. Once the second datamass has been collected, Alad V contacts the player about appreciating his \"gift\" to them, signaling the arrival of Infested units on board the ship that will fight both Tenno and Corpus alike. The mission ends once all the Datamasses have been brought to extraction.</p>\r\n\r\n<p>The data collected from the Corpus reveals that Alad V has gotten hold of another Warframe, with plans to infect it.</p>"}, {"id": 150, "quest": 21, "name": "Starting the Quest", "description": "<p>In order for the player to start this quest, you must complete the Eris junction on Pluto. Upon completion, the player will be awarded with the Patient Zero Quest.</p>\r\n\r\n<p>Go to the Quest section of the Codex, select the quest, then click &quot;Begin Quest&quot; to start.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Tenno,</em></p>\r\n\r\n<p><em>Alad V&#39;s infested ships are slamming into populated centers all around the system. He&#39;s using these ships like spore pods to spread his Mutalist plague. Everyone is affected. Equally concerning are the new strains of Infested he&#39;s using in this attack.</em></p>\r\n\r\n<p><em>There are two courses of action. First, we must extinguish each Infestation at its source. I will be issuing Bounties, so that we can cut down as many of these new Infested as possible. Pay attention to your Navigation Console for updates.</em></p>\r\n\r\n<p><em>Secondly, we need you to deal with the source of the problem. I have sent you the details of a mission to locate Alad V and destroy his lab.</em></p>\r\n\r\n<p><em>Left unchecked this plague will spread out of control. You must start immediately, there is no time to waste.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>The Lotus</strong></p>\r\n</div>"}, {"id": 149, "quest": 20, "name": "Suda's Datascape", "description": "<p>Upon being synthesized into the datascape, players are greeted by the virtual visage of Hunhow in the middle, and a circular ring made up of floating blocks of differing colors representing the Mandachord. As Hunhow boasts about his successes, Ordis clues in the player that they need to recreate the music of Octavia&#39;s anthem inside the datascape&#39;s Mandarchord in order to defeat Hunhow. This particular part of the mission has unique mechanics:</p>\r\n\r\n<ul>\r\n\t<li>A beam emanating from the center of the map will sweep around the field, which will stagger and deal damage to&nbsp;the player if it hits them.\r\n\t<ul>\r\n\t\t<li>This can be blocked using melee parry or negated with high-enough stagger/knockdown resistance.</li>\r\n\t\t<li>The beam can be jumped over.</li>\r\n\t\t<li>The pillars that are on the sides are high enough so that standing on them will allow the beam to pass safely underneath without touching you.</li>\r\n\t\t<li>The beam sweeps high enough that you can simply duck under it on all but the outermost ring blocks (though one has to be careful not to accidentally duck while in motion causing you to slide off the small platforms instead).</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Bright yellow balls will emanate from certain dark-brown platforms. Stepping on these platforms will reveal a blue musical note.</li>\r\n\t<li>Red energy pillars on dark-brown platforms represent errant notes, and must be erased by stepping on the platform.</li>\r\n\t<li>Stepping on a dark-brown platform that doesn&#39;t have an errant or musical note will create an errant note on that block, requiring you to jump to a different block and jump back to remove it (simply jumping upwards from the same errant block and touching it again does not count for removing the note).</li>\r\n\t<li>Grey blocks are neutral blocks, and can be stepped on safely without affecting the Mandachord.</li>\r\n\t<li>Falling off the edge of the world will damage and respawn you at the beginning pillar.</li>\r\n</ul>\r\n\r\n<p>The player&#39;s goal is to step on the blocks with the yellow spheres in order to unveil the musical notes, while removing any errant notes while at the same time preventing the formation of more errant notes. Once the player completes the music, the notes will begin firing rhythmical barrages at Hunhow&#39;s avatar, damaging him.</p>\r\n\r\n<p>Upon depleting the first third of Hunhow&#39;s health, players are ported into another Mandachord set, where they must repeat the process again but with more dark-brown platforms. In this second stage, Sentient avatars called Eradicysts will spawn, attacking players with ranged projectiles, and preventing players from activating musical notes if they&#39;re hovering over one. Despite their menacing nature, Eradicysts can be easily destroyed through most weapons fire in a single hit, having significantly weaker health and defenses than true Sentient enemies, mostly serving as a hindrance rather than a threat. Once enough musical notes are activated on the second stage, Ordis will be able to break free from Hunhow&#39;s control and join the battle, attacking any Eradicysts in the way, though he will be forced to retreat should he sustain too much damage.</p>\r\n\r\n<p>A third stage will commence once the second third of Hunhow&#39;s health has been depleted, with the same mechanics but with more blocks to contend with, and a greater number of Eradicysts will spawn to attempt to stop the player. During this phase, Cephalon Simaris enters the datascape, providing fire support by spawning in virtual representations of units from his Sanctuary such as Grineer Heavy Gunners. These will invariably be destroyed periodically by Hunhow&#39;s beam, but will draw fire from the Eradicysts before then. Completing this final stage will destroy Hunhow&#39;s manifestation completely, freeing Suda from his control and restoring her datascape.</p>\r\n\r\n<p>In the aftermath, Suda awakens, but does not remember recent events due to short-term memory loss. She thanks both Ordis and Simaris for saving her, though Simaris (rather unconvincingly) claims that he merely did it to preserve the Cephalons&#39; weave. As gratitude to the player, Suda rewards the blueprint for the Octavia Warframe at the completion of the quest.</p>"}, {"id": 148, "quest": 20, "name": "Go to Simaris in a Relay", "description": "<p>Back on the ship, an inbox message will open, containing a recorded transmission from Ordis stating that the Operator will only receive that message if he failed to save Suda, then asks players to go to Simaris and try to contain Hunhow before the Sentient infects more Cephalons, and finally saying farewell to the Operator after reminiscing about the past.</p>\r\n\r\n<p>Speaking with Simaris in a Relay with the prompt &quot;Suda&#39;s Datascape?&quot;, he mentions that Cephalons are able to create alternate reality datascapes for various functions, including training rooms and the Sanctuary, and questions if the Tenno wish to go after Ordis despite the risk with the Sentients entangled in his code. Players can either ask Simaris to help them (&quot;Yes, I am. Help me&quot;), or question Simaris more about Hunhow&#39;s intentions (&quot;Hunhow&#39;s intention?&quot;). Simaris states that while he won&#39;t endanger himself or his Sanctuary, he can send the Tenno to Suda-Hunhow&#39;s datascape.</p>"}, {"id": 147, "quest": 20, "name": "Harness the power of an Orokin Tower", "description": "<p><strong>Enemy Level:</strong> 20-20<br />\r\n<strong>Tileset:</strong> Orokin Void</p>\r\n\r\n<p>Another argument ensues between Simaris and Ordis on their course of action against Suda, with Ordis reaffirming his stand to free Suda from Hunhow&#39;s control, as he managed to receive the coordinates of the last song from Suda.</p>\r\n\r\n<p>Inside the Tower, the player will be attacked by &quot;Decaying&quot; Sentient enemies, surrounded by a red aura but no less deadly. Ordis expresses surprise at the presence of Sentient units inside the Void - a fact long thought impossible - and surmises that Hunhow is using Suda&#39;s energy to shield them (though not perfectly) from the Void&#39;s effects. Upon locating the room in which the Hydraulus is located players can use a nearby console to lock the room, preventing additional Sentient units from entering and allowing players to clear the room of any remaining enemies. Only after all enemies are cleared can players start on the Hydraulus puzzle, which like the previous instances requires matching resonant beats with the provided figures.</p>\r\n\r\n<p>Unlike with previous instances, solving the Hydraulus puzzle does not rouse Suda and instead attracts Hunhow&#39;s attention who claims that Suda has been eradicated. Ordis draws up a plan to make Suda hear the anthem by using the Orokin Tower to boost the signal. Players must then find a console that they can activate to amplify the signal, which will count up to 100%. Hunhow will send in Sentient units to disrupt the amplification, freezing the counter, and players must destroy them to allow the counter to proceed.</p>\r\n\r\n<p>After the amplification is complete, players have to activate the Hydraulus again, which angers Hunhow, making him try to attack Ordis. Despite this, Ordis is able to point the players to the location of a second amplifier, which players must activate and then bring to 100% amplification similar to the previous one. Completing this task will make Ordis try to save Suda by directly interfacing with her, though he falls silent afterwards, and an extraction marker will note to players that they can extract when ready.</p>"}, {"id": 146, "quest": 20, "name": "Find the Second Song Fragment", "description": "<p><strong>Enemy Level:</strong> 20-20<br />\r\n<strong>Tileset:</strong> Orokin Moon</p>\r\n\r\n<p>On the Orbiter, Simaris urges the Tenno to discontinue their quest and destroy Suda lest her corruption affect the other Cephalons. Ordis and Simaris get into an argument regarding their course of action with Suda, with Ordis wanting to help, while Simaris mocks Ordis&#39; &quot;compassion-glitch&quot; and tells him that his actions could endanger both themselves and the Operator.</p>\r\n\r\n<p>During the mission, Suda once more forgets why they came to Lua, and with a reminder from Ordis, realizes that Simaris was right, and that the corruption infecting Suda is not benign. Apart from that, the entire map will be eerily devoid of any enemies, only occasionally encountering groups of Grineer corpses. The player then finally encounters a pair of Sentient Battalysts to Suda&#39;s horror, before she is taken over by a malignant presence that Ordis recognizes as Hunhow. Having taken over Suda, Suda-Hunhow orders his Sentients to find the song fragment.</p>\r\n\r\n<p>Players must fight the Sentients in order to get to the Hydraulus, and once located must exterminate all Sentient enemies within the room and any additional ones pouring in, in order to access the Hydraulus. Similar to the previous instance, the correct resonant beats must be added to the musical chart (this time in the second row with five possible positions per column) in order to complete the music. Upon completing the puzzle, Suda regains herself for a moment to ask Ordis to apologize on her behalf to the Operator, before Hunhow once again reasserts control. Ordis then asks players to extract once more, while an infinite amount of Sentients will continue to spawn during their escape.</p>"}, {"id": 145, "quest": 20, "name": "Find the First Song Fragment", "description": "<p><strong>Enemy Level:</strong> 20-20<br />\r\n<strong>Tileset:</strong> Grineer Sealab</p>\r\n\r\n<p>The next mission will be a Grineer underwater base in Uranus, with Suda musing about the relationship between the song fragment and the base. The player must find an Orokin artifact the Grineer have recently uncovered called a Hydraulus. On using the Hydraulus with the context key, a special UI will appear, composed of a concave table with several rows and columns, which then begins playing music, and Suda recognizes the music as belonging to &quot;Octavia&#39;s Anthem&quot;. In order to proceed, players must add resonant beats to the song by activating the appropriate bar positions (out of three possible) in the top row of each column as indicated by the height of the glowing orange symbols that appear on top over of the chart each time the beat passes it. Once the beats are correctly added, Suda remembers that more of the song can be found on Lua, with players being able to extract at this time.</p>"}, {"id": 144, "quest": 20, "name": "Build the Mandachord", "description": "<p>On finishing the Corpus mission, Suda will ask the player to craft the Mandachord.</p>\r\n\r\n<table class=\"bg-black-t mr-3 my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>5000 Credits</td>\r\n\t\t\t<td>3 Morphics</td>\r\n\t\t\t<td>1 Body</td>\r\n\t\t\t<td>1 Fret</td>\r\n\t\t\t<td>1 Bridge</td>\r\n\t\t\t<td>Time: 30m</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>Once the Mandachord is built and claimed Suda will begin explaining why the Mandachord is important before going silent and not finishing her statement. After some time Ordis will ask Suda what she was going to say about the Mandachord, to which she will respond as though confused, then claim she made an error and did not actually have any data about the Mandachord.</p>\r\n\r\n<p>Suda will relay Ordis coordinates to the next mission location, though Ordis will express his concern about Suda&#39;s state to the player.</p>"}, {"id": 143, "quest": 20, "name": "Collect the Mandachord Components", "description": "<p><strong>Enemy Level:</strong> 29-31<br />\r\n<strong>Tileset:</strong> Corpus Outpost</p>\r\n\r\n<p>On accepting the quest, the player will receive a blueprint for the Mandachord. In order to complete the Mandachord, players must embark on a mission to find the remaining three components - the Mandachord Body, Mandachord Fret, and Mandacord Bridge - on a Corpus base in Neptune.</p>\r\n\r\n<p>Once the player enters the mission they will be accompanied by an unknown white light that leaves behind a bright purple trail as it moves accompanied by music. The player must follow this light as it will guide them to each individual component&#39;s location. The components will be inside a container where the player can press the context action to pick up the component.</p>\r\n\r\n<p>Once the Mandachord Body, Fret, and Bridge have been collected the light will fade away and Suda will tell the player to extract.</p>"}, {"id": 142, "quest": 20, "name": "Starting the Quest", "description": "<p>The Octavia&#39;s Anthem quest can only be unlocked once players have completed The Second Dream.</p>\r\n\r\n<p>The quest is started by visiting Cephalon Suda inside a relay where Cephalon Simaris will abruptly tell the player to disregard anything Suda says, complaining about her obsession with music (which he regards as a pointless waste of data). Suda will greet the player and begin expressing her thoughts on music. She will also be noticeably erratic in her train of thought. From there Suda will ask the player to build the &quot;Mandachord&quot;, an artifact blueprint given to the player by Suda. Simaris will immediately mock Suda&#39;s interest in music, and suggests she be decommissioned due to corrupted precepts.</p>"}, {"id": 141, "quest": 19, "name": "Win Back Neewa", "description": "<p><strong>Enemy Level:</strong> 21-28<br />\r\n<strong>Tileset:</strong> Corpus Ship Arena</p>\r\n\r\n<p>Glast challenges Nef to the Index one last time for Neewa and his holdings, but Nef refuses seeing as how Glast has nothing more to wager. It is then that Glast reveals the Myconian Old War relic to Nef to be his wager, explaining it to be a product of the Void which Nef would be interested in. Awestruck by the relic, Nef Anyo accepts the wager for another Index match. Unlike previous matches, players will not wager their own credits in the match, and will have the opportunity to regain 200,000&nbsp;Credits&nbsp;if they win.</p>\r\n\r\n<p>This last Index match will proceed with the same rules as the first 3 matches, allowing players to earn Index points at their leisure. If the player manages to win this match, Nef Anyo demands a rematch, making lucrative offers to Glast as wagers, all of which are refused.</p>\r\n\r\n<p>On the ship, the Lotus hesitates to send Neewa back to her home due to her desire to cure the girl. This prompts an argument between the Lotus and Glast on Neewa&#39;s fate and what it could mean for the Myconians: healing Neewa will prolong her life but destroy the Myconian&#39;s way of life, while sending her home will allow the Myconians to live on with their traditions at the cost of Neewa&#39;s lifespan.</p>\r\n\r\n<p>The Lotus gives the decision regarding Neewa to the Tenno, whom she points out has had similar obligations thrust upon them as children. At this point, players can choose between one of three different choices regarding Neewa&#39;s fate:</p>\r\n\r\n<ul>\r\n\t<li>[Sun] <i>Cure Her</i>\r\n\r\n\t<ul>\r\n\t\t<li>Neewa is taken to a relay to be cured, unsure of her future, but as a result she is exiled from the Myconian colony.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Moon] <i>Send Her Home</i>\r\n\t<ul>\r\n\t\t<li>Neewa returns to the Myconian colony, continuing to serve as the Triuna for as long as she lives.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Neutral] <i>Let Her Decide</i>\r\n\t<ul>\r\n\t\t<li>Neewa chooses to return to the Myconian colony, where she will become the last Triuna and usher a new tradition for her people, one without sacrifices.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>The player's choice determines the content of the inbox message that arrives afterwards, which will include a video message from Neewa to the Tenno. Regardless of choice, players will be rewarded with the Myconian's Old War relic upon receiving the message, which is revealed to be the blueprint for the Nidus Warframe.</p>"}, {"id": 140, "quest": 19, "name": "Find the source of Nef Anyo's cheats", "description": "<p><strong>Enemy Level:</strong> 24-26<br />\r\n<strong>Tileset:</strong> Corpus Ship</p>\r\n\r\n<p>Back in the Orbiter, Lotus confirms that Nef Anyo was indeed cheating during the match, and that she has managed to locate the systems responsible. In order to defeat Nef Anyo&#39;s traps, the Lotus assigns the Tenno to steal the control codes for his traps in order to render them unusable and thus give them a fair chance in the Index.</p>\r\n\r\n<p>On arrival, players must complete a Spy mission where two of the three data vaults must be successfully hacked. Once a vault has been successfully hacked, the Lotus learns that what the Tenno managed to retrieve wasn&#39;t a control code, but a message from Neewa, which Lotus attempts to decode as the player continues on to the next vault. Players can proceed to extraction once all the vaults have been hacked, with at least two successful hacks.</p>\r\n\r\n<p>Back on the ship, the decoded message from Neewa has her mention a ritual called &quot;The Passing&quot; which involves the transferring of the Triuna to someone else. When the Lotus asks Glast concerning what they found, he finally explains what the Triuna is: a genetic immunity to the Infestation, passed down from generation to generation of Myconians. It is revealed by the Lotus that the Infested fear hybrids, which Glast confirms is what allows the Myconians to harvest resources from the Infested peacefully. When the Lotus learns that the Triuna will eventually kill its bearer, she expresses her shock at the practice, to which Glast counters that the bearers do it for the greater good.</p>"}, {"id": 139, "quest": 19, "name": "Challenge Nef Anyo on the Index", "description": "<p><strong>Enemy Level:</strong> 21-28<br />\r\n<strong>Tileset:</strong> Corpus Ship Arena</p>\r\n\r\n<p>Another Index match is held, costing the player 180,000 Credits, this time with Neewa on the line, and Glast wagering his entire holdings. As players proceed through the match, however, they will suddenly experience inexplicable deaths whenever they try to deposit their earnings, prompting Glast to accuse Nef Anyo of cheating, who denies the accusations. Meanwhile, Lotus tells the player to continue with the match while she investigates the anomalies.</p>\r\n\r\n<p>As there is no way for the player to deposit Index points without dying during this mission, the mission will eventually end in defeat for the player after one round, with Nef Anyo proclaiming his victory over Glast.</p>"}, {"id": 138, "quest": 19, "name": "Challenge Nef Anyo on the Index", "description": "<p><strong>Enemy Level:</strong> 18-22<br />\r\n<strong>Tileset:</strong> Corpus Ship and Corpus Outpost Arena</p>\r\n\r\n<p>Again, players must challenge the Index, with the third match requiring 140,000&nbsp;Credits&nbsp;as a minimum wager. During this match, the first time the player attempts to deposit their earnings they will die from an unusual anomaly, with Glast exclaiming his surprise at what happened, and suggesting sabotage. Once players win this third match, Nef Anyo will relist Glast&#39;s brokers into the Index, allowing them to openly wager in the matches. Glast suggests that they use Nef Anyo&#39;s greed against him by subtly hustling him along their wagers, and that the Tenno not come on too strongly lest Nef Anyo backs out.</p>\r\n\r\n<p>Players must now play a fourth Index match with the same rules as the previous matches with a 160,000 Credits&nbsp;wager, but with an added condition: players are given a 10-point Victory Margin, which is the difference between points that they must maintain between their team and the opposing team. Unlike in previous matches, players must keep their score within the 10-point Margin, e.g. if Nef Anyo has 5 points, the Tenno&#39;s score must not exceed 15 points. Should the player win with a score exceeding the 10-point margin, Nef Anyo will back out, and the mission will fail. Also although it is technically the match win the wager will still be lost if the player wins exceeding the margin.</p>\r\n\r\n<p>If players successfully complete the fourth match, Nef Anyo will relent and put forth a trade where he will release the Triuna along with Neewa and the other prisoners if the Tenno win the next round, but if Glast loses then Nef Anyo will take all of his titles and holdings in return.</p>\r\n\r\n<p>Another inbox message will arrive for the player back on the Orbiter, containing another voice recording from Neewa. The message reveals that the Triuna is not an object, but Neewa herself, and that she contains powers kept hidden to keep her safe.</p>"}, {"id": 137, "quest": 19, "name": "Challenge Nef Anyo on the Index", "description": "<p><strong>Enemy Level:</strong> 15-19<br />\r\n<strong>Tileset:</strong> Corpus Ship Arena</p>\r\n\r\n<p>Before players can enter the Index, they must first wager&nbsp;100,000 Credits in order to be allowed into the mission as per the Index&#39;s rules. If players win the Index, the credits wagered will be returned to them, along with a&nbsp;20,000 Credits profit.</p>\r\n\r\n<p>The goal of the Index is to earn Index score for the team through the collection of Index Points, which are dropped by participants killed in battle. Represented as green, glowing diamonds, Index Points can be collected by walking over them, and then deposited to a designated bank location in order to earn the actual Index score.</p>\r\n\r\n<p>A player can hold multiple Index Points at once, and will gain bonuses the more Index Points they deposit at once, increasing the amount of Index score their team receives from said deposit (e.g. depositing 3 Index Points at once will grant 5 Index score instead of 3). Holding large numbers of Index Points will reduce the player&#39;s health however in a change known as Financial Stress, and if the player is killed their collected Index Points will drop as well, allowing the enemy to pick it up for themselves. The amount of Financial Stress is directly proportional to the number of Index Points being held, which is displayed by the player&#39;s HUD to the upper right.</p>\r\n\r\n<p>In this mission, the Index is segmented into rounds of 3 minutes each. In order to win against Nef Anyo, players must win three rounds of the Index by gathering more Index Points than the opposing team before the time runs out for each round.</p>\r\n\r\n<p>If the player is successful, Nef Anyo relents to release one Myconian prisoner, but exclaims that he will keep the girl in his possession. Back on the Orbiter, the Lotus airs her suspicions to Glast at Nef&#39;s interest in Neewa, asking him what he is hiding, to which Glast responds that Nef may be trying to bait them back into the Index by withholding prisoners.</p>\r\n\r\n<p>Once more, players must challenge the Index a second time to free two more prisoners, now with a minimum wager of&nbsp;120,000 Credits. As with the previous bout, players must win three rounds of 3 minutes in the Index each in order to win the mission.</p>\r\n\r\n<p>After this second mission, Glast will send another inbox message, this time with a smuggled recording from Neewa, where she describes the &quot;dark eyed man&quot; (Nef Anyo) wanting to put them to work.</p>"}, {"id": 136, "quest": 19, "name": "Help Secure Mycona Colony", "description": "<p><strong>Enemy Level:</strong> 25-30<br />\r\n<strong>Tileset:</strong> Infested Ship</p>\r\n\r\n<p>As the Tenno arrive on an Infested Ship, Glast explains that Nef Anyo&#39;s actions have left the colony defenseless, and that three gateways have to be closed in order to secure the colony. Along the way, they come across the colony in a section of the ship that is untouched by the Infestation.</p>\r\n\r\n<p>Once players reach the first of the gates defended by armed colonists known as Hunters, the Tenno must destroy three Infested Tumors that bar the gate, after which players must then defend the Hunters as they attempt to close the gate via a security console near the opening. The Hunter closing the gate must remain alive in order for progress to be made; if the Hunter is killed, the gate will stall, and the gate cannot be closed until another Hunter can get to the security console to continue. The mission will fail if all 6 Hunters are killed.</p>\r\n\r\n<p>Upon closing a gate, players must then repeat the process on two more gates to close them. When the gates are sealed, Glast instructs the Tenno to clear out the remaining Infestation inside one of the rooms within the colony. The Infested continuously spawn from 6 Spawn Pods within the room that must be destroyed in order to clear them out.</p>\r\n\r\n<p>On clearing the Infested, Glast asks the Tenno to return to their ship, as he explains that the Myconians are only safe for the moment. The mission ends when the player reaches extraction.</p>\r\n\r\n<p>Back in the Orbiter, Glast explains that the Perrin Sequence had tried to pay a ransom for the stolen Myconian artifact known as the Triuna and the kidnapped children, only for Nef Anyo to reject them. Glast thus suggests that the Tenno use Nef Anyo&#39;s weakness for gambling by challenging him to the Index, the Corpus&#39; blood sport. A disbelieving Lotus asks Glast why the Tenno should risk themselves in the Index after they&#39;ve already helped them. In response, Glast reveals that the Mycona&#39;s knowledge of the Infested comes from an Old War relic, and explains that they are offering to share that relic with the Tenno as compensation.</p>"}, {"id": 135, "quest": 19, "name": "Starting the Quest", "description": "<p>In order to unlock the Quest, players must have completed The War Within quest, and then speak to Ergo Glast, the leader of The Perrin Sequence, in their room within any Relay.</p>\r\n\r\n<p>Glast will relay to the Tenno the story of the Mycona, a colony whose inhabitants apparently thrive by harvesting material from the Infested. Nef Anyo however has taken not only the Mycona&#39;s resources, but also their children, with Glast showing the Tenno a recording from a child named Neewa, one of the kidnapped children. Before any rescue attempt can be made for the children however, Glast implores the Tenno to first defend the remaining Mycona colonists who are under siege from the Infested.</p>\r\n\r\n<p>If the player accepts the mission, the quest will immediately become active in the Codex. Back on their Orbiter, Lotus expresses her skepticism at a colony surviving an Infested siege. The player will also receive a message from Glast in their inbox, giving them a drawing made by Neewa to remind them of what they are fighting for.</p>"}, {"id": 134, "quest": 18, "name": "Sunrise Apothic", "description": "<p>Once more, players must find the plants that make up the ingredients for the Sunrise Apothic and scan them.</p>\r\n\r\n<table class=\"bg-black-t mr-3 my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>500 Credits</td>\r\n\t\t\t<td>2 Morphics</td>\r\n\t\t\t<td>2 Sunlight Jadeleaf</td>\r\n\t\t\t<td>8 Frostleaf</td>\r\n\t\t\t<td>12 Vestan Moss</td>\r\n\t\t\t<td>Time: 1m</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<ul>\r\n\t<li>Sunlight Jadeleaf can rarely be found on the Grineer Forest tileset on Earth, Usually in watery areas, but only during the tileset&#39;s daytime phase.</li>\r\n\t<li>Frostleaf can be found in large batches by cliffs and valleys on the Corpus Outpost tileset on Venus, Neptune and Pluto. (There&#39;s a known bug that the plant may not spawn unless you set the privacy of the game to &quot;public&quot;, so be aware of that fact. In some cases, just being public is not enough, but you must have people join your squad too.)</li>\r\n\t<li>Vestan Moss can be found scattered on rocks on the Grineer Asteroid tileset, commonly found on Mercury, Phobos, Saturn, Uranus and Sedna. Check under the stairs too. (M Prime, Mercury has a high spawn rate)</li>\r\n</ul>\r\n\r\n<p>As with the previous Apothics, Ordis discovers a voice imprint within it, which he displays to the player:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Ballas is beyond pleased... but when I look at what I&#39;ve built... at Titania, I feel sick creep up my throat. I hate her, a killer made by a healer. No more. I&#39;m going back to where I belong, no matter the cost. I&#39;m going back to the trees to find myself again.</em></p>\r\n\r\n<p><em>These past weeks, I&#39;ve been secretly testing Transference on myself. I can only survive short bursts - linking to Titania the way only Tenno can stand. I&#39;ve never felt anything like it. A tortured presence, like an evil ink, staining my mind. But... it worked. I&#39;m going to use this wrong to make right.</em></p>\r\n\r\n<p class=\"mb-0\"><em>I&#39;ll stowaway with Earth-bound cargo. Just my apothics and these slapdash Somatics I&#39;ve stolen. By nightfall I&#39;ll be home again in my tent under those bitter, acid skies. This time I&#39;m going to fix it. I will seed a mighty forest, stronger than history... and by my will, use it to bring life.</em></p>\r\n</div>\r\n\r\n<p>Amaryn reacts with horrific disbelief at the imprint, realizing that the Silver Grove is not the pure and natural sanctuary she believed it to be, but another artificial creation. Disgusted, Amaryn signs off on the mission. Ordis, however, urges the Tenno to complete their mission, stating his disagreement with Amaryn&#39;s dogmatic beliefs, and how the Tenno are proof one&#39;s actions are more important than one&#39;s origins.</p>\r\n\r\n<p>Upon crafting the Sunrise Apothic, players must return to the Silver Grove one final time with the Sunrise Apothic equipped. The voice of the Grove will converse with Amaryn, asking the leader if she would rather see the forest she swore to protect burn just to spite the Grove itself; Amaryn has difficulty responding. Once the shrine is anointed, the voice will call out again, declaring that it has gained clarity enough to realize the Tenno is not Titania, but another protector much like her. However, the Grove has no power to stop the remaining guardian, and the player is then attacked by an Oberon Feyarch Specter.</p>\r\n\r\n<p>Once the Specter is defeated, the voice bids the player to flee while it holds off the coming Grineer, but Amaryn will bid the Tenno to stay and defend the Shrine until its defenses are fully activated. The player must then defend the Shrine for 2 minutes while it is attacked by Grineer, including Napalms, Flameblades, Elite Lancers and Hyekka Masters. The voice of the Grove admires that the Tenno fights with the same energy that Titania once did.</p>\r\n\r\n<p>With the Shrine completely defended, the voice introduces itself as Silvana, the Archimedian responsible for both Titania and the Silver Grove, now permanently bound to the latter by Transference. When the Orokin learned that she pilfered their resources to create the grove, a battalion of Dax soldiers was sent to burn down the forest, but they were cut down by Titania. Titania&#39;s wounds claimed her in this battle, and she died in the Silver Grove, protecting the woman who hated her the most &ndash; Silvana. Amaryn vows that the player will allow Titania to fly once more, earning Silvana&#39;s gratitude.</p>\r\n\r\n<p>Upon extraction, players will receive the Titania Neuroptics Blueprint. Amaryn will also send a message to the player&#39;s inbox, declaring that the New Loka will need to change its doctrines moving forward to be more accepting of the truth, and giving the Tenno a Titania Blueprint, thus completing the quest.</p>"}, {"id": 133, "quest": 18, "name": "Twilight Apothic", "description": "<p>On receiving the blueprint for the Twilight Apothic, players must once again hunt down for the plants needed to craft it.</p>\r\n\r\n<table class=\"bg-black-t mr-3 my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>500 Credits</td>\r\n\t\t\t<td>2 Morphics</td>\r\n\t\t\t<td>2 Moonlight Jadeleaf</td>\r\n\t\t\t<td>6 Ruk&#39;s Claw</td>\r\n\t\t\t<td>6 Lunar Pitcher</td>\r\n\t\t\t<td>Time: 1m</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<ul>\r\n\t<li>Moonlight Jadeleaf can rarely be found on the Grineer Forest tileset on Earth, but only during the tileset&#39;s nighttime phase.</li>\r\n\t<li>Ruk&#39;s Claw can be commonly found on the Grineer Settlement tileset on Mars, usually on walls and corners.</li>\r\n\t<li>Lunar Pitcher can be commonly found on the Orokin Moon tileset on Lua, either in vases or amongst the rubble.</li>\r\n</ul>\r\n\r\n<p>The Twilight Apothic blueprint also contains a voice imprint, which Ordis will bring up for the player to read:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>My childhood dream has become a nightmare. I don&#39;t blame Margulis, she&#39;s as much a victim as the children we&#39;re working with. At first the project seemed therapeutic and nurturing. I was myself. But now... Transference therapy is being turned into a weapon. Now I build these vile weapons called &quot;Warframes&quot; all for one purpose: death. I&#39;ve become everything I hate.</em></p>\r\n\r\n<p><em>I long for the discomfort of my damp tent. The sick, aimless trees... the barren soil... I know I left my soul back there.</em></p>\r\n\r\n<p class=\"mb-0\"><em>Titania is the next Warframe I&#39;ve been commanded to build, but in secret I&#39;ve been siphoning resources from that project. I have an idea. A way back to that wounded land I call home. A way for me to forget this war and remember what I was.</em></p>\r\n</div>\r\n\r\n<p>Amaryn wonders why the Apothic is 'vandalized' by the presence of the imprint. Nonetheless, she details her plan to seed Earth with the plants found in the Silver Grove due to their purity, while Ordis expresses his wonder at the Silver Grove, stating he's never scanned anything like it on previous missions to Earth.</p>\r\n\r\n<p>Players must return to E Prime upon crafting and equipping the Twilight Apothic to repeat the previous process of anointing the shrine. This time, the disembodied voice outright tells the Tenno to get out, and sends a Saryn Orphid Specter to kill the Tenno. Once the Specter is defeated, the disembodied voice cries out for Titania, pleading her to wake it up. Amaryn is shaken by its words, no longer believing it to be a sacred voice, but a human voice.</p>\r\n\r\n<p>Upon extraction, players will receive the Titania Chassis Blueprint, and the final Apothic blueprint.</p>"}, {"id": 132, "quest": 18, "name": "Nightfall Apothic", "description": "<p>On accepting the quest, players will receive a blueprint for a Nightfall Apothic. In order to craft the Apothic, players must use Codex or Synthesis Scanners to locate and scan the various plants the Apothic needs throughout the system.</p>\r\n\r\n<table class=\"bg-black-t mr-3 my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>500 Credits</td>\r\n\t\t\t<td>2 Morphics</td>\r\n\t\t\t<td>2 Dusklight Sarracenia</td>\r\n\t\t\t<td>6 Moonlight Dragonlily</td>\r\n\t\t\t<td>12 Sunlight Threshcone</td>\r\n\t\t\t<td>Time: 1m</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<ul>\r\n\t<li>The Dusklight Sarracenia can be found in swampy waters in Grineer Shipyard missions, which are most commonly found on Ceres.</li>\r\n\t<li>Both Moonlight Dragonlilies and Sunlight Threshcones can be found on Grineer Forest missions on Earth, however the Moonlight Dragonlilies can only be found during the tileset&#39;s nighttime phase, and Sunlight Threshcones can only be found during the daytime phase.</li>\r\n</ul>\r\n\r\n<p>Along with the blueprint, players will also be shown a voice imprint included with the Apothic, which details the log of an unnamed female Orokin-era researcher.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>My bags are packed, I&#39;m all set to leave. I can&#39;t believe I&#39;ll be working with one of my childhood heroes, Archimidean Margulis! On comms she said she needed the best Infestation biologist there was... I think my knees almost gave out!</em></p>\r\n\r\n<p><em>As I log this, I look out the stained plastic of my field tent into the dead-yellow sky of Earth. I smell the vague Sulphur and toxins leaking through the seals, yet somehow I&#39;m going to miss this place. Leaving her feels like I&#39;m giving up my dream. My dream to see green and blue return to this sick and dying mother of us all.</em></p>\r\n\r\n<p class=\"mb-0\"><em>But I&#39;m frustrated with my lack of progress. I&#39;ve tried everything to accelerate the ailing vegetation, to guide and nurture the soil, but nothing comes of it. I need a change. Now I have that opportunity... and thanks to Margulis, I&#39;m relieved I won&#39;t be drafted into some Orokin War project.</em></p>\r\n</div>\r\n\r\n<p>Once the Apothic has been crafted and then equipped on a player&#39;s Gear, players are then tasked with visiting E Prime on Earth in order to find a small shrine, where players must fight past Grineer patrols to locate it, with Amaryn occasionally giving out pointers as to its location.</p>\r\n\r\n<p>Upon locating the shrine, players must then anoint the large stone altar on the top of the shrine, which will consume the Apothic. This prompts a disembodied voice &ndash; whom Amaryn believes to be the Grove&#39;s sacred voice &ndash; to suddenly speak out, demanding the Tenno to know what they are doing. A hostile Loki Knave Specter and its clones will suddenly appear and attack, which players must kill in order to extract.</p>\r\n\r\n<p>Completing this mission will grant players a Titania Systems Blueprint, along with the blueprint for the next Apothic.</p>"}, {"id": 131, "quest": 18, "name": "Starting the Quest", "description": "<p>The Silver Grove quest can only be unlocked once players have completed The Second Dream and must have a Mastery Rank of at least 7. (* Note: You are able to pick the quest up at Mastery Rank 4, however when attempting to set active and begin the first mission, you will receive an error stating unable to set quest active until you are Rank 7)</p>\r\n\r\n<p>The quest is started by visiting New Loka inside a relay and by asking their leader Amaryn about &quot;The Silver Grove&quot;. Amaryn will explain that the Grineer seek to defile Earth&#39;s purest location, the aforementioned Silver Grove, and that they have a plan to awaken the ancient defenses that guard the place. The quest can then be activated via the Quest menu on the Codex.</p>"}, {"id": 130, "quest": 17, "name": "Fulfill the third vessel's challenge", "description": "<p>With Baro now believing that the story might be true, he once more asks players to prove themselves as Tenno by completing the third vessel&#39;s challenge.</p>\r\n\r\n<p>With conditions identical to the previous two challenges, players must kill their third enemy type. As shown on the vessel, the glyphs and their corresponding enemy are as follows:</p>\r\n\r\n<ul>\r\n\t<li>Denial Bursa</li>\r\n\t<li>Manic</li>\r\n\t<li>Juggernaut</li>\r\n</ul>\r\n\r\n<p>A distressed Baro now pleads to the Tenno to save Inaros as the Grineer have caught wind of the Tenno being in the area, and he claims that he isn&#39;t in it for the money anymore. Like before, placing the vessel by the door will open it and a final vessel will appear in the center. Taking it will cause a Tomb Protector to appear, which is essentially a copy of Inaros armed with a Mutalist Cernos and a Lesion along with its normal abilities. At certain points in the Tomb Protector&#39;s health bar it will retreat to its sarcophagus where it cannot be harmed, and this will cause one of the giant statues in the main room to come to life in the form of a Tomb Protector Effigy which takes the form of Inaros wielding the Lesion. Defeating the Effigy will make the Tomb Protector rise again and summon a Sand Shadow resembling the player while doing so, and this process is repeated until all of the Effigy giants are defeated, and the Tomb Protector is finally able to be destroyed.</p>\r\n\r\n<p>In the conversations leading up to and after the battle with the Tomb Protector, it is revealed that the child being spoken to by the disembodied voice is none other than Baro himself, and the voice was his mother&#39;s. The final narration sees the mother hide Baro away, telling him to pray to Inaros as the Grineer ultimately kill her, and the rest of the colonists. Baro explains that he had long tried to forget those events and that the Tenno have made him remember his true reason for seeking out the treasure. With the components in hand, Baro tells the Tenno that Inaros will rise again.</p>\r\n\r\n<p>Completing the quest will reward the final component for Inaros, the Systems blueprint. Players will also receive the Sacred Urn as an Orbiter decoration.</p>"}, {"id": 129, "quest": 17, "name": "Fulfill the second vessel's challenge", "description": "<p>Baro now believes that the story of Inaros was drawn from an actual Warframe, and once more tasks the player with completing the challenge of the second vessel. Identical to the previous challenge, players must carry the Sacred Vessel in their inventory and kill the required number of a specified enemy. This enemy can be one of the following types:</p>\r\n\r\n<ul>\r\n\t<li>Railgun MOA</li>\r\n\t<li>Hyekka Master</li>\r\n\t<li>Brood Mother</li>\r\n</ul>\r\n\r\n<p>When the challenge is again completed, Baro will once more tell the player to go back to Ara to return the second vessel. This time, however, the Grineer will be present in place of the Infested, whereupon Baro panics at their presence, seemingly scared for both himself and the safety of Inaros, and now wants to hear the rest of the narrator&#39;s story.</p>\r\n\r\n<p>As before, players must find the designated door and deposit the second vessel in order to collect the third one. The narrator continues her story, where after years of peace, the colony was set upon by the Infested, which nearly wiped out the colonists in spite of their prayers to Inaros. With the end seemingly in sight, the surviving colonists were once again saved by Inaros via a sandstorm that eradicated the Infested, but at great cost to himself. The colonists took Inaros&#39; battered body and hid its parts among the four Sacred Vessels to hide it from thieves and raiders.</p>\r\n\r\n<p>The central shrine will now be occupied by a single hostile Tomb Guardian, essentially a gigantic stone Rumbler, which players must defeat. Destroying the Tomb Guardian will make it spawn into numerous smaller versions of itself, and each of these, in turn, will spawn more, smaller copies of themselves upon being destroyed. This process will repeat at least 2 more times before the Tomb Guardians are finally destroyed.</p>\r\n\r\n<p>Baro seems distressed and emotional at this point and is eager to find out more about Inaros as he asks players to return.</p>\r\n\r\n<p>Inaros Chassis Blueprint is rewarded upon completing the mission.</p>"}, {"id": 128, "quest": 17, "name": "Fulfill the first vessel's challenge", "description": "<p>On returning to the ship, Baro exclaims his surprise at the inscriptions on the vessel being a blueprint of sorts, and wonders if a Warframe was entombed there. He then reads an inscription on the vessel, which suggests that they may need to defeat an enemy in order to fulfill its condition, and suggests carrying the vessel into battle. Players can re-examine the vessel by interacting with it in the Orbiter, next to the Codex.</p>\r\n\r\n<p>For this part of the quest, players must kill a number of the specified enemy that is represented by the glyph on the vessel, while the vessel is equipped in the player&#39;s Gear inventory. (Teammates&#39; kills within Tenno Affinity range also count.) Upon killing an example of the correct enemy, the screen will momentarily flash with the Warframe&#39;s energy color, accompanied by a distinct guttural sound. As these enemies are killed, the image on the vessel begins to fill, serving as a status bar indicating how many are left to kill. Upon killing the needed number of the specified enemy, Baro Ki&#39;Teer will tell the Tenno to return to their ship, signifying completion of that step.</p>\r\n\r\n<p>There are three types of enemies that can be designated by the glyph &mdash; a Corpus, a Grineer, and an Infested type &mdash; which will be different between individual players. The enemies associated with a particular glyph, as well as the required number of kills, are shown below:</p>\r\n\r\n<ul>\r\n\t<li>Detron Crewman</li>\r\n\t<li>Seeker</li>\r\n\t<li>Volatile Runner</li>\r\n</ul>\r\n\r\n<p>Once the required number of kills of the specified enemy has been made, Baro will instruct the player to return to their ship to further examine the vessel, where they will find the vessel&#39;s glyph now glowing. Players must then return to the temple in Ara, Mars to return the vessel.</p>\r\n\r\n<p>From the main shrine chamber, players must proceed to a designated door where they must lay down the Sacred Vessel, which will cause the door to open, and reveal another Sacred Vessel at the center of the room inside. Upon players taking the Sacred Vessel in the room, the female narrator from the previous visit continues the story, revealing that Inaros was once a warrior of the &#39;Golden Skymen&#39;, until he could no longer withstand the abductions taking place, with the latest one being that of a child. This culminated in Inaros killing the child&#39;s abductors and returning him to the colony, after which Inaros &#39;ascended&#39; to watch over the colony as their King. Unusually, Baro becomes unnerved the more he hears of the story, asking whether the story might be true.</p>\r\n\r\n<p>At this point a large number of Feral Kavats will attack, which players must eliminate before they can proceed. All the kavat&#39;s can be scanned with the possibility of being rewarded with kavat genetic codes so using a warframe with a sleep ability such as Equinox or Ivara and Rhino&#39;s stomp will make scanning them much easier. After the last Kavat is killed, Baro nervously asks the player to return to their ship.</p>\r\n\r\n<p>Completing this portion of the quest rewards the blueprint for Inaros Neuroptics.</p>"}, {"id": 127, "quest": 17, "name": "Explore the tomb on Desert Tomb", "description": "<p>Baro explains that Mars was a desolate backwater colony, which used to be the home of the &#39;sky worshipers&#39;, a group of colonists that the Grineer exterminated in the past. Despite this, the relics left behind became valuable antiques, and thus the object of interest for Baro. Players must fight through a small contingent of Infested as they proceed.</p>\r\n\r\n<p>The Tenno soon reach a temple carved on the side of a mountain, where Baro scoffs his disbelief at the stories of the &#39;God King&#39; called &quot;Inaros&quot;. As the Tenno explore deeper inside, a disembodied female voice begins to narrate a story to her child about the &#39;Golden Skymen&#39; &mdash; presumed to be the Orokin &mdash; who would abduct people from them, until the arrival of Inaros. The voice unnerves Baro, who can apparently also hear it speaking, asking the Tenno to stop it.</p>\r\n\r\n<p>At the end of the temple path lies a large chamber with a shrine of the God King, where a large jar &mdash; the Sacred Vessel &mdash; lies at its feet, which players must take. Baro preemptively placates the Tenno by justifying the taking of a burial vessel as creating riches instead of defiling a tomb, and orders them to extract.</p>\r\n\r\n<p>The blueprint for Inaros is rewarded at the end of the mission.</p>"}, {"id": 126, "quest": 17, "name": "Starting the Quest", "description": "<p>To unlock the quest, players must first purchase the quest blueprint from Baro Ki&#39;Teer when he visits for 100 Ducats and 25000 Credits, and then construct it in the Foundry under the Keys section. Purchasing the blueprint requires mastery rank 5. The blueprint can also be traded between players.</p>\r\n\r\n<table class=\"bg-black-t mr-3 my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>5000 Credits</td>\r\n\t\t\t<td>5000 Nano Spores</td>\r\n\t\t\t<td>400 Oxium</td>\r\n\t\t\t<td>1 Nitain Extract</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t\t<td>Time: 30s</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: 100 Ducats + 25000 Credits</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>Upon claiming the item, the Quest will appear in the World State Window under the Quest tab, where it will then prompt players to read the new inbox message from Baro Ki&#39;Teer, which will then start the quest.</p>"}, {"id": 125, "quest": 25, "name": "Epilogue", "description": "<p>The Operator finds themselves back on the Orbiter, as if everything they had experienced was nothing but a vision. They find themselves armed with the blueprint for the Paracesis.</p>"}, {"id": 124, "quest": 25, "name": "The Sentient Chamber", "description": "<p>The portal takes the Tenno to a chamber of Sentient design. In this sequence, the player will no longer have control over their character, instead using the fire button (LMB&thinsp;) to Void Dash to certain spots indicated by a glowing light.</p>\r\n\r\n<p>At the end of the chamber, the Tenno spots Ballas, now Sentient-turned, lamenting the loss of his narcissistically beautiful Orokin body and curses the Lotus for her deception. Ballas&#39; eye suddenly glows, which he implies it to be the Lotus&#39; vision, as he begins to wander the room. The player must now stay out of Ballas&#39; sight by using numerous Void Dash points around the room. If he catches glimpse of the player, a bar at the top center of the screen will decrease. If the bar empties, he will spot the player and the mission will fail.</p>\r\n\r\n<p>As Ballas rambles, several metal fragments fall in place in the middle of the room. Upon realizing the presence of the &quot;devil&quot;, the pieces come together to form a sword and Ballas instructs the player to take the &quot;Sentient slayer&quot; for their upcoming war, before looking away. As the Tenno dashes and grips the sword, Ballas abruptly turns to face them and the Lotus&#39; whisper calling for the Tenno can be heard.</p>"}, {"id": 123, "quest": 25, "name": "Lua", "description": "<p>After loading in, the player will be dropped onto Lua. They must follow The Man in The Wall, who continues to wear the Lotus&#39; headgear. Three times during the chase, a barrier erects itself that will trap the Tenno within, and in order to escape players must defeat shadow-like incarnations of the Lotus.</p>\r\n\r\n<p>The Tenno are lead to the Reservoir and drop down into a pit and are forced into Operator mode, falling into the chamber where they encountered the Lotus and Ballas during the Apostasy Prologue. At the end of the chamber is a portal that the Tenno must enter.</p>"}, {"id": 122, "quest": 25, "name": "The Orbiter", "description": "<p>In the Orbiter&#39;s Personal Quarters, The Man in The Wall sits on the plinth that carries the Lotus&#39; headgear, donning it with a sinister laughter before vanishing and the headgear returns to its original position. Approaching the headgear and touching it will transition the Tenno into the loading screen.</p>"}, {"id": 121, "quest": 25, "name": "Starting the Quest", "description": "<p>In order to access this quest, the player must have first completed The Sacrifice quest.</p>"}, {"id": 120, "quest": 16, "name": "Aftermath", "description": "<p>A new inbox message will be given upon completion of the quest, giving players the Excalibur Umbra Sunder Helmet, the Umbra&#39;s Courtyard Scene for Captura, and Excalibur Umbra Agile and Noble animation sets.</p>\r\n\r\n<p>Following completion of quest, if the player encounters The Man in The Wall, they will ask the Operator if they are &quot;feeling better, kiddo?&quot; The Operator responds &quot;I killed him... Isaah.&quot; After confirming that that is how the Operator remembers it, the Man in The Wall simply acknowledges and vanishes.</p>"}, {"id": 119, "quest": 16, "name": "Return to Earth", "description": "<p>The Operator and Excalibur Umbra return to the courtyard on Earth to confront Ballas. Surprised at the turn of events, Ballas declares both will burn and sets a tree ablaze while projecting a shield around him as Sentients arrive to fight. After disposing the Sentients, Ballas commands Excalibur Umbra to stop, forcefully halting his movements. Ballas boasts and approaches the paralyzed Warframe, only to discover the Skiajati impaling him. Excalibur Umbra momentarily hesitates and tries to release his grip before being stopped by the Operator, who drives the blade in and proceeds to taunt Ballas with the following options:</p>\r\n\r\n<ul>\r\n\t<li>[Sun] Squirm like the maggot you are.\r\n\t<ul>\r\n\t\t<li>&quot;I... I am just the stone... she is the hand.&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Neutral] This was inevitable.\r\n\t<ul>\r\n\t\t<li>&quot;Yes... yes... she has foreseen it.&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Moon] The cycle is broken.\r\n\t<ul>\r\n\t\t<li>&quot;Now I know... what she sees in you.&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Ballas seemingly succumbs from his wounds as more Sentients arrive. As the Operator demands the Lotus&#39;s whereabouts from Ballas, a much larger Sentient drops in: Natah &ndash; the Lotus&#39;s true form. She claims that Ballas had done nothing to her and that this is what she is. The surrounding Sentients open fire on the Operator, but is taken to safety by Excalibur Umbra. Natah picks up Ballas&#39;s body before leaving a cryptic warning: &quot;Mother... I am coming home&quot;. She then flies off and disappears.</p>\r\n\r\n<p>Back on the Orbiter, Ordis and the Operator are confused and in disbelief at the sudden turn of events, and the Operator then expresses resolve in finding out the truth.</p>"}, {"id": 118, "quest": 16, "name": "Confront Umbra", "description": "<p>The Operator appears in this mission alone, telling Ordis that Excalibur Umbra is there and needs to be found. Excalibur Umbra once again must have his shields shot down with Void Beam, stunned with Void Blast, and his mind entered with Transference.</p>\r\n\r\n<p>This time, the Operator appears in Excalibur Umbra&#39;s final memory as he is instructed by Ballas to kill Isaah. The Operator tells Umbra that Ballas is at fault and they will fight him together. After the memory, the Operator appears within Umbra&#39;s mind. Following the path, the Operator hears Isaah&#39;s voice from the memories. At the end of the path, the Operator finds Excalibur Umbra crying, and kneels. Excalibur Umbra eventually becomes at ease with the Operator&#39;s presence and finally accepts Transference, as the cut-off Vitruvian recording monologues that the Orokin broke the minds of the Warframes, but the Tenno, through their experience on the Zariman, were somehow able to see inside the broken creature and take away their pain. A dialogue choice is prompted to the player:</p>\r\n\r\n<ul>\r\n\t<li>[Sun] Wrath.\r\n\t<ul>\r\n\t\t<li>&quot;We use this memory. It fuels our wrath.&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Neutral] Acceptance.\r\n\t<ul>\r\n\t\t<li>&quot;We accept this memory, and move beyond its reach.&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Moon] Emptiness.\r\n\t<ul>\r\n\t\t<li>&quot;We return this memory to the Void and find peace in our emptiness.&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>The player now has complete control over Excalibur Umbra, who is automatically at level 30 and armed with the Skiajati nikana and pre-installed with the mods Umbral Intensify, Umbral Fiber, Umbral Vitality, Sacrificial Steel and &nbsp;Sacrificial Pressure. In addition to having Excalibur&#39;s powers, Radial Blind is upgraded into Radial Howl which removes Sentient resistances, and Excalibur Umbra&#39;s sentience allows him to fight on his own when not piloted by the Operator. Sentients arrive and must be dealt with before heading to extraction, impeded by more Sentients as well as Corrupted. A Somachord fragment can be found in a cave in the room where Excalibur Umbra is fought.</p>\r\n\r\n<p>At the Orbiter, the Operator now seeks to hunt down Ballas, but tells Ordis to play a recording of the Lotus&#39;s voice. Ordis asks what recording he should play:</p>\r\n\r\n<ul>\r\n\t<li>[Sun] The war...\r\n\t<ul>\r\n\t\t<li>\"Now we fight on two fronts, my child. The war without... and the war within.\"</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Neutral] Dream...\r\n\t<ul>\r\n\t\t<li>\"Dream, not of what you are, but of what you want to be.\"</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Moon] My child...\r\n\t<ul>\r\n\t\t<li>\"My child... so beautiful to behold. How do you feel?\"</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>"}, {"id": 117, "quest": 16, "name": "Pursue Umbra", "description": "<p>Many dead Corpus lie ahead. Excalibur Umbra kills all the Sentients within his vicinity and uses Radial Howl to escape, leaving the Operator trapped by Mimics. A Somachord fragment appears in the lockdown room, on a bridge to the left of the entrance. When Excalibur Umbra is confronted again, he is once again invulnerable to Warframe attacks, and now has shields that prevent him from being affected by Void Blast. During this fight, Umbra&rsquo;s attacks will also be able to damage the Operator even when they are in Void Mode. Shooting down the shields with the Void Beam and stunning Excalibur Umbra with the Void Blast leaves him open for Transference and allows the Operator to go into another memory.</p>\r\n\r\n<p>In this memory, the man has difficulty breathing with Infested growth appearing in his vision as he is losing to Ballas at Komi. Isaah then points to the man&#39;s Shawzin instrument, unlocking another Vitruvian symbol, as the game of Komi resumes. Ballas telepathically monologues that he betrayed the Orokin after they had killed Margulis, and informs the man that the Infested cultivates within him, slowly transforming him into a Warframe, a miracle that requires a sacrifice. Hearing this, the man mistakenly places his Komi stone into a trap.</p>\r\n\r\n<p>Through the memories the Operator realizes that Ballas intends to kill Isaah, confusing Ordis as these are just memories. The next Vitruvian symbol, &quot;Tenno&quot;, tells of how the Orokin kept the survivors of the Zariman in the Reservoir, using Transference to merge Tenno&#39;s minds into the bodies of the Warframes. This entry also reveals that Ballas had sent coordinates to the Reservoir to Hunhow, but warns him not to underestimate the Tenno &quot;monsters.&quot;</p>\r\n\r\n<p>Unwilling to hear the rest of the recording, the Operator abruptly cuts off the Vitruvian and uses Transference to appear at the Navigation console, intending to confront Excalibur Umbra alone.</p>"}, {"id": 116, "quest": 16, "name": "Search for Umbra", "description": "<p>Realizing the Vitruvian codes are locked within Excalibur Umbra&#39;s memories, the Operator proceeds to track him down. On Ceres, Excalibur Umbra is engaged in battle with the Grineer, having left a trail of bodies in its path. While en route, a Somachord fragment can be found on the scaffolding of a large crane. When confronted, Excalibur Umbra is already battling the Grineer and is impervious to all damage, while his attacks ignore the Void Mode&#39;s immunity. Using Void Blast will stun Excalibur Umbra, allowing Transference to be used on him.</p>\r\n\r\n<p>In this memory, the man and Ballas are playing a game of Komi. After a few rounds, Ballas commends the man&#39;s heroism and points out a commissioned portrait of his servitude as a Dax. Looking at the portrait unlocks another Vitruvian symbol; as Ballas asks Isaah if he will follow his father&#39;s footsteps, Ballas telepathically threatens the figure stating that the &quot;game&quot; of Komi represents Ballas culling the figure&#39;s bloodline for attempting to interfere with Ballas&#39;s defection.</p>\r\n\r\n<p>Excalibur Umbra escapes again, and the Operator returns to the Orbiter. On the way to extraction, Sentient Conculysts appear on the scene. The next Vitruvian symbol, &quot;Warframes&quot;, has Ballas reveal that the Warframes were created from human subjects as Infested-hybrids converted by the Helminth as a means to fight against the Sentients led by Hunhow. However, Ballas calls the Warframes a failure as they turned on their creators, but there lies a secret hidden within the Void.</p>\r\n\r\n<p>Ordis reboots out of his new personality and tries to get the Operator to stop due to potential dangers. However, the Operator is undeterred, believing that Excalibur Umbra is leading to something.</p>"}, {"id": 115, "quest": 16, "name": "Explore Lua", "description": "<p>The Operator tells Ordis that the Excalibur Umbra tried to attack Ballas, surprising Ordis as Warframes were supposed to be controlled through Transference. The waypoint leads to a unique Orokin Memory Cipher terminal that cannot be bypassed, so Ordis suggests searching the area for clues. As it is a memory cipher, that is it requires the correct sequence as a genuine memory from the user, it cannot be brute-forced even with the correct sequence until all parts have been memorized by the Operator. There are two blue symbol pairs around the area; to solve the Cipher, players must match the cipher to the order of the symbol pairs discovered. Beyond the unlocked door, Sentient Mimics lie in ambush; these Old War Sentients carry beam rifles and have the same damage resistances as Battalysts and Conculysts do.</p>\r\n\r\n<p>Up ahead is yet another Orokin Cipher, with four symbol pairs nearby. Also in the room with the cipher is a Somachord fragment high up on the rafters. This cipher is more complex, as the discovered symbols will rearrange themselves above the cipher rings. Should the player take too long with the sequence, Ordis will help solve the puzzle automatically. The cipher unlocks a dome that Ordis believes to have contained Excalibur Umbra. Somewhere inside the dome is an Orokin tablet, containing a spiraling series of recurring glyphs, with the single one interactable highlighted blue: &quot;Enemy&quot;. This entry, a recording by Ballas, states the codices within reveal a hidden weakness to the Warframes. Ordis identifies the tablet as a Vitruvian and suggests destroying it, but the Operator decides to take it back to extraction for analysis.</p>\r\n\r\n<p>In the midsection of the Orbiter is an area where the Vitruvian can be inserted. When the Vitruvian is inserted Ordis expresses his regret at not being more forceful in rejecting the Operator&#39;s orders, before the Orbiter tilts and all its lights turn off momentarily. Ordis regains control, but his &quot;vestigial&quot; precepts regulating his ability to &quot;care&quot; about things have been knocked offline, causing him to display a new, emotionless personality, and he calls the Operator &quot;Star-Child.&quot; He tells the operator to check the Foundry again, where Excalibur Umbra can now be built.</p>\r\n\r\n<table class=\"bg-black-t mr-3 my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>10000 Credits</td>\r\n\t\t\t<td>1 Orokin Cell</td>\r\n\t\t\t<td>60 Kuva</td>\r\n\t\t\t<td>1200 Nano Spore</td>\r\n\t\t\t<td>1600 Alloy Plate</td>\r\n\t\t\t<td>Time: 10s</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>When the Operator attempts to equip Excalibur Umbra in the Arsenal, he unexpectedly rejects the Transference, displaying sentience as he lashes out against the Operator. During the struggle, the Operator manages to perform Transference on Excalibur Umbra and accesses a memory.</p>\r\n\r\n<p>The memory is of a man lying in a hospital bed who has fallen ill and is unable to speak, with Ballas and a Dax soldier - who turns out to be the man&#39;s son called Isaah - by his bedside, with Ballas telepathically conversing with the man and threatens to kill his son. Excalibur Umbra escapes, but this act unlocks a symbol within the Vitruvian, &quot;Blasphemy&quot;, where Ballas curses the Sentients for their betrayal and starting the Old War.</p>"}, {"id": 114, "quest": 16, "name": "Investigate Sentient Energy", "description": "<p>On landing, Grineer Ghouls lie in wait. Follow the waypoint, leading to an Orokin door covered in vines which must be destroyed. As the door mechanism slowly opens, swarms of Ghouls appear and attack. Behind the door leads to a large courtyard, the same one shown in the Operator&#39;s vision. Equip the Codex Scanner or Synthesis Scanner (Helios will work as well) and search around for traces of the Warframe (looking back towards the entrance from the cherry blossom tree):</p>\r\n\r\n<ul>\r\n\t<li>The Skiajati nikana - embedded right next to the tree</li>\r\n\t<li>The shawl cloth - hanging from a stone surface to the rear-left side of the graveyard</li>\r\n\t<li>The helmet - directly to the right besides a rock, near the nikana</li>\r\n\t<li>Remains - besides a grave stone in the middle-right side of the graveyard</li>\r\n\t<li>A Somachord fragment can be found under the walkway&#39;s right side at the courtyard&#39;s entrance</li>\r\n</ul>\r\n\r\n<p>Once this is accomplished, extraction awaits, with Ghouls preparing for another ambush.</p>\r\n\r\n<p>Ordis has synthesized the discovered traces in the Foundry as a new Warframe: Excalibur Umbra. However, the data to build this Warframe is insufficient. Remembering that Ordis detected trace minerals from Lua on the nikana, the Operator suggests searching there.</p>"}, {"id": 113, "quest": 16, "name": "Starting the Quest", "description": "<p>After completing Apostasy Prologue, players may start this quest in the Codex.</p>\r\n\r\n<p>On starting the quest, the Lotus&#39;s whisper can be heard, calling for the Tenno. The player is prompted to examine her helmet in the Orbiter&#39;s Personal Quarters. The Operator touches the helmet and sees a vision of a black and gold Warframe being subdued and obliterated on Earth by Ballas and Sentients.</p>"}, {"id": 112, "quest": 15, "name": "Epilogue", "description": "<p>Back at the Orbiter, Ordis states that he will search for the Lotus&#39; current whereabouts and in the meantime attempt to synthesize the Lotus&#39; mission directives.</p>"}, {"id": 111, "quest": 15, "name": "The Jade Light", "description": "<p>There, the player will hear echoes of the last few moments leading up to Margulis&#39; execution and find a pod at the end of the hall, where a cutscene will play.</p>\r\n\r\n<p>As the pod opens the Lotus is revealed inside, with wires connecting to the back of her head. The Lotus extends a greeting, and before the Operator can reply, Ballas himself replies to it. He then steps forward and apologizes to the Lotus for being gone for so long. The Lotus tries to explain that she is not Margulis, but Ballas insists and waves out his hand. A wave of energy flows out (which also slightly distorts the player&#39;s screen similar to the Somatic disruption during The Second Dream) and the Lotus is detached from the pod.</p>\r\n\r\n<p>She then removes her mask as Ballas promises not to abandon &quot;Margulis&quot; again, and takes his hand. Both Ballas and the Lotus walk into a blinding light away from the Operator. Attempting to follow Ballas, the Operator is knocked back by an energy shockwave instead.</p>\r\n\r\n<p>After the Lotus and Ballas disappear the Operator clutches the Lotus&#39; dropped helmet, looking around confused at now being alone.</p>"}, {"id": 110, "quest": 15, "name": "Lua", "description": "<p>After loading in, the player will find themselves on Lua to find yet another orb. This time, approaching the orb will reveal a purple trail that will lead the player through the map. While following the trail the player will hear past dialogue between Margulis and Ballas, from before Margulis&#39; execution.</p>\r\n\r\n<p>At the end of the trail is a broken Reservoir. The trail will lead down a pit where the player will jump down and be forced to enter Operator mode.</p>"}, {"id": 109, "quest": 15, "name": "The Orbiter", "description": "<p>In the Personal Quarters, a holographic, violet Lua orb can be seen floating at the end of the room near the port window. Approaching the orb and touching it will transition the Tenno into the loading screen. The player cannot be in a squad as they touch the object.</p>"}, {"id": 108, "quest": 15, "name": "Starting the Quest", "description": "<p>In order to access this quest, the player must have first completed the Chains of Harrow quest, as well as have access to their Orbiter&#39;s Personal Quarters.</p>"}, {"id": 107, "quest": 14, "name": "Epilogue", "description": "<p>On the Orbiter, players may randomly encounter a doppelganger of their Operator performing random actions inside (such as checking out machinery or sitting down), who will then greet them with &quot;Hey Kiddo&quot;. The doppelganger will disappear if the player looks away.</p>"}, {"id": 106, "quest": 14, "name": "Enter the Temple", "description": "<p><strong>Enemy Level:</strong> 25 - 25<br />\r\n<strong>Tileset:</strong> Orokin Derelict</p>\r\n\r\n<p>The player must now proceed deep inside an Orokin Derelict which houses the Warframe in which Rell&#39;s consciousness is imprisoned, as Palladino reveals that the Warframe must be destroyed, killing Rell along with it to grant him peace. Players must find the central temple room, consisting of a large tree red with embers, and enter through a hole in its base to get below. Halfway down, Palladino asks that the Tenno only enter via their &quot;true, sacred form&quot;, thus forcing them to exit via Transference as the Operator.</p>\r\n\r\n<p>The Operator soon reaches the altar, where a Warframe is hung by chains in the center. Palladino asks the Operator to destroy the chains so Rell can be freed, and the player must use their Void Beam to destroy the chains that are lit in blue. Destroying the first chain however reveals that there is a malevolent being inside the Warframe that is not Rell, who then begins attacking the Operator with fireball attacks while sending Red Veil Fanatics against them.</p>\r\n\r\n<p>To defeat the boss, players must first kill all Red Veil Fanatics on the field, after which up to three of the chains holding the Warframe will turn blue, allowing the Operator to destroy them with their Void Beam. Players must be wary as the boss will occasionally appear to launch fireballs against the Operator. After each set of chains is destroyed, the players will be taken to the card minigame from earlier, only this time they must choose one of three cards to respond with, and there is no &quot;wrong&quot; answer.</p>\r\n\r\n<p>Upon destroying all the chains, the Warframe itself is destroyed, and Rell finally appears as his true self as Palladino urges him to be free. When he asks about the &#39;man in the wall&#39;, Palladino replies that the Tenno will take on that responsibility for him, who has earned his rest.</p>\r\n\r\n<p>Completing this mission will grant the player the blueprint for the Harrow Warframe, as well as the ability to permanently access Iron Wake on Earth.</p>"}, {"id": 105, "quest": 14, "name": "Capture Rell's Manifestations (Part 3)", "description": "<p>Enemy Level: 25 - 35<br />\r\nTileset: Grineer Forest</p>\r\n\r\n<p>The Lotus wonders how Rell has lived so long without cryosleep, and Palladino clarifies that he has transferred his entire consciousness to his &#39;undying vessel&#39;, aka his Warframe, before asking the Red Veil to chain the Warframe. One last message is encountered by the player upon encountering the first of Rell&#39;s emotions:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><strong><em>What is Evil but indifference</em></strong></p>\r\n</div>\r\n\r\n<p>Once more, players must find all three of Rell&#39;s emotions and defeat them, while escaping his manifestation&#39;s attacks.</p>\r\n\r\n<p>After all three emotions are defeated, Palladino exclaims that Rell&#39;s spirit has returned to his Warframe, and asks the player to come to the Temple where he is kept to perform one last act. Meanwhile, Lotus ascribes the occurrences that Rell describes as psychological damage caused by his prolonged Transference loop in the void.</p>"}, {"id": 104, "quest": 14, "name": "Capture Rell's Manifestations (Part 2)", "description": "<p><strong>Enemy Level:</strong> 25 - 35<br />\r\n<strong>Tileset:</strong> Grineer Sealab</p>\r\n\r\n<p>Palladino now warns the player that the manifestations are becoming stronger, and urges the Tenno to bring Rell home to the &#39;temple&#39;. Lotus asks whether Rell is resting in this temple in cryosleep like the other Tenno on Lua, which Palladino answers that they didn&#39;t have that option. The player then runs across another blood message on the floor:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><strong><em>You rejected him<br />\r\nHe saved you</em></strong></p>\r\n</div>\r\n\r\n<p>Players will be facing more Red Veil Fanatics in this mission, along with zombies. Like the previous mission, players must trap and defeat all three of Rell&#39;s emotions using Kinetic Siphon Traps, then extract once the objective is complete.</p>"}, {"id": 103, "quest": 14, "name": "Capture Rell's Manifestations (Part 1)", "description": "<p>Before entering the next three missions, players must ensure that they are carrying a sufficient number of Kinetic Siphon Traps in their Gear inventory.</p>\r\n\r\n<p>Lotus and Palladino discuss the nature of Rell&#39;s warnings, which appear to be the phenomenon known as Void Exposure. Though Lotus claims that its effects are well understood, Palladino claims that only Rell has seen its true nature as an entity &quot;old as stars&quot;.</p>\r\n\r\n<p>The player then comes across a message scrawled on the floor:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><strong><i>Blinded<br />\r\nshe cast him out</i></strong></p>\r\n</div>\r\n\r\n<p>After which a manifestation of Rell&#39;s emotion will appear, which can be distinguished by having a pure black body and a white drawn face on its head. This particular manifestation can be restrained using a Kinetic Siphon Trap, which will allow it to be damaged and killed. If the emotion is not defeated immediately, it will teleport to a different part of the map, making tracking it difficult.</p>\r\n\r\n<p>Once the first emotion is defeated, Rell&#39;s manifestations will begin hunting down the player, and unlike the emotions these cannot be killed, while at the same time possessing powerful attacks that can damage and kill the player. The manifestation&#39;s observed abilities include:</p>\r\n\r\n<ul>\r\n<li>A slowing aura that drastically reduces movement speed if the player gets too close.</li>\r\n<li>The ability to cast Condemn to trap the player.</li>\r\n<li>An area-of-effect attack similar to Hallowed Ground.</li>\r\n<li>Creating multiple ghostly copies of itself that attack the player in melee.</li>\r\n<li>Launching a salvo of damaging red fireballs that can home in on the player.</li>\r\n</ul>\r\n\r\n<p>Players must find, trap and destroy two more emotions while evading Rell&#39;s attacks. Players can extract once all three emotions are defeated.</p>"}, {"id": 102, "quest": 14, "name": "Return to Iron Wake", "description": "<p>Going back to Iron Wake, the player gives back the relic to Palladino, who uses it to commune with Rell. A short minigame, which represents Rell&#39;s past, will then commence, in which the player is shown cards with a face drawn on it, and they must choose the appropriate emotion the face displays from four different choices. At the completion of the game, the Lotus tells the player that she may have a theory as to Rell&#39;s nature, and asks the player to return to their ship.</p>\r\n\r\n<p>Back on the Orbiter, the Lotus proposes her theory that Rell&#39;s manifestations are Transference energy split apart from a single mind, and asks if they can be captured. Ordis then proposes that the Kinetic Siphon Traps sold by Cephalon Simaris can be repurposed and used for the task.</p>"}, {"id": 101, "quest": 14, "name": "Find Rell's Relic", "description": "<p><strong>Enemy Level:</strong> 20 - 25<br />\r\n<strong>Tileset:</strong> Corpus Ship</p>\r\n\r\n<p>Similar to the last ship, the Corpus ship the player arrives in is darkened and devoid of crew. A discovery highlight leads to a wall with the message.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em><strong>He suffers while you dream</strong></em></p>\r\n</div>\r\n\r\n<p>Spelled out in blood, leading Palladino to the conclusion that Rell is lashing out. Conversation between Palladino and the Lotus reveal that Rell was a Tenno who was outcast by Margulis, explaining why the Lotus does not know of him, and that the Veil was founded when their foremothers took in Rell to study his teachings. A mysterious voice describing a &#39;man in the wall&#39; then echoes through the ship, and Palladino asks the player to follow the voice.</p>\r\n\r\n<p>Upon arriving at the source of the voice in a room filled with dead Red Veil corpses, players must retrieve the relic, a golden horseshoe-shaped object called the Donda, a relic important to Rell. Once the relic is acquired however, a hostile shadowy manifestation of Rell will appear, who will reanimate the Red Veil bodies as zombies. As the Rell manifestation cannot be killed by any means, Palladino orders the player to run back to the ship to escape.</p>"}, {"id": 100, "quest": 14, "name": "Meet Palladino at Iron Wake", "description": "<p>In light of the rescue, the player is granted access to Iron Wake, which turns out to be a Steel Meridian outpost located on Earth. The player, who must use Transference (default 5&thinsp;) to enter the guest quarters, meets with Palladino, who is under heavy guard. She introduces herself as Red Veil&#39;s spiritual medium, who explains the situation regarding Rell, their spiritual focus and the basis upon which the Red Veil was founded. Rell has disappeared from his vessel, making Palladino unable to commune with him and driving many of their members mad. Palladino asks that the player retrieve a relic that was stolen from him in order to calm him. Lotus is suspicious of Palladino&#39;s motives, but asks the Tenno to go along their schemes for now.</p>"}, {"id": 99, "quest": 14, "name": "Investigate the Message", "description": "<p><strong>Enemy Level:</strong> 20 - 25<br />\r\n<strong>Tileset:</strong> Grineer Galleon</p>\r\n\r\n<p>Upon arrival, the Lotus informs the player that the ship is running on emergency power with no crew, and asks them to search. Their first discovery, indicated by a yellow circular area highlighted on the minimap, leads them to a place where dead Grineer lay with knives sticking out of them, while a second highlighted discovery shows blood smeared on the wall in the shape of the Red Veil symbol. The last highlight shows a blood-smeared message on a wall spelling the message:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><strong><em>You cast him out</em></strong></p>\r\n</div>\r\n\r\n<p>At which point a garbled transmission from a person named Palladino contacts the player, claiming to be from the Red Veil and asking for protection, with her location being marked on the minimap. En route, players will then face multiple hostile Red Veil Fanatics armed with various weapons like the Rakta Cernos, Rakta Dark Daggers, and the Tetra. Palladino states that the Red Veil is in chaos following the departure of their &#39;sacred muse&#39;, and asks to be taken to a place called Iron Wake.</p>\r\n\r\n<p>Palladino can be found with a Kavat called Rook, at which point a horde of shambling, nameless and weaponless Red Veil operatives will begin to attack. Players must then defend Palladino from the horde until the timer runs out, after which they can then proceed to extraction.</p>"}, {"id": 98, "quest": 14, "name": "Starting the Quest", "description": "<p>To unlock the quest, players must have completed The War Within quest. In addition, players must accomplish the Mot Survival node in the Void, the end node of the Void branch accessible via Sedna. Once both conditions are met, the quest will become available from the Codex.</p>\r\n\r\n<p>Ordis begins receiving a transmission from their Syndicate channel, originating from the Red Veil. The playback involves a female voice, urging someone named Rell to tell them where he is. The player&#39;s vision gradually turns red before blacking out by the end of the message, and then returning to normal afterwards, at which point Ordis claims that the message is haunted, and tries to discourage the Tenno from investigating. Nonetheless, he has tracked the signal to an abandoned Steel Meridian ship in Earth orbit.</p>"}, {"id": 97, "quest": 13, "name": "Epilogue", "description": "<p>Upon crafting the final piece of Mirage, Ordis reads out the last transcription on Mirage&#39;s chassis.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Operator,</em></p>\r\n\r\n<p><em>You&#39;re done! Mirage&#39;s Chassis is complete. You have all three parts, the only thing you have left is to acquire the Warframe blueprint.</em></p>\r\n\r\n<p><em>Predictably I found something else inscribed on the Chassis:</em></p>\r\n\r\n<p><em>Three acts complete, the end draws near,</em></p>\r\n\r\n<p><em>soon Mirage will cause fear.</em></p>\r\n\r\n<p><em>Memory lost, to be reborn,</em></p>\r\n\r\n<p><em>a new warrior rises, duty sworn.</em></p>\r\n\r\n<p><em>When will the operator be adding this Warframe to the Arsenal?</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Ordis, Ship&#39;s Cephalon</strong></p>\r\n</div>\r\n\r\n<p>After the chassis is built, you can obtain the Mirage Blueprint from the Market, while at the same time completing the quest.</p>"}, {"id": 96, "quest": 13, "name": "Resolution", "description": "<p>The Tenno deploys back to Charybdis, Sedna to do a Hive Sabotage mission set in an Infested Ship, levels ranging from 30-40 while the Lotus continues to recover more imprints. As the Tenno destroys the first hive, the Lotus received more of Mirage&#39;s imprints from the ship, only to find out that she is dying from her valiant effort.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em>I see the eyes open and the heat blinds me. I hear her comforting me, telling me not to despair as the Warframe disintegrates and I lose her, forever.</em></p>\r\n</div>\r\n\r\n<p>Upon destroying the hives, the Lotus had managed to recover the very last blueprint of the now-extinct Warframe.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em>Tenno, the last piece of her... of Mirage... has been recovered.</em></p>\r\n</div>\r\n\r\n<p>Upon completing the mission and returning to your ship, you will be rewarded the Mirage chassis blueprint. The Lotus will immediately order you to forge the Mirage Warframe.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em>Tenno, that was the last of the imprints. Forge this Warframe in honor of these memories.</em></p>\r\n</div>"}, {"id": 95, "quest": 13, "name": "Riddle Three", "description": "<p>As expected, upon crafting the Mirage systems, there is another hidden transcription on the systems. Ordis recites the transcribed riddle again, along with his comment on it. The riddle can be viewed again in the inbox.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Operator,</em></p>\r\n\r\n<p><em>It is as if the person writing these messages wanted Mirage to be found. Within the newly crafted Mirage Systems, Ordis found this:</em></p>\r\n\r\n<p><em>One more act before your prize is caught.</em></p>\r\n\r\n<p><em>An ancient sea creature, take a whirl or not?</em></p>\r\n\r\n<p><em>Look for the monster that swallowed sailors of yore.</em></p>\r\n\r\n<p><em>Make a mistake and you&#39;re sunk. Nothing more.</em></p>\r\n\r\n<p><em>That&#39;s the worst one yet! Though, Ordis must admit, they are clearly referencing something. Operator, you appear to be good at this sort of thing, can you find the final blueprint?</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Ordis, Ship&#39;s Cephalon</strong></p>\r\n</div>\r\n\r\n<p>Charybdis, Sedna is the answer. In Greek mythology, Charybdis was a sea monster, later rationalized as a whirlpool and considered a shipping hazard in Strait of Messina. It is said that three times a day, Charybdis swallowed a huge amount of water, before belching it back out again, creating large whirlpools capable of dragging a ship or even a galleon underwater.</p>"}, {"id": 94, "quest": 13, "name": "Intervention", "description": "<p>Calypso is a Survival mission set in an Infested Ship with their level ranging from 25-35. Completing this mission will award the Mirage systems blueprint, which the player must craft in order to continue the quest. During the mission, The Lotus recovers more of Mirage&#39;s void imprint, further describing Mirage&#39;s slow death.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>I&#39;m sensing another void imprint. It&#39;s dark. I see the glow of restraints around the Warframe. I&#39;m trying to surge the revive system but I can&#39;t, I&#39;m too far away. A great, faceted eye watches her.</em></p>\r\n\r\n<p class=\"mb-0\"><em>I tell her I won&#39;t lose her. That I have another ship on its way. She is smipng because she knows I am lying... Tenno... the second blueprint has been recovered.</em></p>\r\n</div>"}, {"id": 93, "quest": 13, "name": "Riddle Two", "description": "<p>Upon completing the Mirage Neuroptics, Ordis finds out that there is another hidden transcription on the helmet. He will begin to recite the transcribed riddle again, along with his opinion on it. The riddle can be viewed again in the inbox.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Operator,</em></p>\r\n\r\n<p><em>To think, Ordis thought that mess of words was nothing but the scrawpng of some long dead hack. You saw more. Now you have the helmet for a whole new class of Warframe. Very impressive Operator.</em></p>\r\n\r\n<p><em>Exciting news. Ordis found more writing on the inside of Mirage&#39;s helmet:</em></p>\r\n\r\n<p><em>To build the one you think witty,</em></p>\r\n\r\n<p><em>seek the nymph who sang oh so pretty.</em></p>\r\n\r\n<p><em>She lured him in with her song and grin,</em></p>\r\n\r\n<p><em>his wife must&#39;ve thought it a pity.</em></p>\r\n\r\n<p><em>I have no idea what that means, though if I had to describe its pterary merit I might use another word that rhymes with &#39;witty&#39;.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Ordis, Ship&#39;s Cephalon</strong></p>\r\n</div>\r\n\r\n<p>The answer to this riddle is Calypso, Saturn. In Greek Mythology, Calypso was a nymph who is popularly remembered for her role in Homer&#39;s epic poem, Odyssey. It is said that Calypso enchanted her singing to trap the fabled Greek hero Odysseus in her island and make him her immortal husband &ndash; Forcing Odysseus to be separated from his wife, Penelope.</p>"}, {"id": 92, "quest": 13, "name": "Interruption", "description": "<p>Olympus is an Extermination mission using the Infested Ship tileset, with Infested enemies around level 30. Completing this mission will award Mirage Neuroptics blueprint, which the player must craft in order to continue the quest.</p>\r\n\r\n<p>During the mission, the Lotus will send cryptic transmissions to the Tenno, which uncover clues to the War of the Sentients. The first transmission is received at the start of the mission.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>There&#39;s a strange energy in the area. A void imprint, an old one. I&#39;m getting faint visuals &ndash; memories.</em></p>\r\n\r\n<p class=\"mb-0\"><em>Continue the mission while I investigate.</em></p>\r\n</div>\r\n\r\n<p>A little farther into the Extermination mission, once at a quarter of the enemies have been taken down, the Lotus will follow up with a second transmission.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>The Void imprint... it&#39;s old. I see... Worm ships coming out of punch! A Warframe fighting Sentients... shields are failing...</em></p>\r\n\r\n<p class=\"mb-0\"><em>Sorry, Tenno, I&#39;m not sure what that was.</em></p>\r\n</div>\r\n\r\n<p>It is apparent that the Lotus is seeing flashbacks from the War of the Sentients, an event first mentioned in the Excalibur/Excalibur Prime codex entries.</p>\r\n\r\n<p>Finally, once all Infested have been exterminated and the Tenno make their way to extraction, the Lotus will leave the Tenno with this message.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>I see the Sentients crashing down on her, dying in overwhelming numbers. Now she&#39;s out of energy, I&#39;m telling her to go but she&#39;s laughing, tearing their heads off as they swarm.</em></p>\r\n\r\n<p class=\"mb-0\"><em>I have recovered something from the memory... a blueprint.</em></p>\r\n</div>\r\n\r\n<p>This transmission tells the Tenno that, whomever fought the Sentients at the time, went against the Lotus&#39; warnings and continued combating the threat. It seems that, despite her disadvantageous situation, she put up a very valiant effort.</p>\r\n\r\n<p>With this, the Tenno will be awarded the Mirage Neuroptics Blueprint.</p>"}, {"id": 91, "quest": 13, "name": "Riddle One", "description": "<p>Upon starting the quest, Ordis finds out that there are hidden transcriptions in the item you have just crafted. He will begin to recite the transcribed riddle along with his opinion on it. The riddle can be viewed again in the inbox.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Operator,</em></p>\r\n\r\n<p><em>Unfortunately the nature of the Orokin Artifact you just crafted is a mystery to me. I simply cannot fathom its use. All I can tell you was that it was inscribed with the following nonsense:</em></p>\r\n\r\n<p><em>Three parts, three acts, three riddles for thee &ndash;</em></p>\r\n\r\n<p><em>to revive the one wielding fantasy</em></p>\r\n\r\n<p><em>Ancient gods so cruel, once ruled from on high</em></p>\r\n\r\n<p><em>Can you name their peak where the land meets the sky?</em></p>\r\n\r\n<p><em>Nothing in my database that sheds pght on its meaning. You&#39;d think the Orokin would have something better to do than scribble nursery rhymes on things. Oh well, I suppose not everything you craft can be of use.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Ordis, Ship&#39;s Cephalon</strong></p>\r\n</div>\r\n\r\n<p>The answer to this riddle is Mount Olympus, which is known better in-game as Olympus, Mars. In Greek mythology, Mount Olympus, the highest mountain in Greece, was considered as the only place where the land scrapes the sky &ndash; At the same time, Mount Olympus is known as the home of the twelve Olympian gods of the ancient Greek world. Olympus Mons, which is located on Mars in real life, is also the tallest mountain in the solar system.</p>"}, {"id": 90, "quest": 13, "name": "Hidden Messages", "description": "<p>In order to unlock this quest, the player must complete the Pluto/Sedna Junction. Upon completion, the player will be awarded with the Hidden Messages Quest.</p>\r\n\r\n<p>Go to the Quest section of the Codex, select the quest, then click &quot;Begin Quest&quot; to start.</p>"}, {"id": 89, "quest": 24, "name": "Starting the Quest", "description": "<p>The quest can be initiated from the Cetus vendor Nakak once the players have achieved the Observer (second rank) with The Quills, and has talked to her with the &quot;Mask?&quot; prompt. She will inform the player that she received a strange mask, called the &quot;Mask of the Lost One&quot;, from Onkko, and will sell it for 1 Cetus Wisp.</p>\r\n\r\n<p>The player must equip the Mask of the Lost One on their Operator and head into the Plains of Eidolon at night. They must then follow the marked white waypoint at the southwest side of Gara Toht Lake. Spotting a large spectral being that vanishes, the player must look around in Operator mode for a small blotch of energy with a hand reaching out from it. Nakak will then receive a vision from the Unum, explaining that the lake is where Gara had felled the Sentient, and a warden was placed to prevent the Sentient from resurfacing until the warden was lost.</p>\r\n\r\n<p>Nakak will ask the player to rebuild &quot;the lost one&quot;, mentioning that the Grineer have found relics and suggests talking to Konzu. The player must now initiate a Bounty until they find and build a part of the Revenant warframe. If the player already has one piece of the Revenant warframe, Nakak will tell the player to proceed.</p>\r\n\r\n<p>The player once again must return to the Plains of Eidolon at night. The white waypoint directs the player to the northeast side of Gara Toht Lake, where the specter appears and the player must interact with another small blotch of energy. Nakak sees another vision from the Unum, mentioning that the warden continued to strike down the Sentient until it briefly hesitated at one point.</p>\r\n\r\n<p>To proceed, the player must return to Bounties to find and build another part of the Revenant warframe.</p>\r\n\r\n<p>The final blotch of Sentient energy resides on a river between Gara Toht Lake and Renthi Spring, and again is only visible during the night. Nakak receives one final vision where the lost one extended a hand to the Eidolon, allowing it to emerge, dragging the warframe into its place. Just as Nakak finishes the tale, a Revenant Specter appears and begins attacking. Nakak tells the player to defeat the specter that serves as the mask for the Eidolon. Defeating the Revenant Specter will yield the blueprint for the Revenant Warframe.</p>\r\n\r\n<p>After building Revenant, Nakak warns the Tenno that she had a dream of a new Eidolon emerging and they will need this Warframe&#39;s power to combat the new threat.</p>"}, {"id": 88, "quest": 12, "name": "Aftermath", "description": "<p>After completing the quest, Teshin will send an inbox message, asking for forgiveness for his actions. The message also comes with four rewards for completing the quest:</p>\r\n\r\n<ul>\r\n\t<li>Broken Scepter</li>\r\n\t<li>Orvius Blueprint</li>\r\n\t<li>Riven Mod</li>\r\n\t<li>Grineer Queens Glyph</li>\r\n\t<li>Mountain Pass Captura</li>\r\n</ul>\r\n\r\n<p>Ordis will also send an inbox message containing a Personal Quarters Segment Blueprint, granting the player access to their Personal Quarters on their Orbiter.</p>\r\n\r\n<p>Completing the quest will also unlock the following:</p>\r\n\r\n<ul>\r\n\t<li>The Kuva Fortress location is added to the Star Chart</li>\r\n\t<li>The player can partake in Sortie missions</li>\r\n\t<li>The War Within Choice Scene, a Captura of the mountain summit</li>\r\n\t<li>The Operator&#39;s Transcendence ability is upgraded into Transference, allowing use of the Operator in combat</li>\r\n</ul>\r\n\r\n<p>If the player has also completed Saya&#39;s Vigil, they can gain access to The Quills&#39; wares, which is done by heading to the top-right side of Cetus while as the Operator. Doing so will provide a Mote Amp, and unlock all of the Focus trees.</p>\r\n\r\n<p>Similarly, having also completed the Vox Solaris quest will initiate the player into the Vox Solaris syndicate.</p>"}, {"id": 87, "quest": 12, "name": "Return to the Mountain Pass", "description": "<p>The Operator once again returns to the same mountain pass they visited during the dream sequence. While the route is identical to the previous Mountain Pass mission, this time there are obstacles to the player&#39;s path that has to be removed using the player&#39;s powers - Void Blast for destroying ice walls, and Void Beam for opening Orokin doors by shooting a barrel with glowing lines beside the doors.</p>\r\n\r\n<p>On reaching the large Ayatan Sculpture seen previously, players can activate it once again by shooting it with a Void Beam. Once activated, a series of platforms will float and be lit up as the player traverses them via Void Dash, until they reach a door at the top of the chamber. Beyond it, at the summit of the mountain, the Operator meets with Teshin again, who expresses the Kuva on the Scepter that was taken from the Queen is believed to be the blood of the Orokin ancestors, either an elixir of immortality or a maddening oil. Teshin tells the Operator that the Kuva may just be a symbol to the Operator, that what they do with it will define them more than anything. The final dialogue choice for players will appear:</p>\r\n\r\n<ul>\r\n\t<li>[Sun] Destroy\r\n\t<ul>\r\n\t\t<li>The Operator crushes the Kuva, before an unknown voice speaks from the Operator: &quot;You mad at me, kiddo? Did you forget? You owe me.&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Neutral] Control\r\n\t<ul>\r\n\t\t<li>The Operator gives the Kuva to Teshin, before an unknown voice speaks from the Operator: &quot;Don&#39;t forget, kiddo... you&#39;re nothing without me.&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Moon] Consume\r\n\t<ul>\r\n\t\t<li>The Operator drinks the Kuva, before an unknown voice speaks from the Operator: &quot;Hey, kiddo, what took you so long?&quot;</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Teshin shakes the Operator out of their trance, and asks them to be careful, as the world &quot;weighs more heavily&quot; on them now.</p>"}, {"id": 86, "quest": 12, "name": "Confronting the Grineer Queens", "description": "<p>The entire sequence in the mountain pass is revealed to be a mental scenario taking place in the seconds before the Queen&#39;s Transference Surge completes, but this time the Operator breaks free from control. Waking up in the Orbiter once more, the Operator finds that they have retained the new powers they have unlocked, and are able to use their Void Beam once again. Intending to reclaim their Warframe and save Teshin from the Queens, and with Ordis telling them that the Fortress has moved once again, the Operator performs a Transference with player input to teleport themselves to their Warframe.</p>\r\n\r\n<p>With the Warframe and Operator now together within the Queens&#39; chamber, the Worm Queen flees while the Elder Queen orders their Kuva Guardians to attack the Tenno. The Kuva Guardians are immune to Warframe attacks, and Warframe powers are nullified inside the chamber, along with the player being unable to use their Primary and Secondary weapons, or any Gear. In order to fight the Guardians, the Tenno must utilize their Operator&#39;s void powers to destroy them by stepping out of their Warframe using their Transference ability. Each Kuva Guardian can be killed via the following steps:</p>\r\n\r\n<ol>\r\n\t<li>The player has to use Void Dash through or Void Blast the Kuva Guardian to disarm them.</li>\r\n\t<li>Once the Kuva Guardian switches to their Twin Rogga pistols, players can now deal damage to them using Void Beam or Warframe.</li>\r\n</ol>\r\n\r\n<p>The Operator can take damage, but cannot be killed; if the Operator&#39;s health is depleted, they are immediately returned to the Warframe, and can be re-summoned afterwards. Each Operator&#39;s death depletes Warframe&#39;s total health though, so it&#39;s still possible to fail this way.</p>\r\n\r\n<p>On killing the first Kuva Guardian, Teshin will point out the weakness to the Queen&#39;s systems: the nine large, red braids hanging around their throne. Killing each set of Kuva Guardians will make the braids vulnerable to attack, indicated by their glyphs glowing red, and thus allowing them to be destroyed with the Operator&#39;s Void Beam. Three braids can be destroyed before another pair of Kuva Guardians jump into the fray, repeating the process until all braids are destroyed.</p>\r\n\r\n<p>After destroying all the braids, the Elder Queen will order Teshin to attack the Tenno. Unlike the Kuva Guardians, Teshin is capable of restraining the Operator via his Orvius glaive weapon, rendering the Operator helpless. However, Teshin is vulnerable to the Warframe&#39;s melee attacks.</p>\r\n\r\n<p>Once the player has defeated Teshin, the Queen will try to attack the Tenno with a beam from her Scepter. For this part, players only have to wait for the Queen to drop her shield to fire the beam, and then use Void Dash against the Queen. With the Queen&#39;s Kuva Scepter in hand, Teshin is freed from the Queen&#39;s influence and requests that he kill her, prompting another dialogue choice to the player, which will affect the cutscene that follows:</p>\r\n\r\n<ul>\r\n\t<li>[Sun] Let her rot\r\n\t<ul>\r\n\t\t<li>The Operator commands Teshin to stay put, allowing the Elder Queen to escape.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Neutral] I will do it\r\n\t<ul>\r\n\t\t<li>The Operator commands Teshin to stay put and fires a Void Beam at the Elder Queen, instantly killing her.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Moon] Kill her\r\n\t<ul>\r\n\t\t<li>The Operator commands Teshin to strike, who proceeds to lunge at the Elder Queen and kill her with a single strike of his nikana.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Regardless of which choice the player makes, Teshin leaves and the Operator regains contact with the Lotus, and are then ordered to extraction.</p>\r\n\r\n<p>Upon their return to the ship, Ordis asks the player if they can still use Transference, prompting the player to perform Transference to switch to their Operator. A short argument erupts between the Lotus and the Operator over Margulis&#39; actions with the Tenno, before Ordis interrupts with reports of an active Old War beacon.</p>"}, {"id": 85, "quest": 12, "name": "The Ravenous Golden Maw", "description": "<p>&nbsp;mountain exit.After waking up from their fall, the Operator remembers bits of their past on the Zariman when an accident first broke out on the ship and were lied to by their original mother about being safe with her, as narrated by the Queens. The Operator comes across a chamber with the floor covered in bones and skeletons, with a creature - a Golden Maw - visibly moving underground that Teshin warns the Operator of.</p>\r\n\r\n<p>The objective of this particular section is to cross the chamber safely to the other side without being devoured by the Golden Maw, who will erupt from the ground and consume the Operator if the player stays too long within the floor of bones. In order to cross the chamber, players must sprint and jump to safe areas, visible as large, solid rocks, before the creature can reach them. The Golden Maw itself will move around the bone floor in particular patterns, and thus players must time their runs to when the creature is furthest from their position. Alternatively, there are side paths in the chamber that allow for safe passage to the rocks.</p>\r\n\r\n<p>After crossing the chamber, the Operator gains the ability to perform Void Blast, a powerful conic blast that can be fired by the Operator to the front, and which they can use to destroy the barrier blocking their way further down the cave. After another memory narrated by the Queens regarding the Operator&#39;s original father informing them that something out in space is watching the crew, the Operator will unlock another ability called Void Dash, a short-range teleport allowing them to cross large distances quickly, and which the player can use to cross the gap by that part of the corridor going forward. Both abilities use up energy, visible as a symbol on the player&#39;s crosshair; the brightness of the symbol determines the energy level, with the crosshair become dimmer the more energy is used until it is depleted, and brightening as the energy recharges.</p>\r\n\r\n<p>Players will come across yet another bone chamber, this time with two Golden Maws, thus necessitating the use of their newly acquired powers to cross the chamber. After another narrated memory of how the Operator feeling safe with the children on the Zariman, the Operator will unlock Void Mode, a short-term invisibility/invincibility power that remains active as long as the appropriate key is held. As with the other Void powers, Void Mode consumes energy while active.</p>\r\n\r\n<p>Another bone chamber will present itself to the player soon after, which will require players to use Void Mode in conjunction with their other powers to cross.</p>\r\n\r\n<p>At the end of the path another memory is narrated by the Queens, explaining the adults on the Zariman have gone mad by the Void&#39;s influence. Players are now given a choice between three replies in how to respond:</p>\r\n\r\n<ul>\r\n\t<li>[Sun] I held out hope\r\n\t<ul>\r\n\t\t<li>I held out hope we&#39;d be rescued. So I avoided the bloodshed.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Neutral] They had lost their minds\r\n\t<ul>\r\n\t\t<li>They had lost their minds. I didn&#39;t blame them. We built a makeshift prison.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>[Moon] They were nothing but animals\r\n\t<ul>\r\n\t\t<li>They were nothing but animals by then. So I hunted.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>The Operator will then unlock the ability to perform Transference, allowing them to physically possess and take control of an eligible target, as Teshin explains that they have now unlocked their full power. In the next and final bone chamber, players are tasked with using Transference against a Golden Maw, which can be done by stunning the Maw with Void Blast, and then using Transference while targeted. Once players have control of the Maw, they can use the Maw&#39;s ability to burrow and attack to cross the chamber to the mountain exit.</p>\r\n\r\n<p>Outside, Teshin reveals that he is a Dax, a soldier who fights for the Orokin, but can never defy his masters and the Kuva Scepter, forcing him to obey the Queens. Players must navigate their way through the mountain side before coming across a Yuvan Theater, a place where Orokin used to gather to barter over the &quot;young and exotic&quot;, to be used in the process of Continuity. Teshin then reveals that Continuity is what the Queen intends to perform on the Operator, as well as the nature of the process: to take over the Operator&#39;s mind and body, claiming it as her own.</p>\r\n\r\n<p>The Queens narrate the final memory of how the Void coiled itself around children of the Zariman, prompting another dialogue choice:</p>\r\n\r\n<ul>\r\n\t<li>[Sun] I hated it</li>\r\n\t<li>[Neutral] I controlled it</li>\r\n\t<li>[Moon] I embraced it</li>\r\n</ul>\r\n\r\n<p>In defiance, the Operator successfully fires their Void Beam at the vision of the Queens.</p>"}, {"id": 84, "quest": 12, "name": "The Mountain Pass", "description": "<p>Managing to escape to the front of their landing craft, the Operator now find themselves stranded on top of a snowy mountain on Earth. Players must navigate the snow-covered path and avoid getting blown off by the wind as they make their way to a cave at the end of the path.</p>\r\n\r\n<p>Within the cave, the Operator finds a corpse by a fireplace, where they are then confronted by Teshin once more. After a brief altercation where the Operator fails to land a punch on Teshin, the latter locks the Operator inside the cave by closing an old automated door. As Teshin&#39;s voice explains the nature of Margulis&#39; &quot;lie&quot; as to what she did to the Tenno, the Operator comes across a massive Ayatan Sculpture encased in icy stalactites. Players must use their Void Beam to destroy the ice, before shooting the front of the Sculpture with the beam, setting off a reaction that sees the Operator fall to the abyss below.</p>"}, {"id": 83, "quest": 12, "name": "The Purge Precept", "description": "<p>The Operator wakes up outside of their Transference chamber to the laments of distraught Ordis. Once the Operator calms the Cephalon down, they ask Ordis to reestablish Transference with their Warframe. To this Ordis replies that he is unable to do so, asking the Operator to reestablish the Somatic Link with their Void energies. At this point, players must use their Void powers on the Somatic Link receptacle on top of the Transference chamber by firing a Void Beam at it, activated via the fire key.</p>\r\n\r\n<p>However, the Operator experiences a backlash that prevents prolonged periods of firing. Believing that the Operator can no longer control Warframes, Ordis suddenly initiates his Purge Precept, decompressing the ship while turning the Sentinel&#39;s default guns (even if it is not equipped with one) against the Operator. Barely containing his care for the Operator, Ordis urges them to head to the navigation console so that he may detach the landing craft. The player must now escape to the front of the Orbiter, avoiding both the Sentinel&#39;s attacks and steam vents that periodically stagger and block the player from progressing.</p>"}, {"id": 82, "quest": 12, "name": "Infiltrate the Grineer Asteroid Fortress", "description": "<p>Proceeding inside the Fortress, the Operator tries to contact the Lotus, only to discover that they no longer have contact with her, and thus must proceed without her guidance. The Fortress features various scanners that will trigger defenses when a Tenno is detected; player can choose to either avoid the scanners by stealth, or simply run through the level as fast as possible.</p>\r\n\r\n<p>Deeper into the Fortress, player will come upon a large cavernous room with an large elevator whose access is locked. In order to activate the elevator, the player must find three Elevator Keys mounted on consoles throughout the cavern, and then carry them to the main console in the center of the room. Only when all three Elevator Keys are inserted will the main elevator open, granting access to the bottom levels.</p>\r\n\r\n<p>Deep inside the Fortress, the Tenno finally finds the Queens&#39; throne room, the very same one from their vision, where they are then confronted by Teshin, telling them that they have ruined them both, as Kuva Guardians and the Twin Queens themselves descend into the room. The Queens reveal Teshin&#39;s true name as Teshin Dax, a Dax soldier from the old Orokin Era, who is unable to disobey the Queen&#39;s orders. Disappointed at how Teshin brought the Warframe instead of the Operator themselves, the Queens nonetheless manage to restrain the Tenno with Teshin&#39;s help, and proceeds to disrupt Operator&#39;s connection to it. Back in the Orbiter, Ordis identifies this as a Transference Surge and urges Operator to cut the link, which Operator claims they cannot do. Unable to shut down the Link from the Orbiter and prevent the Surge, the Operator is rendered unconscious.</p>"}, {"id": 81, "quest": 12, "name": "Pursue Teshin into the Asteroid Field", "description": "<p>The Lotus tracks down Teshin&#39;s next location to a supposedly uninhabited asteroid field that deep scans reveal to have a &#39;security matrix&#39;, making the Lotus believe that someone is hiding something. The Lotus then asks the Tenno to prepare their Archwing for the mission.</p>\r\n\r\n<p>Deployed near an unusual asteroid structure, the Lotus briefs that the Tenno must disable the security matrix surrounding it before they can head inside to investigate. The Lotus asks Ordis as to whether their angle of approach is the best, to which Ordis points out the various traps and dangers outside of the shipping corridor the Tenno are in, and are thus advised to stick to this route.</p>\r\n\r\n<p>Inside the asteroid base, Ordis points to the presence of a Grineer transport ship passing through several laser scanners on their route. In this section, players must avoid the red laser scanners within the corridor by keeping the moving transport between themselves and the red laser scanners as they pass. There are two sets of lasers that players must clear safely before they reach the end of the corridor, terminating into a transport hangar, where the player will encounter Kuva Grineer for the first time.</p>\r\n\r\n<p>Upon reaching the hangar players are automatically detached from their Archwings to transition into standard ground combat, where they are then tasked with disabling the security matrix by activating a console. When the console is activated, players must then defend the console from Grineer attack for 2 minutes until the shutdown is complete - players will fail the mission if the console is destroyed. Once the security is overridden, players must then kill all remaining Grineer within the hangar to continue with the mission.</p>\r\n\r\n<p>Transitioning into Archwing once more, the Operator expresses their surprise at the asteroid base that lies beyond the hangar, with the Lotus presuming it to be the Queen&#39;s Fortress. The Operator notes the Fomorian engines attached to the fortress, and realizes that the base is mobile, explaining why they&#39;ve never been able to find it. The Lotus asks the Tenno to return to their ship and wait for Teshin to contact them, but the Tenno sees this as an opportunity to discover what&#39;s inside, fearing that they&#39;ll lose their chance if the fortress moves again.</p>\r\n\r\n<p><strong>At this point, players are asked via a prompt whether they want to continue into the Fortress or not, warning them that mission access will be restricted once they proceed, meaning that players will be unable to abort the mission or change equipment from that point onward. Quest will be in Solo mode from that point as well.</strong></p>"}, {"id": 80, "quest": 12, "name": "Track Teshin", "description": "<p>Heading to a Corpus Gas City on Jupiter where the Lotus has tracked Teshin&#39;s signal, the Lotus theorizes on the tactical advantage they can gain against the Grineer if they can locate the Twin Queens. The Operator then wonders why Teshin doesn&#39;t want the Tenno&#39;s help if he&#39;s tracking down the Queens, making the Lotus muse about Teshin&#39;s prideful personality.</p>\r\n\r\n<p>Once the Tenno catches up to Teshin&#39;s location, it is revealed that they are tracking yet another of Teshin&#39;s Specters, and the Lotus asks the Tenno to capture it so they can use it to track Teshin. As with the previous mission, players must disable and then Capture the Teshin Specter before it can escape. Players can then extract once they have accomplished the mission.</p>"}, {"id": 79, "quest": 12, "name": "Investigate the Reservoir on Lua", "description": "<p>Landing on Lua, the Lotus narrates how they are now in the place where Margulis tried to help the Tenno to tame the Void within them, saying how in that way all Tenno were born here. As the Operator tries to clarify whether they were truly born there, the Lotus relates that they were the only things saved from the Zariman as the Orokin tried to rectify their mistake. Detecting an unusual signature within the vicinity, the Lotus asks the Tenno to investigate.</p>\r\n\r\n<p>Deeper in the facility, the Tenno will encounter a shadowy being that can seemingly teleport, with the Operator reporting that they think the intruder is Teshin. Confused as to Teshin&#39;s presence, the Lotus asks the Tenno to track him down, seeing as how he is heading towards the reservoir.</p>\r\n\r\n<p>Through a transmission, Teshin asks the Tenno, whom he refers to as a &quot;child&quot;, to leave as the matter at hand doesn&#39;t concern them. Annoyed at Teshin&#39;s behavior, the Operator asks what he is doing. When the Tenno finally catches up to Teshin, they see him next to a Reservoir examining a broken pod, when a female voice asks Teshin to bring &quot;them&quot; to her. Asking as to the identity of the female voice, Teshin reveals it to be &quot;the Queens&quot;, which the Operator immediately recognizes as the Grineer&#39;s Twin Queens. In a blink, Teshin draws his nikana and puts it to the Warframe&#39;s neck, warning them that they are not as safe behind the Warframes as they think, and that Teshin will fight them if they attempt to follow him. He then casts a decoy Specter of himself as he escapes, while the place begins to fill with Corrupted.</p>\r\n\r\n<p>The Operator asks the Lotus to track Teshin, who replies that Teshin&#39;s Specters are masking his signature. The Lotus, having once thought the Grineer Queens as just a myth propagated by Grineer Command, asks the Operator if Teshin should do this alone. With the Operator still annoyed at Teshin&#39;s condescending behavior towards them, the Operator states that they will not be told what to do by Teshin, and asks the Lotus to track Teshin down once they&#39;ve dealt with the Specter.</p>\r\n\r\n<p>Players at this point must pursue one of Teshin&#39;s Specters, which appear as a violet energy decoy of him, and then take him down. Unlike most Capture targets, Teshin&#39;s Specter will fight back if threatened, engaging the player in melee combat. Once Teshin&#39;s Specter has been successfully taken down, players must then capture it via a Capture Target prompt. After the player accomplishes this, the Lotus will ask the Tenno to extract, having locked on to Teshin&#39;s route.</p>"}, {"id": 78, "quest": 12, "name": "Starting the Quest", "description": "<p>The player must have a Mastery Rank of at least 5, complete The Second Dream quest and have completed the Sedna Junction at Pluto in order to start this quest.</p>\r\n\r\n<p>If the player has accomplished all the necessary prerequisites, a message from the Lotus will arrive in the player&#39;s inbox with the following content:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Something has happened on Lua and my Sentries have become unresponsive. I need you to investigate immediately.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>The Lotus</strong></p>\r\n</div>\r\n\r\n<p>The quest can then be activated in the Codex under the Quests section. A short cinematic will then play, a vision showing the Twin Queens of the Grineer discussing &quot;Continuity&quot;. Back on the Orbiter, the Lotus worryingly asks about the Operator&#39;s state due to high Somatic output. After the Operator reassures the Lotus of their condition, they are asked to deploy a Warframe to Lua to investigate.</p>"}, {"id": 77, "quest": 11, "name": "Aftermath", "description": "<p>The Lotus then appears, personally carrying the Operator into the Somatic Link. A customization screen will then appear, revealing the Operator&#39;s true face, which players can edit to their desire.</p>\r\n\r\n<p>After the player&#39;s customization is complete, the Lotus reveals the Operator is the Tenno themselves, their true form. The Lotus begins asking questions to see how much the Tenno remembers, and helps him or her recover some of their memories. She explains how one of the Orokin, Margulis, helped save them from their uncontrollable powers by creating a dream-state for them to live in. The Lotus further explains that Margulis was killed by the Orokin Executors and her ideas were used by them to create &quot;Transference&quot;, which allows the Tenno to control their powers through a remote &quot;surrogate&quot;, the Warframe.</p>\r\n\r\n<p>The Lotus continues to explain some of the Tenno&#39;s history and the great schools they founded, all based on different principles of combat. The player is then given a choice between one of the 5 schools &ndash; Madurai, Vazarin, Naramon, Unairu, and Zenurik, and afterwards Lotus tells the Tenno that this will be their primary Focus, rewarding the player with a Focus Lens of the chosen school.</p>\r\n\r\n<p>This completes the quest and Ordis will send the player an inbox message expressing his relief that the Operator is alive and well, as well as delivering the remaining piece of the War greatsword that was broken off from the weapon, as well as a Scar sigil. Meanwhile, the Shadow Stalker, still hellbent on executing the Tenno for their crimes, will continue to hunt the player down in his upgraded Sentient form.</p>"}, {"id": 76, "quest": 11, "name": "Save the Reservoir", "description": "<p><em>This mission cannot be performed with a group, and must be done solo.</em></p>\r\n\r\n<p>The Lotus informs the Tenno that they will have to act fast, as the Moon is now exposed and the Stalker is already en route to destroy the Reservoir. Once again, the Tenno arrives on the Moon. As the Tenno proceeds through the level, more disembodied voices similar to the previous mission will be heard, revealing more of Margulis and her work, along with the Orokin&#39;s reactions to it.</p>\r\n\r\n<p>At the end of the level is the Reservoir, a place with water falling into a small pond below. A cinematic then plays, where the tenno is walking towards the Reservoir as it observes a golden flower-shaped pod emerging from the waters. The pod opens up, revealing a person wearing a black bodysuit, which the pod then carries out on a chair. The person is dumped in front of the Tenno, resulting in the screen flickering and breaking up, with the Warframe suddenly falling limp, before the view blacks out. The disembodied voice of Margulis was heard:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Dream... not of what you are, but of what you want to be.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Margulis</strong></p>\r\n</div>\r\n\r\n<p>At this message, the person in the bodysuit crawls over to the Warframe, and then touches it. The act reactivates the Warframe, and makes it carry the person in its arms. The Stalker appears afterwards seemingly ready to kill them, but hesitates, earning the ire of Hunhow who proclaims that Stalker&#39;s hate is weak, before sending the Stalker away to allow Sentient fighters to finish the job. The Lotus then orders the Tenno back to their ship, referring to them as the Operator.</p>\r\n\r\n<p>At this point, the player must now carry the person to the extraction point while being followed by Sentient battle drones. The Warframe&#39;s mobility is greatly reduced while carrying them, walking much slower and being unable to use any parkour moves, including sprinting or jumping. Although they have no access to their weapons or offensive Warframe abilities, the Warframes can still use defensive abilities like Iron Skin, and the person can fire an energy beam powerful enough to destroy the Sentients to hold off any enemies while the Tenno moves to extraction. During this stage it is impossible to actually die, as the player&#39;s health can never drop below 1. Defeating the Sentient drones is not necessary to extract, but it is recommended because the requirement for the Sedna Junction requires the killing of 5 Sentient enemies, who are very hard to kill outside of this mission.</p>\r\n\r\n<p>Back aboard the player&#39;s ship, the Warframe still carries the person in its arms, and the Lotus tells them to head deep inside the Orbiter section to find the Somatic Link, located inside a room at the very bottom rear of the Orbiter. Unbeknownst to them, the Stalker has infiltrated the spacecraft and is ordered by Hunhow to kill the Tenno before they reach the Somatic Link, which is the device at the very rear of the room. The Stalker will then proceed to attack the Tenno, firing red energy waves that can push back the players a significant distance away. The player must dodge the Stalker&#39;s attacks and/or block them with their energy beam attack to reach the Link. Once the player reaches the Link, they must use the energy beam to feed energy into the Link via a blue energy sphere at the top of the Link. When the Link has received enough energy, an energy blast from the Somatic Link will push the Tenno back, forcing the Tenno to repeat the process of going past the Stalker and refilling the Somatic Link. This must be done three times.</p>\r\n\r\n<p>Once the Somatic Link has been filled three times, the person and the Warframe are both blown back from the energy dispersion, separating them. The Stalker stands before the Warframe, lifeless again after being separated from the Operator&#39;s touch. The person cowers in fear, as Hunhow monologues how the Warframe (up to this point thought to be the Tenno) is a &quot;metal puppet&quot; to the real Tenno, who is actually the helpless person from the Reservoir. After stabbing the Warframe with his greatsword War, the Stalker approaches the Tenno and proceeds to choke them. Inexplicably, the Warframe revitalizes and breaks War in half, dispelling Hunhow&#39;s control, causing the Stalker to be overcome with immense pain. The Stalker flees, releasing a blinding flash that knocks the real Tenno unconscious.</p>"}, {"id": 75, "quest": 11, "name": "Protect the Moon", "description": "<p>Ordis mentions that he recalls having been to the Moon once, and that he is concerned for the Tenno. The Lotus explains that the Reservoir is the source of the Tenno&#39;s power, and that its secret drove the Stalker mad. The Lotus asks the Tenno for forgiveness, telling them that they must now protect the Moon by keeping it within the Void.</p>\r\n\r\n<p>Arriving on the Moon, the Tenno are tasked with stopping Stalker from reaching the Moon&#39;s Void Control Room, whose aim is to initiate a void collapse that will destroy the Moon, which will destroy the Reservoir and in turn the Tenno along with it. Before players can reach the Void Control Room however, the Stalker initiates the collapse, which causes shadow versions of hostile Infested to appear throughout the complex. The Lotus decides to pull the Moon out of the Void and back into normal space to prevent its destruction, tasking the Tenno to reorient the Moon by reactivating the Void Control Room&#39;s void compasses.</p>\r\n\r\n<p>Upon reaching the Void Control Room, players must first hack a console at the center of the room, and then reactivate three void compasses located in three towers in the room by getting close enough to the devices to drain the Warframe&#39;s shields. The void compasses can only be reactivated one at a time, and only after one of them has been activated can the next one be worked on. Hacking the central console will make the Shadow Stalker appear, the improved version of Stalker with new weapons and abilities. Just like a normal assassination by Stalker, if the Tenno is able to lower the Stalker&#39;s health far enough, he&#39;ll disappear, though this will be much harder than before due to Shadow Stalker featuring similar resilience as the Sentients. When the compasses are reactivated, Hunhow threatens Alad V for being Orokin, causing Alad V to bid farewell to the Tenno as he has apparently been found by Hunhow, while reminding Lotus of their deal.</p>\r\n\r\n<p>With all compasses reactivated, Lotus tells the Tenno to get to the Pendula, which are devices that maintain the Moon&#39;s stability in the Void, and deactivate them. There are four such Pendula located in four pillars in the center of the room they are located in, protected by a floating and teleporting Security Eye that will shoot waves of slow-moving destructive energy at players. As both the Pendula and the Security Eye are immune to any form of attacks, in order to destroy the Pendula the Tenno must trick the Security Eye into attacking the pillars by making the Security Eye shoot into the Pendula&#39;s direction. Care must be taken after the first Pendula is destroyed, as the Security Eye will begin to perform wide scale area-of-effect attacks after its standard beam attack. Note that these AoE attacks cannot destroy the Pendula and become more frequent with every Pendula destroyed.</p>\r\n\r\n<p>After all the Pendula are destroyed, the Lotus orders the Tenno to get to extraction as soon as possible. Along the way, disembodied voices belonging to a man named Ballas and a woman named Margulis conversing to each other can be heard, arguing about the fate of &quot;devils&quot;.</p>\r\n\r\n<p>With the Moon now back in the orbit of Earth, a lone Conculyst can be encountered before the Tenno reaches extraction, though it is not necessary to fight it to complete the mission.</p>"}, {"id": 74, "quest": 11, "name": "Follow the Stalker", "description": "<p>Back on the player&#39;s landing craft, Alad V asks the Lotus what &quot;the Reservoir&quot; is and whether it&#39;s a Tenno weakness. Lotus only tells him that he has already earned his favor from them, only for Alad V to counter that the Tenno are his investment, thus he wishes to see this through.</p>\r\n\r\n<p>The next mission takes the Tenno to a Corpus Outpost on Neso, Neptune. The fragment apparently lead Hunhow to a path leading to the Reservoir which passes through said outpost, and that in order to reach it Hunhow needs the Stalker.</p>\r\n\r\n<p>Reaching the objective marker reveals an Orokin portal room, what Alad V calls a &quot;Void Gate&quot;. On entering the room, the Stalker vanishes as the void portal collapses. A Sentient Conculyst or Battalyst will suddenly appear, a powerful enemy unit which the Tenno must defeat. Doing so will reveal the location of a Void Key the Stalker used in the portal room to Lotus&#39; surprise. The Void Key must be inserted into the Torsion Beam Device at the center of the portal room to reopen the void portal, at which point the Lotus urges the Tenno to enter, stating that the Sentients will be unable to follow the Tenno there due to the Void being poison to them.</p>\r\n\r\n<p>Upon arriving at the other side of the portal, Alad V tells the Tenno to find a nav console to figure out where they are. The nav console is located in a room with a window looking out at a sight that shocks Alad V: The Moon. Alad V explains that the Moon was thought to have been destroyed, expressing wonder at it being in the Void all this time and at the Lotus&#39; ability to have put it there. The Lotus tells the Tenno that the Reservoir is the source of their power, and must be protected. Once the nav console is activated, the Lotus detects the Stalker leaving on a ship headed to the moon and urges the Tenno to find a way to follow him.</p>\r\n\r\n<p>Alad V realizes that the Orokin Tower the Tenno are currently in is used to hide the Moon&#39;s location in the Void, thus suggesting that the tower should be disabled to allow Ordis to pick them up. To disable the tower, the Tenno must find a marked console hidden inside a retractable cover within a generator room and hack it, which will allow 4 more retractable panels in the generator room itself to become visible. These 4 panels will reveal a blue vial each that must be destroyed, but are protected by electric arcs. One panel will be unprotected at all time, so the Tenno has to look for the next unprotected panel after destroying each vial.</p>\r\n\r\n<p>Once all 4 panels have been revealed and their vials destroyed, Ordis will contact the player to tell them to prepare for pickup.</p>"}, {"id": 73, "quest": 11, "name": "Find the Sentient Fragment", "description": "<p>An Archwing is required to undertake this mission.</p>\r\n\r\n<p>The Lotus, fearing that Hunhow can listen in on her, tells the Tenno that the message she received was an offer for help. However Lotus does not reveal who said person is, only that she doesn&#39;t trust them. She then sends the Tenno to Cressida, Uranus to find a fragment of a Sentient.</p>\r\n\r\n<p>Once the Tenno arrives at the mission site, the mysterious helper is revealed to be none other than Alad V, who claims knowledge of what they are looking for. Despite their antagonistic past, he asks the Tenno to trust him due to the greater threat of the Sentients.</p>\r\n\r\n<p>Upon diving underwater and reaching the site of an Orokin shipwreck, Alad V, unwilling to completely guide the Tenno in finding the fragment, urges them to search the excavation site for it themselves, providing hints only if the players are near the objective. (If the player takes approx 5 minutes, Alad V will say &quot;I give up! Here it is! Can&#39;t you find anything not marked on your map??&quot; accompanied by placing a way-point to the objective) The actual objective at this point is to find a tunnel closed off by rocks, which can be destroyed to reveal a passageway leading out of the excavation site and into a large underwater cavern with a Sentient wreck. The fragment is found upon exiting the waters above the cavern, a Sentient relic that the Lotus says she could use to view the memories of her father.</p>\r\n\r\n<p>Once the Tenno interacts with the relic, Lotus sees a vision of the Stalker who is apparently confused, before realizing that she has been caught in a trap: interacting with the relic has allowed Hunhow to ascertain the location of the Reservoir, with the Stalker now en route to it. Alad V then tells the Tenno to hurry back to extraction. The mission ends once the player reaches extraction.</p>"}, {"id": 72, "quest": 11, "name": "Infiltrate the Grineer Archives", "description": "<p><em>An Archwing is required to undertake this mission.</em></p>\r\n\r\n<p>The Lotus contacts the Tenno to warn them about the threat of the Sentient Hunhow, who has been infiltrating her mind. She also warns them about Hunhow using the Stalker to hunt down the Reservoir, the Tenno&#39;s weakness that the Lotus has kept hidden.</p>\r\n\r\n<p>The Tenno are sent to Uranus on a Spy mission to infiltrate data from the Grineer on their knowledge of Hunhow, who they released after excavating him. All three data vaults must be successfully hacked in order to complete the mission, otherwise the mission will fail.</p>\r\n\r\n<p>The first Data Vault hacked reveals that the Grineer had been excavating pieces of Hunhow, and that Hunhow is capable of controlling each part of him with his mind, making Lotus wonder if said mechanism is how the Sentient has been invading her mind. Infiltrating the second vault reveals it to have already been accessed and corrupted, thus Lotus entreats the Tenno to find another vault to acquire more data. Hunhow contacts Lotus at this point, telling her of his intent to restore the Lotus. While Lotus defiantly claims that he&#39;ll never find the Tenno, Hunhow tells her that he already knows due to his infiltration of her mind.</p>\r\n\r\n<p>The final vault gives Lotus the final piece of data she needs, revealing it to be a personal message to her. Lotus excuses herself, telling the Tenno that she needs to contact the person who sent the message, before telling them to head to extraction.</p>"}, {"id": 71, "quest": 11, "name": "Cinematic", "description": "<p>A cinematic for the quest can be found on The Second Dream&#39;s Codex Entry before undertaking any missions.</p>\r\n\r\n<p>The cinematic begins with the Stalker walking up to a platform, surrounded by floating Sentient fighters on all sides. As he walks up to the center of the platform, a disembodied voice speaks to him about the Stalker&#39;s vengeance and the Tenno&#39;s seeming immortality. As the Stalker drops the severed head of a Loki unto the platform, the voice reveals that the Tenno &quot;essence&quot; has been hidden from them by the Lotus, and tells him that he knows that it is found in a &quot;womb in the sky&quot;. Using its powers, the voice gives Stalker new armor and a large greatsword with which to accomplish its mission. The Stalker asks for the voice&#39;s identity, to which it replies as Hunhow, Sentient destroyer of worlds.</p>"}, {"id": 70, "quest": 11, "name": "Starting the Quest", "description": "<p>The Second Dream is automatically made available upon completing the Neptune Junction. The Quest can be activated in the Quests section of the Codex.</p>"}, {"id": 69, "quest": 10, "name": "Seal the Tomb", "description": "<p>The Tenno are deployed to yet another Sealab facility for a Defense mission on Desdemona, Uranus, where they are tasked with protecting a bomb that will destroy the tomb once and for all. For this mission, players must defend one of four objectives located at different parts of the map, with the vulnerable objective switching between each wave.</p>\r\n\r\n<p>During the mission, the Sentient speaks to the Lotus, whom he refers to as his daughter, accusing her of betrayal. Through the conversation, it is revealed that Lotus herself was a Sentient, who had infiltrated the ranks of the Orokin to become the Tenno&#39;s handler.</p>\r\n\r\n<p>Once the player accomplishes the mission, the Lotus further clarifies the nature of her betrayal: she was supposed to destroy the Tenno, but did not. She explains that Sentients become incapable of breeding upon arrival at the Origin system, with Teshin realizing that the Lotus desired children of her own, to which the Lotus affirms that she has become the Tenno&#39;s &#39;mother&#39;.</p>\r\n\r\n<p>In the aftermath, Regor, angered at his setback, challenges the Tenno to fight him, telling them that they know where to find him.</p>"}, {"id": 68, "quest": 10, "name": "Stop Tyl Regor", "description": "<p>The Lotus sends the players to a Survival mission on Ariel, Uranus, to which they have to fight against Grineer units for 10 minutes.</p>\r\n\r\n<p>As the mission progresses, Tyl Regor manages to open up the artifact he is excavating despite warnings from Teshin - whom Regor identifies as a &quot;pseudo-Tenno&quot; - and the Lotus. After unearthing an Exilus Adapter from the ruins, Regor also manages to release a Sentient, who begins to refer to the Lotus as &quot;Natah&quot;.</p>\r\n\r\n<p>Back on the player&#39;s ship, the Lotus explains that &quot;Natah&quot; was her old name. Concerned about the appearance of the Sentient, the Lotus ordered for it to be contained by destroying the tomb it resides in.</p>"}, {"id": 67, "quest": 10, "name": "Find the Sergeant", "description": "<p>The intercepted transmission points to the presence of a Grineer Sergeant named Sergeant Scur, a Drahk Master armed with a Grakata, located in a Grineer Sealab on Sycorax, Uranus, where players are tasked with his capture.</p>\r\n\r\n<p>The Lotus once again appears, quickly realizing that Teshin is leading the Tenno into more danger and immediately orders him to halt his intention, to which he argues at how she is afraid of what they&#39;ll find. She answers.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>The SENTIENT.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Lotus</strong></p>\r\n</div>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>You know this one, don&#39;t you?</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Teshin</strong></p>\r\n</div>\r\n\r\n<p>After successfully obtaining the information of the mysterious tomb, the Lotus immediately orders the Tenno to stop Tyl Regor from entering the tomb.</p>"}, {"id": 66, "quest": 10, "name": "Help Teshin", "description": "<p>With the Lotus seemingly abandoning the Tenno, Teshin offers his help in unraveling the Lotus&#39; secret. Teshin sends the players to a Grineer Galleon in Cassini, Saturn, in order to obtain more information about the mysterious appearance of the drone, which Teshin describes as &quot;a menace long thought dead&quot;. He persuades the Tenno to hack into three Grineer Consoles in a Mobile Defense fashion, of which he also repeatedly iterates that he will not hide the spoils of their labor.</p>\r\n\r\n<p>Upon finishing the mission, Teshin is able to successfully intercept a message by Tyl Regor, which he sends to the player&#39;s inbox:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>INTERCEPTED MESSAGE: Tyl Regor Sgt. Scur-</em></p>\r\n\r\n<p><em>You want to know why they are here? Cause I found it! The tomb! They should all be dead... trapped inside - but these ones are not, why?</em></p>\r\n\r\n<p><em>Be brave, Scur, for your brothers, sick and twisted in the tubes! New ideas are within our reach that could cure us all. Send the Draga to reinforce the location we discussed.</em></p>\r\n\r\n<p><em>Scur, if you saw too many words I&#39;m sorry, I forgot who I was writing to, so assuming you just read the big letters...</em></p>\r\n\r\n<p><em>SEND DRAGA-KILL TENNO-HELP BROTHERS</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Tyl Regor</strong></p>\r\n</div>"}, {"id": 65, "quest": 10, "name": "Scan the New Drones", "description": "<p>The Lotus sends the player to Gaia, Earth with the task of scanning more of the mysterious drones which the Lotus presumes to be of Corpus origin. Players will initially have to track down the drone&#39;s location while defending themselves against any Grineer enemies in the way. After a while, the Lotus will mention that the drones don&#39;t seem interested in the Tenno and that scanning their objective may determine what the drones are up to. Players at this point will have to scan a large, unique wreckage hanging off a cliff in order to proceed.</p>\r\n\r\n<p>Upon scanning the wreckage, the Lotus quickly recognizes the structure as an Old War wreckage, which furthers her confusion of why the Corpus are suddenly excavating the build. Players will then continue their mission to find out more information from the mysterious drones, to which two new targets will then be marked on the map to scan. These targets must be scanned or the mission will result in a failure.</p>\r\n\r\n<p>After scanning the last drone, the Lotus was both surprised and horrified to identify the drone as an Oculyst &ndash; To which she quickly warns the Tenno to stay safe and immediately cut off her transmissions completely, leading Ordis to temporarily act as the mission operator. Clearly in shock and disarray at the situation, Ordis directs the operator to quickly head to extraction.</p>"}, {"id": 64, "quest": 10, "name": "Mystery Drones", "description": "<p>This quest is initiated after successfully scanning an Oculyst using either a Codex Scanner or a Synthesis Scanner when the player encounters one of the strange drones in a mission on the Grineer Sealab tileset of Uranus (the player must complete the mission and extract successfully after scanning one out of the two drones in order for the quest to start). Only Players with Mastery Rank 3 or higher will have a chance at encountering the drone, although they can be encountered by lower Mastery Rank players if the host is 3 or higher. Completing missions on the Grineer Sealab tileset will additively increase the chance for a Strange Drone to appear.</p>\r\n\r\n<p>As the quest begins, the Lotus will send an inbox transmission with the message:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Tenno, I require your help.</em></p>\r\n\r\n<p class=\"mb-0 text-right\">- <strong>Lotus</strong></p>\r\n</div>"}, {"id": 63, "quest": 9, "name": "Defeat Chroma", "description": "<p>Landing on Ose, Europa, the Tenno are assigned to lure in Chroma by activating the Arcane Machine to trigger a Defense mission. While the mission initially starts out on the Corpus Settlement of Europa, the actual defense objective is located on an Orokin Derelict, accessible through a portal room. The Arcane Machine must then be defended against five waves of Corpus attackers. After the 5th wave, Chroma will appear alone. At Ordis&#39; suggestion, Chroma must then be scanned 5 times using the Synthesis Scanner while still defending the machine. Once all Corpus are eliminated and Chroma is scanned 5 times, the mission is completed and the player is rewarded with the Chroma Blueprint. The component blueprints can be acquired as Junction rewards. (A bug might cause enemies not to cross into the Derelict area. In this case Chroma can spawn before all enemies are defeated. The wave will be marked as complete after killing enemies who did not cross the portal.)</p>\r\n\r\n<p>Simaris is disappointed at Ordis&#39; action to scan Chroma instead of destroying it, to which Ordis replies that he is foremost the Operator&#39;s Cephalon.</p>\r\n\r\n<p>Players will also now have access to Simaris&#39;s Sanctuary Onslaught.</p>"}, {"id": 62, "quest": 9, "name": "Revisit the Derelict", "description": "<p>Synthesis Scanners are required for this mission.</p>\r\n\r\n<p>Returning to the site of the Arcane Machine, this mission sees the Tenno fight through a Grineer Settlement to get to the Portal that will take them to the Orokin Derelict where the Arcane Machine was found. Lotus mentions that Chroma was one of the most powerful Warframes with a great ability to adapt. Simaris deduces that the Chroma they&#39;re looking for is not Tenno-controlled, and that it is this mystery that is his goal.</p>\r\n\r\n<p>Upon reaching the Arcane Machine, a hostile Chroma Warframe will appear by it, armed with a Dera. Lotus and Simaris order the player not to engage it however, and that it should be Synthesized instead using Synthesis Scanners. Players are free to head back to extraction once they have synthesized the Chroma, receiving Chroma Mark blueprint as a reward.</p>\r\n\r\n<table class=\"table table-dark bg-black-t my-3\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>5000 Credits</td>\r\n\t\t\t<td>500 Salvage</td>\r\n\t\t\t<td>100 Circuits</td>\r\n\t\t\t<td>1 Scorched Beacon</td>\r\n\t\t\t<td>1 Chroma Signal</td>\r\n\t\t\t<td>Time: 1m</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>Back on the Landing Craft, Simaris confidently asks Ordis to extract a blueprint from the synthesis brought back by the Tenno. Ordis manages a blueprint, but unfortunately is unable to extract any more leads. Simaris then reveals that he has an Arcane Codex piece and knowledge of the location of another Machine, much to Lotus&#39; increasing frustration. The Chroma Mark must be built to progress.</p>\r\n\r\n<p>At the completion of the Beacon, Simaris makes Ordis an offer to become the &quot;Steward&quot; of his Sanctuary, to which Ordis readily accepts. Promising to restore Ordis once the hunt for Chroma is finished, Simaris gives the players the location of Chroma, telling them that by defeating the Warframe they will know who controls it.</p>"}, {"id": 61, "quest": 9, "name": "Investigate the source of the transmission", "description": "<p>Following the source of the transmission, the Tenno are tasked to undertake a Mobile Defense mission on a Corpus base on Morax, Europa, in order to extract information regarding the transmission. Terminals will need to be defended in order to complete the mission, granting the blueprint for another Chroma Signal upon completion. Players must build the Beacon to proceed.</p>\r\n\r\n<table class=\"table table-dark bg-black-t my-3\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>5000 Credits</td>\r\n\t\t\t<td>250 Ferrite</td>\r\n\t\t\t<td>100 Rubedo</td>\r\n\t\t\t<td>1000 Salvage</td>\r\n\t\t\t<td>10 Nav Coordinates</td>\r\n\t\t\t<td>Time: 1m</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>Once the Beacon is complete, Lotus expresses her shock at recognizing Chroma from the transmission, and expresses suspicion that someone is trying to cover their tracks using it. Meanwhile, Simaris reveals to Ordis that he can restore the latter&#39;s memories and possibly repair his malfunctions over time, and after Ordis deduces that they can decode the rest of the transmission on the Arcane Machine itself inside the Orokin Derelict in which it was found, Simaris praises Ordis&#39; potential, which he feels is being squandered by being a servant to the Tenno. Irritated at the banter, Lotus orders the Tenno to proceed to their next mission.</p>"}, {"id": 60, "quest": 9, "name": "Paying with Synthesis", "description": "<p>Before undertaking this next mission, it is imperative that players equip Synthesis Scanners in their Gear menu, said scanners being available from among Cephalon Simaris&#39; offerings for 5,000 Credits. Optionally, players can also equip Kinetic Siphon Traps, also available from Simaris for 5,000 Credits, to assist in accomplishing the objective.</p>\r\n\r\n<p>The next mission involves synthesizing a single Elite Arid Lancer on three different missions for Simaris. The mission will have a single Synthesis target, which will be a special Arid Lancer with a visible dark blue outline. The targets can also be tracked by following floating blue lights that can only be seen through the Synthesis Scanner, which indicate that the target is nearby. Simaris will also notify the player when the target is in range. At this time, a gold hexagon icon will appear on the mini map representing the Elite Arid Lancer.</p>\r\n\r\n<p>Players must scan 4 nodes on the Elite Arid Lancer, accomplished by equipping their Synthesis Scanner from the Gear menu, aiming at the target node and holding down the fire key (default LMB&thinsp;) until the node is scanned. The nodes appear as blue orbs on the target. The Arid Lancer target will then disintegrate once all 4 of their nodes have been scanned, indicating a successful synthesis. Scanning a node may cause the target to act unpredictably however, the player can prevent them from becoming alert by using stealth abilities like Rift Walk.</p>\r\n\r\n<p>The three targets can be acquired from a Sabotage mission in Ares. There is no restriction as to which mission to go, and players aren&#39;t necessarily required to go to the specified nodes to get the Synthesis target. All scanning can be done in a single type of mission but each mission will only have one target. While completing the main objectives is required to successfully complete the mission, it is the secondary objective of synthesizing the Arid Lancers that is needed to complete the quest objective.</p>\r\n\r\n<p>Upon scanning all three Synthesis targets, players must return to Simaris on the designated Relay, and engage him with the prompt informing him that all three targets have been synthesized. Simaris will thank the player, telling them that their scans have uncovered something that his sentinels missed, then reveal that the biological signature is Tenno in nature. Interested in what the biological signature is, Simaris will give the player a blueprint for a Scorched Beacon, and asks them to construct it.</p>\r\n\r\n<table class=\"table table-dark bg-black-t my-3\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>5000 Credits</td>\r\n\t\t\t<td>250 Ferrite</td>\r\n\t\t\t<td>100 Polymer Bundle</td>\r\n\t\t\t<td>1000 Salvage</td>\r\n\t\t\t<td>10 Nav Coordinates</td>\r\n\t\t\t<td>Time: 1m</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>Once the Beacon is complete, Ordis notes that it is sending a signal, which turns out to be a transmission from the Arcane Machine that says:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em><strong>ALL IS SILENT IN THE CALM. HUSHED AND EMPTY IS THE WOMB OF THE SKY.</strong></em></p>\r\n</div>\r\n\r\n<p>Upon hearing this Ordis begins to experience malfunctions. Simaris intervenes to save Ordis&#39; program while asking the player to track down the source of the signal, with the Lotus believing that the Corpus may be the next lead.</p>"}, {"id": 59, "quest": 9, "name": "Missing Sentinels", "description": "<p>The first mission of the quest takes players to a Grineer Shipyard Prison Complex on Nuovo, Ceres, where Cephalon Simaris tasks the Tenno with a Rescue mission to free his Sentinels from captivity, who were taken after investigating the Grineer Prison. Lotus asks Simaris about the significance of the facility, to which Simaris vaguely responds about the importance of knowledge.</p>\r\n\r\n<p>Once players reach the cell block and free the Sentinels &ndash; which takes on the form of three special Helios that disappear once the door is unlocked &ndash; Simaris will ask the Tenno to head to extraction for further discussion. However the Lotus, suspicious of Simaris&#39; goals, asks the Tenno to instead find the facility&#39;s data vault in order to find out what the Cephalon is after, taking the form of a Spy mission where a lone data vault must be infiltrated and its data console hacked to extract the data. Next, players must exterminate all the remaining enemies. The player is free to extract from the mission once no more enemies remain.</p>\r\n\r\n<p>Back on the Orbiter, Lotus mentions that they have managed to retrieve &quot;fragments of a biological signature&quot; within the facility&#39;s security logs despite extensive corruption of the data. Ordis runs the security log, which features the sounds of Grineer gunfire as if engaged in battle, along with a mysterious voice that says:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em><strong>HERE WE SHALL SEARCH AND FIND. THE EYES OF DAY DRINKING THE NIGHT.</strong></em></p>\r\n</div>\r\n\r\n<p>Recognizing the mysterious voice as the same one from the Arcane Machine discovered on Ceres, the Lotus asks the Tenno to pay Cephalon Simaris a visit to find out what else he knows. Upon visiting Cephalon Simaris on any Relay (Maroo&#39;s Bazaar being the only exception) and asking him with the prompt &quot;The eyes of day drinking the night?&quot;, Simaris tells the Tenno that knowledge must be earned, and then asks them to perform another quest for his Sanctuary in exchange for revealing what the biological signature means.</p>\r\n\r\n<p><strong>Note:</strong> If you are having trouble finding the Cephalon Simaris room and keep being directed by the game to the wrong room, you need to look for the two blue lifts which will be behind you as you look into the room the game marks. One will transport you up to the correct level, where you&#39;ll find Cephalon Simaris behind a door located in the same place as that which you were directed to a level below. The lifts only transport in one direction. You may also fast travel to him, by pressing escape, fast travel, and Cephalon Simaris.</p>\r\n\r\n<p><strong>Note:</strong> Players must undertake the Synthesis tutorial from Cephalon Simaris first in order for the dialog prompt to appear.</p>"}, {"id": 58, "quest": 9, "name": "Starting the Quest", "description": "<p>Stolen Dreams must be completed before The New Strange can be started.</p>"}, {"id": 57, "quest": 8, "name": "Final Jump", "description": "<p>The player is finally directed to Ose, Europa to conduct a final excavation mission in search of Limbo Chassis Blueprint. After acquiring the blueprint, Ordis is excited about the discovery of the last piece.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em>The final part. I cannot wait. What harrowing leaps of cross-dimensional gymnastics will he attempt next?</em></p>\r\n</div>\r\n\r\n<p>The player must construct the Chassis in order to progress in the quest. Note beforehand that the Chassis requires an Argon Crystal to make. Upon claiming Limbo Chassis, Ordis eagerly reads the rest of the Theorem, only to find out Limbo&#39;s death in the process.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Excellent, the final Theorem and it&#39;s unfragmented. Processing.</em></p>\r\n\r\n<p><em>Oh, wait, Limbo, no that&#39;s a mistake, you don&#39;t want to go there. It&#39;s too big a jump. You can&#39;t rift walk... ohh. Oh no.</em></p>\r\n\r\n<p class=\"mb-0\"><em>Operator, I think I know why we&#39;re finding Limbo parts scattered throughout the system. His final rift walk was a miscal... disaster. Well, perhaps when you occupy this frame, you will use more... caution.</em></p>\r\n</div>\r\n\r\n<p>When Limbo Chassis is claimed, the quest is considered completed and player can start building Limbo with Limbo Blueprint from the Market.</p>"}, {"id": 56, "quest": 8, "name": "Magician of Math", "description": "<p>The player will undertake another Excavation mission to extract a Limbo component, this time in search of the Limbo Systems Blueprint found on Martialis, Mars. Once acquired, Ordis says the followings:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Operator do you understand, this Limbo is telling us his story in pure math, and I must say, he&#39;s quite witty.</em></p>\r\n\r\n<p class=\"mb-0\"><em>You have to forge that blueprint as soon as possible. I must know what comes next.</em></p>\r\n</div>\r\n\r\n<p>Once again player must craft Limbo Systems before moving on to the next step.</p>\r\n\r\n<p>After Limbo Systems is completed and claimed. Ordis has these to say:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Just as suspected, another theorem. Limbo&#39;s formula for inverting the entropic mass of void quantum is downright naughty.</em></p>\r\n\r\n<p class=\"mb-0\"><em>I want more, Operator, please hurry, this story is getting quite good.</em></p>\r\n</div>\r\n\r\n<p>Again Ordis directs the player to Syrtis, Mars, to gather more Proof Fragments in order to craft Limbo Chassis Theorem.</p>\r\n\r\n<p>After Limbo Chassis Theorem is completed and claimed, Ordis comments on this new finding:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em>More parts to the story. My word, he is a magician of logic. Just when I think his diffraction principle is full of dangling ratios, he expresses his dynamic constant in pure numbers. I never saw it coming.</em></p>\r\n</div>"}, {"id": 55, "quest": 8, "name": "Rift Plane", "description": "<p>The player is directed to Cambria, Earth on an Excavation mission to check out Ordis&#39; lead. This mission requires the player to excavate 300 cryotic (3 full extractors), after which the player is rewarded with the Limbo Neuroptics Blueprint. Once obtained, Ordis will rethink his opinion on the Theorem and will attempt to make more sense of it:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em>A Limbo part blueprint! The Theorem wasn&#39;t complete malarkey after all. Perhaps there&#39;s more to these equations than I previously thought, what am I missing.</em></p>\r\n</div>\r\n\r\n<p>In the meantime, players must craft the Limbo Neuroptics, which will take 12 hours.</p>\r\n\r\n<p>When the Neuroptics is completed and claimed by the player, Ordis says the following:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Operator, I found a new theorem hidden deep in that Warframe part. These are actually starting to make sense, I mean they&#39;re nonsense but there&#39;s logic in the nonsense. It&#39;s almost as if someone&#39;s trying to speak to me in my own language.</em></p>\r\n\r\n<p class=\"mb-0\"><em>What is he trying to say? My apologies, operator, I get a little worked up when it comes to physics.</em></p>\r\n</div>\r\n\r\n<p>Ordis will once again send the player to Syrtis, Mars to gather more Proof Fragments in order to craft Limbo Systems Theorem.</p>\r\n\r\n<p>After Limbo Systems Theorem is completed, Ordis will send the player another coordinate. He will also extrapolate his findings about the existence of the Rift, and its connection to Limbo.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Now it&#39;s becoming clear. Could it be that there&#39;s a plane between our normal plane and the void? A space between space, a rift? A rift that this Limbo could control?</em></p>\r\n\r\n<p class=\"mb-0\"><em>Oh and I&#39;ve marked your navigation console, I think you&#39;ll be quite pleased with what you find there.</em></p>\r\n</div>"}, {"id": 54, "quest": 8, "name": "Nonsense", "description": "<p>Ordis will then direct the player to Syrtis, Mars to tap into Grineer communication towers in the hopes of successfully scanning for the Limbo signal. In practice, the mission provided is an Archwing Interception mission that will require players to complete a single round. However, the primary objective of the mission is not in the Interception mission itself (which provides no reward), but in collecting Proof Fragments that drop from killed enemies, which resemble Energy Orbs.</p>\r\n\r\n<p>Once the required number of Proof Fragments is collected (3 is required), and the Interception mission completed, the Limbo Theorem blueprint can then be crafted, which will take 60 seconds. Upon building it, Ordis comments at his curiosity of the Limbo Theorem, eagerly awaiting for it.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p class=\"mb-0\"><em>Good, now we get to find out what all this Limbo nonsense is all about. I await the theorem&#39;s completion.</em></p>\r\n</div>\r\n\r\n<p>Limbo Neuroptics Theorem (found in Foundry):</p>\r\n\r\n<table class=\"table table-dark bg-black-t my-3\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>6500 Credits</td>\r\n\t\t\t<td>3 Proof Fragments</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t\t<td>Time: 1m</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>After it is complete, Ordis will attempt to read the Theorem, only to be annoyed by even more nonsense the supposed evidence provided.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Okay, good, you&#39;ve... wait... the horizon mass cannot be inverted to &ndash; this is preposterous!</em></p>\r\n\r\n<p><em>Operator, I&#39;m sorry. You did all this work and this so called Theorem is still completely invalid. It&#39;s as if all these proofs point to notthingness it&#39;s just utterly irrational!</em></p>\r\n\r\n<p class=\"mb-0\"><em>There&#39;s only one valid coordinate in the entire proof, I&#39;ve marked it on your navigation console but I&#39;m sure it&#39;s a waste of time.</em></p>\r\n</div>\r\n\r\n<p>In the end, Ordis will lead the player to the only coordinate that he managed to obtain from the proof: Cambria, Earth.</p>"}, {"id": 53, "quest": 8, "name": "The Limbo Theorem", "description": "<p>In order to unlock this quest, the player must complete the Jupiter/Europa Junction. Upon completion, the player will be awarded with the The Limbo Theorem Quest.</p>\r\n\r\n<p>Go to the Quest section of the Codex, select the quest, then click &quot;Begin Quest&quot; to start. After starting the quest, the player will receive an inbox message from Ordis himself.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>So, this &#39;Limbo Theorem&#39; you picked up, it&#39;s supposed to lead to a new Warframe? Well, it&#39;s woefully incomplete!</em></p>\r\n\r\n<p><em>Half-written proofs, unfinished equations, what idiot wrote this mess??</em></p>\r\n\r\n<p><em>Okay. Okay. There is one thing here, a constant, a tuning frequency but it&#39;s so minute, the Orbiter&#39;s antenna would never be able to...</em></p>\r\n\r\n<p class=\"mb-0\"><em>...unless...go to your nav console, I have an idea.</em></p>\r\n</div>\r\n\r\n<p>The transmission will also provide the player with the blueprint for the Limbo Theorem key (not to be confused with the quest blueprint), which requires three Proof Fragments to craft.</p>"}, {"id": 52, "quest": 7, "name": "The Arcane Machine", "description": "<p>The Orokin portal that leads to the Derelict housing the Arcane Machine is located on a Grineer Settlement on Alator, Mars, that unfortunately has been overrun by the Infested. Players must fight through the Infested to reach the Portal room, which will lead them to a Derelict ship. The machine is located inside a large, special room with a pedestal in the middle, where the Arcane Codex can be uploaded. Instead of treasure like Maroo expects, the machine broadcasts an audio transmission with the following cryptic message:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>All-All is silent- Hushed-hushed and empty is-is-is the womb of the sky.</em></p>\r\n\r\n<p class=\"mb-0\"><em>All is silent and calm. Hushed and empty is the womb of the sky.</em></p>\r\n</div>\r\n\r\n<div class=\"my-3\">\r\n<audio controls=\"\"><source src=\"https://vignette.wikia.nocookie.net/warframe/images/f/f7/ArcaneCodexMessage.ogg/revision/latest?cb=20150207000102\" type=\"audio/ogg\" /><source src=\"https://vignette.wikia.nocookie.net/warframe/images/f/f7/ArcaneCodexMessage.ogg/revision/latest?cb=20150207000102\" type=\"audio/mpeg\" /> Your browser does not support the audio element, n00b.</audio>\r\n</div>\r\n\r\n<p>The player will then be attacked by an Arcane Boiler and several Infested units which they must fight off. The Lotus concludes that there is nothing more for them in the Derelict, and instructs the player to extract. Upon extraction, players will be awarded blueprints for an Orokin Catalyst and the Ether Daggers.</p>\r\n\r\n<p>Ordis expresses his confusion at the Arcane Codex not being what they expected and expresses his apologies to Maroo. Despite her dismay, Maroo explains that she is used to low payouts due to being a freelancer, and with the threat of the Grineer gone, she sets off on her own way.</p>\r\n\r\n<p>While on the Orokin Derelict ship, it is possible to find an Orokin Vault containing a Corrupted mod. As always, the team must have a matching Dragon Key to unlock the vault.</p>"}, {"id": 51, "quest": 7, "name": "Arcane Codex III", "description": "<p>The next set of Arcane Codices are located on a Corpus Ship on Roche, Phobos, and as with the previous codices are stored on three secure Data Vaults that must be breached with care to prevent alarms.</p>\r\n\r\n<p>Post-mission, Ordis realizes that the complete set of Arcane Codices form a code that can only be read by a machine, which he assumes is now unusable. Ordis&#39; musings catch Maroo&#39;s attention, who informs him that the Arcane Codex she retrieved from the Orokin Derelict came from some kind of machine. With Ordis hypothesizing that said machine Lotus sends the Tenno on a mission to find the machine.</p>"}, {"id": 50, "quest": 7, "name": "Arcane Codex II", "description": "<p>This time the Tenno are sent to a Grineer Galleon on Pantheon, Mercury to retrieve two of their Arcane Codices. As with the previous mission, the Grineer have stored the Codices on three separate Data Vaults, which include defenses such as roving Sensor Regulators and Magnetic b Magnetic energy doors, which can trigger alarms to initiate the data destruction sequence if alerted. During the mission, Maroo mentions that the Grineer believe the Codices will provide them the cure to their genetic degradation, though she dismisses this as wishful thinking.</p>\r\n\r\n<p>After successfully completing the mission, Ordis gushes at the perfection of the Arcane Codices&#39; writing, while Maroo quips that even then they don&#39;t know what the Codices are.</p>"}, {"id": 49, "quest": 7, "name": "Arcane Codex I", "description": "<p>With Maroo&#39;s info, the Arcane Codex piece in the Corpus&#39; possession is found to be held in a Corpus Outpost on Unda, Venus. The Tenno are thus tasked with a Spy mission to retrieve the Codex data from the Corpus by accessing three secure Data Vault rooms and hacking them. During the mission, Maroo will inform the player of the basics of this mission: Each Data Vault comes with a wide array of security systems including cameras and trip lasers, and tripping the alarms will cause the Vault to trigger a 30-second data destruction sequence in which the data will be destroyed unless the player can hack the data console. All three Data Vaults must be accessed before extraction can become available.</p>\r\n\r\n<p>Once the mission is successfully completed, Ordis states that the Corpus have three pieces of the Arcane Codex, while the Grineer have two, and he muses about the Corpus believing the Codex to lead to a lost Orokin treasure, which piques Maroo&#39;s interest.</p>"}, {"id": 48, "quest": 7, "name": "Capture Maroo", "description": "<p>Expressing an interest in the Codices, the Lotus sends the Tenno to find and capture Maroo, who was hiding in a Corpus base on Tharsis, Mars. The Lotus explains that the Arcane Codices have been a mystery for decades since they were first unearthed, with no one knowing what they are.</p>\r\n\r\n<p>As a Capture target, Maroo wields an Aklex pair, and can use Smoke Screen to turn invisible to evade pursuers. Also, Maroo has the ability to defend herself with her weapons when downed, similar to Tenno, and thus care must be taken when attempting capture.</p>\r\n\r\n<p>During capture, Lotus introduces herself to Maroo, and attempts to persuade her that coming with the Tenno is in her best interest.</p>\r\n\r\n<p>After capture, the Tenno receive a video transmission of Maroo&#39;s interrogation, where she reveals that Tyl Regor had hired her to retrieve the Arcane Codex piece from an Orokin Derelict. Due to her dislike of the Grineer however, she gave the Grineer a fake, and sold the Arcane Codex to the Corpus. After being persuaded of the danger the Grineer pose to her, Maroo agrees to the Lotus&#39; offer of protective custody in exchange for revealing the location of the Arcane Codex.</p>"}, {"id": 47, "quest": 7, "name": "Starting the Quest", "description": "<p>This quest is unlocked from the Codex once a player has completed the Phobos Junction. The Lotus learns that the Grineer have unearthed the last of the Arcane Codices in order to decipher their nature. The Grineer&#39;s plans are dashed however when Maroo, a professional thief, steals the last piece of the Arcane Codices and goes into hiding.</p>"}, {"id": 46, "quest": 6, "name": "[Extra] Weekly Mission", "description": "<p>Upon completing the quest, players can visit Darvo in a relay and use the prompt &quot;Does Clem need my help?&quot;, which will trigger a Survival mission largely identical to the quest&#39;s final mission. At the five minute mark the Cell will be attacked either by Shik Tal, the Lynx, or a Juggernaut, depending on whether the Cell is fighting the Grineer, Corpus, or Infested respectively. This mission is repeatable, but can only be performed once every seven days after successfully completing it. As with the quest mission, the weekly mission will reward a Clem Clone Blueprint.</p>"}, {"id": 45, "quest": 6, "name": "Help Darvo get the relic", "description": "<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Clem has his Grakatas, now its time to get down to business and liberate the artifact. If you help Clem we can all share the spoils.</em></p>\r\n\r\n<p class=\"text-right\">- <strong>Darvo</strong></p>\r\n</div>\r\n\r\n<p>The third mission is a Survival mission on Uranus, as Darvo finally assigns the Tenno to recover the artifact that Clem had originally been assigned to.</p>\r\n\r\n<p>Clem again assists players, still armed with his Twin Grakatas, as they distract the Grineer while another of Darvo&#39;s agents finds the artifact. This mission will play on as a standard survival mission, until around 3 and a half minutes away from completion, when the Tenno will be attacked by the last remaining member of the Grustrag Three, Shik Tal. Upon finding the relic, Darvo calls it &quot;The Potent Orokin Technical Augmentation and Tactical Offensive device,&quot; which he acronyms as POTATO. A Clem Clone Blueprint will be rewarded upon completion and extraction.</p>\r\n\r\n<p>When the player finishes the mission, Darvo will ask them to come to a relay so they can thank the player in person. The player will receive an Exilus Adapter when Darvo finishes talking.</p>"}, {"id": 44, "quest": 6, "name": "Retrieve Clem's Grakatas", "description": "<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>You did it, you got Clem. He&#39;s a special guy, you know. Little weird but hell of a fighter. And that&#39;s the thing, he still needs your help to retrieve his custom weapons.</em></p>\r\n\r\n<p class=\"text-right mb-0\">- <strong>Darvo</strong></p>\r\n</div>\r\n\r\n<p>Back on the Orbiter, Darvo informs the player that Clem will need his custom-made Twin Grakatas to be fully combat ready, and thus sends them on a Salvage mission to retrieve them.</p>\r\n\r\n<p>Clem will accompany players on this mission, initially equipped with a Latron to fight off enemies, with Darvo lamenting how Clem is helpless without his custom weapons. The custom-made Twin Grakatas can be picked up at a barracks room, and will be equipped by Clem when acquired. Once retrieved, Darvo informs the Tenno that Clem wants to deal with the ones who took the Twin Grakatas, pointing players to an Assassination target. The target turns out to be Vem Tabook of the Grustrag Three, whom players have to kill before extraction.</p>"}, {"id": 43, "quest": 6, "name": "Rescue the contractor", "description": "<p>The first mission takes players to a Rescue mission on Uranus to find and free the contractor, whom Darvo explains is a Grineer soldier that has a genetic flaw making him disobedient to the Queens, and had been on the way to retrieving an artifact when he was captured.</p>\r\n\r\n<p>Upon arriving at the prison complex, the termination timer of 2:30 minutes will immediately start regardless of player action, making the task of freeing the contractor from the pod a race against time. Large amounts of Grineer reinforcements, as well as Leekter of The Grustrag Three, will arrive to hinder any attempts at retrieval. The hostage, revealed to be a Lancer named Clem, must be safely extracted to complete the mission.</p>"}, {"id": 42, "quest": 6, "name": "Starting the Quest", "description": "<p>Players will receive a message from Darvo in their inbox, asking them to come see him for an urgent matter. Players must then visit Darvo in any of the Relays, and interact with him using the prompt &quot;What&#39;s the job?&quot;. This will add the Quest to the Codex, from where it can be activated to unlock the first mission.</p>"}, {"id": 41, "quest": 5, "name": "Balor Fomorian", "description": "<p>The Archwing is a set of mechanical wings used by Tenno to fly and engage in combat in space, offering a potent mix of firepower and mobility to engage spaceborne enemies.</p>\r\n\r\n<p>Once the player successfully docks with the Archwing, they will need to reach a new extraction point out in deep space away from the battle. Grineer spacecraft however will deploy Zeplens, large devices deploying energy nets that can trap the Tenno inside their radius. Players will need to destroy the Zeplen units in order to advance, while destroying any enemies along the way while at the same time avoid getting seen by the Balor Fomorian&#39;s weapons &ndash; A single shot could mean demise.</p>\r\n\r\n<p>The Tenno, with valiant effort escaped the range of Balor Fomorian, and immediately extract with their Liset in space before the Fomorian could reach them. It was a successful retreat &ndash; however it also means victory. But the real battle has yet to begin. And by the time it comes, the Fomorian will be ready, but so will the Tenno.</p>\r\n\r\n<p>Completing this mission will complete the quest, unlocking Archwing nodes throughout the solar system as well as granting access to other Archwing blueprints and their respective arsenal.</p>"}, {"id": 40, "quest": 5, "name": "Intel Espionage", "description": "<p>The Lotus will then order the Tenno to deploy to the Montes sector of Venus, and infiltrate a Corpus Ship with the intention of retrieving intelligence about the Grineer Balor Fomorian by first exterminating all opposition.</p>\r\n\r\n<p>However, the mission is abruptly interfered with the presence of Grineer Fleets led by Councilor Vay Hek, who contacts Frohd Bek over severing ties with the Corpus. The Corpus Ship is soon boarded by Grineer marines as it suffers severe damage from heavy bombardment with the surprise arrival of a Balor Fomorian. The dire situation forces the Lotus to order for a mission abort and calls for the Tenno to head to the extraction point, however Ordis informs her that extraction may not be possible due to the extensive damage suffered by the ship, ultimately leaving the Tenno without any means of escape. If there is only one chance to escape the ship alive, it is to delve into the deep space. The Tenno makes its preparation, charging its Warframe before diving into the great unknown. The Lotus -- Somewhat in a forceful manner, orders Ordis to deploy and attach the Archwing to the Tenno, along with their respective weapons, Imperator and Veritux.</p>\r\n\r\n<ul>\r\n\t<li>Imperator is a heavy machine gun with a very fast rate of fire, suitable against short-mid range and heavy targets.</li>\r\n\t<li>Veritux is a massive greatsword which sports constant heavy damage. Supposedly impossibly massive to wield on ground, the weightless space turns this weapon into a weapon of pure destruction.</li>\r\n</ul>"}, {"id": 39, "quest": 5, "name": "Excavation", "description": "<p>Ordis will immediately inform Lotus of the Orokin Archive along with its coordinates to locate the Archwing components needed. Each successful excavation will yield a random Odonata component blueprint. Much like normal excavation, players can extract as soon as the first excavation is completed.</p>\r\n\r\n<p>Once all three blueprint parts of the Odonata (Wings, Harness and Systems) have been obtained, Ordis will persuade the player to build the Archwing. After the Archwing is constructed the player will need to &quot;Discover&quot; the component parts.</p>"}, {"id": 38, "quest": 5, "name": "The Archive", "description": "<p>The Tenno deploys to Tessera, Venus, in a mission to retrieve the Orokin Archive coordinate from a Corpus stronghold via Orokin Void&#39;s portal. This mission reintroduces the Orokin Sabotage game mode from the Operation Gate Crash event; the Tenno must reverse the flow of the portal via a nearby Orokin Generator which they must defend it from oncoming Corpus. Once it has completed, the Tenno must traverse to the Corpus via the portal to retrieve the Void Key from the Corpus Lynx proxy, and then destroy the portal by overloading the Orokin Torsion Beam Device to make sure the Corpus couldn&#39;t salvage the Orokin Tower further.</p>\r\n\r\n<p>There are three optional Corpus caches, in the form of a Corpus locker with white light, in the void part of this mission only the marked cache is needed to retrieve the archive. All of the caches can be found before trying to reverse the portal. The first resource cache discovered can contain Void Keys, while the second has a larger chance at obtaining rare resources, and the last cache discovered can award Prime blueprints and Forma.</p>"}, {"id": 37, "quest": 5, "name": "The Time is Now", "description": "<p>Upon beginning this quest, Lotus will send an inbox transmission to the player along with an Odonata blueprint, noting that they finally have a working Archwing prototype and orders the Tenno to gather the materials needed to craft it.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>The Balor Fomorians are coming but you will be ready. We finally have a working Archwing prototype and I have sent you the blueprint.</em></p>\r\n\r\n<p><em>This is where your task begins. You must recover blueprints for the component Archwing parts.</em></p>\r\n\r\n<p><em>We know these were scattered throughout the system. We also know the Corpus are in possession of a lost Orokin archive, detailing their locations.</em></p>\r\n\r\n<p><em>Recover the archive and then find the blueprints needed to forge your Archwing. Good luck, Tenno.</em></p>\r\n\r\n<p class=\"text-right mb-0\">- <strong>Lotus&#39; Transmission</strong></p>\r\n</div>"}, {"id": 36, "quest": 4, "name": "Cascade Bomb", "description": "<p>The Lotus sends the Tenno to Lares, Mercury, in an attempt to destroy the Infested there by using a Cascade Bomb planted on the asteroid&#39;s power core, that will use Void energy to eliminate all organic life while leaving the structure intact. This mission takes the form of a Defense mission where the player has to prevent the Infested from destroying the Power Core for ten waves. Notable differences from the standard Grineer Asteroid defense mission includes the large masses of Infested biomass surrounding the power core, and having only two access points to the core instead of three. During the mission, the Lotus makes note that while the Infested appear to be mindless, they seem to know what the Tenno are up to and are trying to stop them.</p>\r\n\r\n<p>After the mission is completed, the Lotus will message players to reward them with a Heat Sword blueprint, concluding the quest.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Tenno,</em></p>\r\n\r\n<p><em>The Cascade explosion worked and the asteroid has been purged of infestation. But I&#39;m afraid this threat cannot be so easily contained. Doctor Tengus&#39; experiments with this plague are grossly irresponsible and have threatened the entire system. All that is needed is an infected ship to reach a populated area and we&#39;ll be unable to contain its spread. There&#39;s no controlling it, the Grineer will be in just as much peril as we are.</em></p>\r\n\r\n<p><em>To prepare you for this new fight I have sent you something that should prove effective against this menace. Let us hope you will not need to use it.</em></p>\r\n\r\n<p class=\"text-right mb-0\">- <strong>The Lotus</strong></p>\r\n</div>\r\n\r\n<p>An additional intercepted message will be sent to players detailing a report by Doctor Tengus&#39; to the Twin Queens, blaming the Tenno for the outbreak at the facility and taking credit for it&#39;s destruction while claiming the Tenno have obtained Infested spores and will use them against the Grineer:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>INTERCEPTED MESSAGE: Quarantine Disrupted</em></p>\r\n\r\n<p><em>My Queens,</em></p>\r\n\r\n<p><em>It is my shame to report that Tenno interference has caused a breach of our Infested testing lab on M-Prime. Acting immediately, I ordered the destruction of the facility which has contained the outbreak. Tragically, I believe the Tenno have stolen spores with the intent to use the plague against us.</em></p>\r\n\r\n<p><em>I will act at once to develop a countermeasure, I will not allow this unethical behavior by the Tenno to threaten our glorious cause.</em></p>\r\n\r\n<p class=\"text-right mb-0\"><em>For the Queens,</em></p>\r\n\r\n<p class=\"text-right mb-0\">- <strong>Doctor Tengus</strong></p>\r\n</div>"}, {"id": 35, "quest": 4, "name": "Infestation Outbreak", "description": "<p>The next mission takes place in Terminus, Mercury, where players are tasked with exterminating all Infested units aboard a Grineer Galleon overrun by the Infestation. Upon completing the mission, the Lotus will message the player to reward them with the Molten Impact mod.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Tenno,</em></p>\r\n\r\n<p><em>This is from one of Doctor Tengus&#39; reports:</em></p>\r\n\r\n<p><em>&quot;The additional test Marines have arrived. The specimens tore through previous batch much faster than expected. It should be noted that Marines who survived the longest were using fire based weapons.&quot;</em></p>\r\n\r\n<p><em>The Infested are vulnerable to fire. I have sent a fire damage mod for you to install on your Melee weapon. It should aid you in your coming mission.</em></p>\r\n\r\n<p class=\"text-right mb-0\">- <strong>The Lotus</strong></p>\r\n</div>"}, {"id": 34, "quest": 4, "name": "Investigate the Bio Weapon", "description": "<p>The quest begins upon receiving the following message from The Lotus:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>Tenno,</em></p>\r\n\r\n<p><em>We have intercepted and partially decrypted a disturbing Grineer communication. A Grineer doctor by the name of Tengus claims to have uncovered some sort of new bio weapon. We have few details but the message originated out of Terminus.</em></p>\r\n\r\n<p><em>You need to go there and investigate.</em></p>\r\n\r\n<p class=\"text-right mb-0\">- <strong>The Lotus</strong></p>\r\n</div>\r\n\r\n<p>The player is then tasked to a Grineer Spy Mission on M Prime, Mercury to collect three data units for retrieval from a Grineer Asteroid base. During the mission, the Grineer Dr. Tengus is revealed through intercepted transmissions to be working on &quot;specimens&quot; to be used in the development of his bio weapon.</p>\r\n\r\n<p>After the first data unit is recovered, Tengus&#39; assistant express anger that the Tenno are there, demanding absolute secrecy in their project and thus ordering the marines to assault the Tenno.</p>\r\n\r\n<p>After the second data unit is recovered, panic breaks loose as the Infested has broken free from quarantine, with the effect of Infested units now appearing to fight both Grineer and Tenno. Despite of which, it appears that there may be an unknown third party involved, as the Grineer soldiers blames Dr. Tengus for the outbreak, while the Lotus implies that someone else released the Infested on purpose.</p>\r\n\r\n<p>After the third and final data unit is recovered, the Lotus briefly explain what the Infested are and how they disappeared a long time ago. The mission is considered complete if the player reaches the extraction with at least one data unit extracted.</p>"}, {"id": 33, "quest": 3, "name": "Defend your Kubrow in combat", "description": "<p>To earn the newly hatched Kubrow&#39;s favor, the player must now take their new companion to Earth to locate a collar and partake a 5-wave Defense against the Grineer with the Kubrow being the defense objective. The Kubrow does not have much health as a standard defense objective, but can be revived if it goes into bleedout. On completion of the mission, a Taichen Collar cosmetic is rewarded, completing the quest.</p>"}, {"id": 32, "quest": 3, "name": "Incubate and mature a Kubrow using the Incubator", "description": "<p>In order to incubate the egg, incubator requires an Incubator Power Core. This can found by:</p>\r\n\r\n<ul>\r\n\t<li>Completing the Earth to Mars Junction.</li>\r\n\t<li>Purchasing the blueprint from the Market.</li>\r\n\t<li>Purchasing a pre-built power core from the Market for 35 Platinum.</li>\r\n</ul>\r\n\r\n<table class=\"bg-black-t my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>100,000 Credits</td>\r\n\t\t\t<td>4,500 Nano Spores</td>\r\n\t\t\t<td>2 Control Module</td>\r\n\t\t\t<td>1 Argon Crystal</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t\t<td>Time: 8h</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: 35 Platinum</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: 50,000 Credits</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>With the egg and power core in possession, the incubation can now begin. There are three options to begin incubation.</p>\r\n\r\n<ul>\r\n\t<li>Random: The egg hatches a Kubrow whose variant, height, gender, color, and fur pattern are completely random.</li>\r\n\t<li>Genetic Code Template: A pair of templates with stored data imparts their genetic information onto the egg, making the hatched Kubrow more likely to have predetermined features.</li>\r\n\t<li>Helminth Cyst: A fully developed cyst on player&#39;s Warframe can be drained to guarantee a Helminth Charger.</li>\r\n</ul>\r\n\r\n<p>Incubation takes 48 hours to complete (24 hours if a Nutrio Incubator Upgrade Segment is installed), after which the player can name the Kubrow.</p>"}, {"id": 31, "quest": 3, "name": "Find a Kubrow Egg in Feral Kubrow dens", "description": "<p>With a means to incubate a Kubrow, the player must now find a Kubrow Egg. This can be done in multiple ways:</p>\r\n\r\n<ul>\r\n\t<li>On any Grineer Forest tileset on Earth, destroying a Kubrow Den has a chance to yield an egg.</li>\r\n\t<li>An egg can be purchased from the Market for 10 Platinum.</li>\r\n\t<li>Alert Missions may reward an egg.</li>\r\n</ul>\r\n\r\n<p>If the player already has an egg, this step is skipped.</p>"}, {"id": 30, "quest": 3, "name": "Acquire the Incubator Segment", "description": "<p>Having learned the Corpus acquired an Incubator Segment, the Lotus tasks the player to raid one of their bases on Venus so that a Tenno Operative may steal it as the Corpus are distracted. This is a 10-minute Survival where the player must survive against endless Corpus enemies until extraction is prompted.</p>\r\n\r\n<p>With the segment acquired, the player must install it in their Orbiter.</p>"}, {"id": 29, "quest": 3, "name": "Starting the Quest", "description": "<p>The quest unlocks after completing the Junction on Venus and must be started from the Codex. On starting the quest, the player will receive an inbox message:</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p><em>INTERCEPTED CORPUS MESSAGE: Where is my Kubrow?</em></p>\r\n\r\n<p><em>Dr. Intehb,</em></p>\r\n\r\n<p><em>You have had the Orokin Incubator Segment for months and still you&#39;ve produced nothing but genetic rejects. You promised me a Kubrow worthy of an Orokin prince, not a misshapen ball of hair and teeth.</em></p>\r\n\r\n<p><em>At great expense, I have procured another batch of eggs from the forests of Earth. They will reach your facility on Elara shortly. Do not waste these as you did the last ones.</em></p>\r\n\r\n<p><em>I will have my Kubrow of my own. If you are not up to the task, I will find someone who is.</em></p>\r\n\r\n<p class=\"text-right mb-0\">- <strong>Frohd Bek</strong></p>\r\n</div>"}, {"id": 28, "quest": 23, "name": "Epilogue", "description": "<p>On returning to Fortuna, the player will receive the K-Drive Launcher, and an inbox message stating Smokefinger found a main blueprint for the Garuda warframe.</p>\r\n\r\n<p>The Solaris United and Ventkids syndicates are now available, with Eudico offering Bounties, The Business with fishing and wildlife conservation, and Ventkids with K-Drive. Thursby is also revealed to have survived and gained mechanical legs, earning him the new name Legs, offering to sell MOA parts.</p>\r\n\r\n<p>The Vox Solaris syndicate will also be available if the player has also completed The War Within.</p>"}, {"id": 27, "quest": 23, "name": "Talk to Eudico in Fortuna (Part 3)", "description": "<p>Eudico explains to the Tenno that Nef Anyo placed the Profit-Taker Orb to prevent Solaris from interfering with his investor showcase, and tells them that she arranged something for them back on Orb Vallis.</p>\r\n\r\n<p>Just outside of Fortuna is a K-Drive. The Tenno must head toward the coolant tower, slipping past the Profit-Taker Orb, and hack into the control terminal to reposess the tower, then defend it from Corpus as Eudico attempts to overheat the tower. Vox threatens Nef Anyo, right in front of his investors, with the destruction of the coolant tower if he does not comply with their demands. Nef Anyo tries to pass it off as security detail and attempts to call their bluff, but Vox counters that they&#39;d rather go down with his fortune than continue living in poverty. When the overheat nears completion, Nef Anyo finally relents and Vox reminds him that the Solaris are the people who make the Vallis work.</p>\r\n\r\n<p>Eudico instructs the Tenno to deliver the Amarast, remedying the heat cascade, before they return to Fortuna. Meanwhile, Nef Anyo attempts to appease his angry investors, to no avail.</p>"}, {"id": 26, "quest": 23, "name": "Talk to Eudico in Fortuna (Part 2)", "description": "<p>Eudico explains that since Nef Anyo crushed the resistance, she had been focused on attempting to appease him, now realizing that her efforts are in vain. She tells the Tenno that they can leave if they wish, but are the only obstacle between Solaris and oblivion from Nef Anyo&#39;s men. The Tenno resolve to stay and fight, and receive a &quot;present&quot; to be delivered.</p>\r\n\r\n<p>The Business assumes Eudico is attempting to buy off Nef Anyo, before realizing his K-bomb is missing. At topside, Nef Anyo&#39;s troops have amassed right outside of Fortuna. The Tenno must detonate the K-bomb before fighting off waves of Corpus.</p>\r\n\r\n<p>Eudico, returning to her &quot;Vox Solaris&quot; identity, announces the return of Solaris United and that the Tenno is their messenger, demanding a halt on repossessions. Nef Anyo disbelieves Vox&#39;s return as a nothing but a ghost and sends in a Profit-Taker Orb, a gargantuan spider machine. As the Tenno currently has no means to combat the Orb, Eudico orders a retreat, claiming Nef Anyo won&#39;t destroy Fortuna with it.</p>\r\n\r\n<p>The Business apologizes to Eudico, but instead she thanks him for not giving up on her.</p>"}, {"id": 25, "quest": 23, "name": "Talk to Eudico in Fortuna (Part 1)", "description": "<p>Eudico laments at Thursby&#39;s repossession, mentioning that the medics are unsure if they can stabilize him due to &quot;so much missing.&quot; She blames the Tenno before deciding to attempt an appeal to Nef Anyo and instructs them to head back to Orb Vallis.</p>\r\n\r\n<p>Nef Anyo is pushing to activate an Orokin coolant tower, but due to its unfinished state it will release a heat cascade that threatens the Vallis. To counteract this, the Tenno must defend a single excavator as they drill for Amarast. However, The Business warns Eudico that her attempts to appeal to Nef Anyo are in vain, and Fortuna needs the rebellious Eudico.</p>\r\n\r\n<p>Eudico urges the Tenno to hurry and deliver the Amarast to the coolant tower. However, Nef Anyo broadcasts to the Solaris that his investor showcase is coming soon and decides to perform a test run. By the time the Tenno arrive, they are too late and the tower malfunctions, and are told to return to Fortuna. Nef Anyo demands the Solaris&#39; floor boss turn in fifty workers for repossession.</p>"}, {"id": 24, "quest": 23, "name": "Talk to Thursby in Fortuna (Part 2)", "description": "<p>Thursby, now with the proper supplies to start a shop, thanks the Tenno, and refers them to The Business. The Business explains that he wishes to preserve the unique species in Orb Vallis before they are driven to extinction and tells the Tenno to head topside if they wish to help.</p>\r\n\r\n<p>The Business wants to send a message to the Corpus by delivering a K-bomb to their repo squad, who have made a hit list of indebted Solaris. Eudico immediately intervenes and orders them not to use the K-bomb and instead stealthily take the list, prompting The Business to argue against Eudico&#39;s methods. The Tenno must head into a bunker and hack a terminal to take the hit list, and must avoid the cameras and drones otherwise the Corpus will attempt to delete their data. The hit list reveals that the repo squad is after The Business&#39;s field squad, who are overdue for a check-in.</p>\r\n\r\n<p>The Tenno arrives too late to find that the Corpus have already reached the field squad, but the whole team isn&#39;t present. They must investigate the four deceased bodies in the area, learning that the rest of the squad has been captured and are awaiting &quot;processing.&quot;</p>\r\n\r\n<p>At the site where the field squad are being held, the Tenno must hack a terminal and defend the area until the hacking is complete. Killing the Terra Jailers reinforcements drops a data key that speeds up the hacking process.</p>\r\n\r\n<p>Once the hostages are rescued, Nef Anyo contacts the Tenno informing them that Thursby&#39;s stunt had not gone unnoticed, and has him repossessed.</p>"}, {"id": 23, "quest": 23, "name": "Talk to Thursby in Fortuna (Part 1)", "description": "<p>Thursby is a merchant desperately trying to meet his quota from selling useless scrap, so he asks the Tenno to steal better goods from the Corpus in Orb Vallis. When asked about Eudico, he explains that she once led the people of Fortuna under the name &quot;Vox Solaris&quot;, the voice of Solaris United, until an incident caused her to step down.</p>\r\n\r\n<p>In Orb Vallis, Thursby points the Tenno to a Corpus supply drop. There, they must loot three caches within the marked area, which appear as barrel-like containers that can be identified by the smoke rising out of them.</p>\r\n\r\n<p>Impressed with the Tenno&#39;s work, Thursby suggests they could assault Nef Anyo by blowing up his coolant tower before he can present it to his board. However, Eudico cuts off his transmission, warning that he was speaking through an unsecured channel that had been tapped by the Corpus. The Tenno must pursue and shoot down a Corpus spy drone, then kill 30 enemy reinforcements all while defending the drone as Eudico hacks and erases the recording of Thursby.</p>\r\n\r\n<p>Once complete, Eudico ponders on having the Tenno for the resistance, but she stops herself and warns them not to help Thursby again. They must now head back to Fortuna.</p>"}, {"id": 22, "quest": 23, "name": "Starting the Quest", "description": "<p>Aside from needing to access Fortuna by reaching Venus, this quest has no prerequisite.</p>\r\n\r\n<p>The quest begins upon first talking to Eudico. She explains that the Solaris work for a living and if the Tenno want to help, they should buy from Thursby, who is threatened with a repo order. Thursby had took on his parents debt and if he fails to make ends meet Nef Anyo will claim repossession and take away mechanical body parts and even his organic arms and legs.</p>"}, {"id": 21, "quest": 2, "name": "Epilogue II", "description": "<p>If the player has completed both Saya&#39;s Vigil and The War Within, bringing the Tenno Operator to the north-east part of Cetus will allow them to access The Quills&#39; hideout.</p>"}, {"id": 20, "quest": 2, "name": "Epilogue I", "description": "<p>On the Orbiter, the Tenno complete the Shatter-lock and open the coffer, only to find an iron flower inside, the one Konzu gave her in the past. Saya, after five years of distraught, finally accepted that her love is gone for good, and eventually began to follow her heart to her other love: Konzu. Saya can now be seen standing next to Konzu whenever the player visits Cetus.</p>\r\n\r\n<p>An inbox message from the Lotus will be sent, with a transmission telling them how she used a harmonics sweep to examine the Shatter-lock key and found data for Gara, the Glass Warrior. Players will then receive the Gara blueprint, ending the quest.</p>"}, {"id": 19, "quest": 2, "name": "Saya's Vigil", "description": "<p><strong>Location:</strong> Plains of Eidolon, Earth<br />\r\n<strong>Enemy Level:</strong> 5 - 8</p>\r\n\r\n<p><em>Note: this phase of the quest will always put players at the Plains of Eidolon in nighttime, regardless of the Plain&#39;s actual time of day.</em></p>\r\n\r\n<p>Back on the Plains, a waypoint has been provided which players must reach to find the last Shatter-lock shard. Arriving at the site near a small lake, players will find an entire battalion of Grineer in combat against a lone Eidolon Teralyst, a gigantic Sentient construct roaming the Plains. The Lotus advises the Tenno to seek cover, as they are currently no match for the Sentient. Players must get past the ensuing battle and into a cave near the lake, where players can find a large Orokin object inside.</p>\r\n\r\n<p>To find the last shard, players must find a small rock shaped in a perfect circle on top of a mound, and then remove it by interacting with it, revealing the shard underneath. Once players have scanned the Shard with their Codex Scanner, they can use an alternate cave opening that leads away from the battle outside, then proceed to a designated extraction waypoint.</p>"}, {"id": 18, "quest": 2, "name": "Board Hek's Galleon", "description": "<p><strong>Tileset:</strong> Grineer Galleon, Earth<br />\r\n<strong>Enemy Level:</strong> 5 - 8</p>\r\n\r\n<p>Arriving at the Grineer ship, the Lotus finds her scans are being blocked, making her unable to scan for shards. Saya mentions how she and Onkko discovered that the shards respond to a unique harmonic, and laments that they can&#39;t subject the ship to a wideband harmonic. The Lotus however claims that she can do so, and subjects the vessel to a broad frequency sweep, visible as blue pulses of light passing through the ship. With the fragments located, Konzu discusses how Saya and Onkko&#39;s work was beneficial for Cetus, and Saya explains that it came at the cost of their personal relationship due to their dedication to Cetus.</p>\r\n\r\n<p>The objective in this mission to find a vault holding the shard marked by a waypoint. Along the way, players will enter a shuttle bay room, at which point the Grineer will launch an ambush led by a Nox, which players must defeat to proceed. Once players reach the designated vault, they must hack the marked console, which will automatically grab the shard, allowing them to go to extraction to finish the mission.</p>\r\n\r\n<p>Saya points to Vay Hek digging in the Central Plains, where Onkko once found some artifacts, and surmises that the last piece of the lock is there. This makes Konzu and Saya reminisce over a past memory involving Onkko, causing Saya to realize where they should look for the last piece. Saya suggests to wait until nightfall, as there won&#39;t be any Grineer patrolling the plains then.</p>"}, {"id": 17, "quest": 2, "name": "Locate the Shatter-Lock pieces", "description": "<p><strong>Location:</strong> Plains of Eidolon, Earth<br />\r\n<strong>Enemy Level:</strong> 5 - 8</p>\r\n\r\n<p>Returning to the Plains, players must find a small Grineer camp marked by a waypoint. En route, Konzu offers his assistance in finding Onkko only to be rebuffed by Saya, who believes in Konzu&#39;s involvement due to her rejecting his declaration of love in the form of an iron flower, an accusation that Konzu denies.</p>\r\n\r\n<p>Once players arrive at the Grineer camp, their task is to find the broken shards of the Shatter-lock key located within the yellow radius marked on the map. To do so, players can equip their Codex Scanner by bringing up the Gear menu (default Q&thinsp;) which will put them into a scoped first person view. As the Shatter-lock key is a viable target for the Codex Scanner, it will flash orange within the Codex Scanner&#39;s sight, which can be seen even through obstacles. Once located, players must then scan the Shatter-lock shard by aiming the Codex Scanner at it and holding down the Fire key (default LMB&thinsp;). There are three shards on the Grineer camp, and players must find all three to complete the objective.</p>\r\n\r\n<p>At this point, Vay Hek will transmit his intention to retrieve the glass shards, as he believes it to be the key to unlocking a power that can defeat the Sentients. Multiple enemy reinforcements will then drop in, and players are to kill all Grineer within the camp. In particular, a Tusk Bolkor assault transport will fly in to provide close-air support for the Grineer, and players must destroy it in order for the Lotus to extract them. Once it is destroyed, an extraction waypoint will be provided nearby.</p>\r\n\r\n<p>The Lotus will ask what power Vay Hek was referring to, and Konzu explains that Onkko found the remains of &quot;Unum&#39;s Champion&quot;, a woman of Glass, and studied it. The knowledge was kept secret by the Quills until the Grineer captured one of them, leading to their current pursuit. Figuring out the possibility of Onkko having been captured by the Grineer, Saya wonders if Vay Hek might trade the Onkko in return for the relic, before berating herself for thinking about treacherous thoughts.</p>\r\n\r\n<p>Tracking an off-world shipment of supplies to a Grineer ship in orbit, the Lotus surmises that Hek would bring any shards he&#39;s found there, and asks the Tenno to infiltrate it.</p>"}, {"id": 16, "quest": 2, "name": "Find Onkko", "description": "<p>Players must go to the waypoint marked on the Plains, located to the west just outside of Cetus walls. There, they will encounter a Grineer drilling operation where they are apparently looking at Onkko&#39;s research. Vay Hek then contacts the Tenno, irritated at their involvement with the Ostrons, and the Lotus mentions how only Hek would lead outmatched Grineer to their deaths against an Eidolon, with Vay Hek gloating that he will gladly send more to their deaths for a chance at killing the Lotus, the Grineer will start dropping in reinforcements to the dig site. Players must eliminate all enemies that arrive within the dig site, whose area is denoted by a red circle on the minimap.</p>\r\n\r\n<p>Once the area is clear, the Lotus will detect strange readings from a nearby cave in the area, which is currently covered up by a Grineer drilling machine. Konzu remembers that the cave was where he and Onkko often took shelter in the past before a rockslide sealed it, and wonders if Onkko is inside, raising Saya&#39;s hopes up. Players must destroy the drill&#39;s augers, which will be indicated by a white gleam on its surface, by attacking it with any weapon in order to access the cave. Inside, players will find an Ostron Coffer, a white locked box, at the end of the cave.</p>\r\n\r\n<p>Players can pick up the coffer by interacting with it (default X&thinsp;), at which point Saya wonders if the coffer is Onkko&#39;s to her dismay, while ignoring Konzu&#39;s attempt to comfort her as she mentions how he was there when Onkko disappeared. The Lotus is unable to figure out the lock on the coffer, and asks players to return to the Orbiter to examine it. An extraction waypoint will be provided to the player out on the Plains, marked by a green radius on the minimap, to allow players to exit the Plains and go back to their ship directly without returning to Cetus.</p>\r\n\r\n<p>Back in the Orbiter, Lotus asks the player to examine the coffer using the Codex, which automatically brings up a close-up view of the box. The Lotus, seeing the box&#39;s lock is damaged, suggests forcing it open. Saya however explains that the box is protected by a Shatter-lock, which uses a glass key that was broken, and that forcing it open would only destroy the contents inside. She suggests rebuilding the glass key instead, and the Lotus will send the player 25 Codex Scanners in their inventory for use in locating the Shatter-lock&#39;s shards out on the Plains.</p>\r\n\r\n<p>To equip the Codex Scanners, players must go to their Arsenal, and bring up the Gear menu before putting the Codex Scanner in one of the 12 Gear slots available. Players will be unable to progress to the next mission if the Codex Scanners are not equipped.</p>"}, {"id": 15, "quest": 2, "name": "A Personal Favor", "description": "<p>When players talk to Konzu, he will converse with the Tenno about Saya, a woman who lives on the outskirts of Cetus. Konzu then shows a sketch showing him, Saya, and a man named Onkko, Saya&#39;s husband, and he tells of how Onkko disappeared five years ago leaving a distraught Saya. Now, Konzu is hearing whispers from The Quills about the Grineer finding leads on Onkko&#39;s whereabouts, and Konzu fears that Saya may do something rash. He asks the Tenno to talk to Saya for him, since he has not spoken to her in a long time.</p>\r\n\r\n<p>A white objective marker will appear on the map, showing Saya&#39;s location within Cetus. Players can talk to Saya, who will express her desire to go out and search for her husband, along with her annoyance at Konzu, who was apparently involved with Onkko&#39;s disappearance. Saya will ask the Tenno if they want to help, and players can either accept or reject her: accepting her will immediately load the Tenno out onto the Plains to begin the quest. As an option, players can also talk to Saya with the prompt &quot;But it&#39;s been five years&quot;, where she expresses her disdain at the Quills&#39; self-centered nature.</p>"}, {"id": 14, "quest": 1, "name": "Epilogue I", "description": "<p>The Tenno is free &mdash; but the battle has only just begun. The Lotus immediately sent the Tenno a message, ordering them into a conquest to save the Origin System, one of which the Tenno must decide themselves.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<h6><strong>Your New Mission</strong> Tenno,</h6>\r\n\r\n<p>Now that you have freed yourself from Vor and his Ascaris, you have a new mission, one of your own making. Know that I am only your guide, you are your own warrior, you decide what battles to fight. Allow me to suggest a course of action:</p>\r\n\r\n<ul>\r\n\t<li>Seek out like-minded fighters, Tenno are more effective in groups.</li>\r\n\t<li>Execute missions and alerts on the Star Chart to open new paths of exploration.</li>\r\n\t<li>Use the credits you earned in battle to buy blueprints in the Market, then hunt down resources and craft those items in your Foundry.</li>\r\n\t<li>Customize your weapons and Warframes using the Mod bench. Different enemies are vulnerable to different combinations of mods, experiment to discover the most effective loadouts.</li>\r\n\t<li>Finally, stay alert. The Grineer and Corpus are tireless and you are the only thing standing between them and total domination of the Origin System.</li>\r\n</ul>\r\n\r\n<p class=\"text-right mb-0\">I am counting on you, Tenno. - <strong>The Lotus</strong></p>\r\n</div>"}, {"id": 13, "quest": 1, "name": "Faceoff", "description": "<p>Captain Vor has been located on a mining asteroid &mdash; and best of all, he is without his elite guard. It is the perfect time to eliminate him. The Tenno finds and confronts him. After a short battle, Vor is dead, and the Ascaris and its detonator have disintegrated.</p>\r\n\r\n<p>Completing this mission will complete the quest.</p>"}, {"id": 12, "quest": 1, "name": "Interlude VI", "description": "<p>After installing the navigation segment, the Tenno can head to Cambria, Earth for the final confrontation with Vor.</p>"}, {"id": 11, "quest": 1, "name": "Navigation Recovery", "description": "<p>Boarding the Grineer Galleon, the Tenno immediately sets out to retrieve a navigation segment held within a storage cell aboard the ship. Once retrieved, the segment can be made compatible with the Liset&#39;s systems, allowing the Tenno to discover the location of Captain Vor in order to confront Captain Vor.</p>\r\n\r\n<p>After retrieving the segment, the Tenno is faced with a challenge. The Galleon is on a direct course for a convoy full of innocent colonists. Do they intervene on the behalf of the colonists by destroying the Galleon&#39;s reactor (thereby causing the Galleon to self-destruct) or do they extract immediately? No matter the choice, the Ascaris again demonstrates partial control of the Warframe systems, halving the Tenno&#39;s maximum shields.</p>\r\n\r\n<p>If the Tenno chooses to save the colonists, the Tenno has 5 minutes to evacuate before the Galleon explodes upon disabling the reactor. The Lotus ultimately thanks the Tenno for their actions, but reminds them that they must survive in order to protect the system.</p>\r\n\r\n<p>A broken Stretch and Intensify mod are awarded upon completing the mission.</p>"}, {"id": 10, "quest": 1, "name": "Interlude V", "description": "<p>With the resources for the Ascaris Negator ready, the Foundry is put to work and the Ascaris can be removed. Vor manages one final transmission.</p>\r\n\r\n<div class=\"p-3 my-3 bg-black-t\">\r\n<p>What a waste.</p>\r\n\r\n<p class=\"text-right mb-0\"><strong>- Vor</strong></p>\r\n</div>\r\n\r\n<p>Moments later, the Tenno is briefly incapacitated. The Ascaris has an anti-tampering failsafe, and has burrowed deeper into the Warframe. It will soon detonate &mdash; with predictably lethal results &mdash; and the only way to disarm it is to find Vor. The Lotus locates a nearby ship that should have information on Vor&#39;s location, and the Tenno departs immediately.</p>\r\n\r\n<p>Not surprisingly, Ordis seems pleased that finding Vor may involve violence.</p>"}, {"id": 9, "quest": 1, "name": "Loot & Pillage", "description": "<p>Following the coordinates sent by Darvo, the Tenno finds a series of Corpus outposts built into the upper levels of the Himalayan Mountains. The Lotus has identified three Supply Caches which should contain the materials necessary to produce the Negator. During the course of the mission, Darvo briefly introduces the Tenno to the Corpus and explains that, whilst the mission is technically stealing, the Corpus aren&#39;t exactly beacons of moral fortitude either &mdash; given that they&#39;ll sell anything to anyone. Darvo sees their willingness to deal with the Grineer as unforgivable, and is all too happy to support the Tenno in their efforts against the Corpus and the Grineer as a result.</p>\r\n\r\n<p>Unfortunately, it also appears the Ascaris&#39; work is almost complete. The Tenno loses contact with the Lotus and Darvo during the mission, as Vor shows he can now interrupt transmissions fully, rather than simply force you to receive his own messages. He states that the Tenno will soon return to him instead of the Lotus, over their own free will.</p>\r\n\r\n<p>Completing this mission will give damaged Steel Fiber and Enemy Sense mods.</p>"}, {"id": 8, "quest": 1, "name": "Interlude IV", "description": "<p>Foundry module secured, the Tenno returns to the Orbiter and installs it. With the Foundry systems once again online, they find the ship&#39;s supply stores were also looted by the Grineer. Now the Tenno must find materials so that they can manufacture the Negator using the blueprint Darvo supplied. Ordis sends Darvo a somewhat impolite message; Darvo replies quite promptly, apologizing for the misunderstanding, and directs the Tenno to a series of Corpus Supply Caches where they can gather the materials they need to manufacture the Negator.</p>"}, {"id": 7, "quest": 1, "name": "Oppression", "description": "<p>Arriving at the mining outpost, the Tenno and the Lotus find that there are no signs of colonist activity any more &mdash; only Grineer soldiers. The Lotus deduces that the Grineer have invaded, and directs the Tenno to first retrieve the Foundry module, then Exterminate the remaining Grineer so that the lost miners are avenged.</p>\r\n\r\n<p>A damaged Bane of Corpus, Bane of Grineer, Convulsion, Heated Charge, and a normal Fury mod is rewarded upon completion.</p>"}, {"id": 6, "quest": 1, "name": "Interlude III", "description": "<p>Upon escaping, Darvo rewards the player with an Ascaris Negator blueprint &mdash; An item to negate the effects of the Ascaris Vor installed.</p>\r\n\r\n<table class=\"bg-black-t mr-3 my-3 table table-dark\">\r\n\t<tbody>\r\n\t\t<tr>\r\n\t\t\t<th colspan=\"6\">Manufacturing Requirements</th>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td>100 Credits</td>\r\n\t\t\t<td>1 Morphics</td>\r\n\t\t\t<td>450 Salvage</td>\r\n\t\t\t<td>240 Polimer Bundle</td>\r\n\t\t\t<td>&nbsp;</td>\r\n\t\t\t<td>Time: 30s</td>\r\n\t\t</tr>\r\n\t\t<tr>\r\n\t\t\t<td colspan=\"3\">Market Price: N/A</td>\r\n\t\t\t<td colspan=\"3\">Blueprints Price: N/A</td>\r\n\t\t</tr>\r\n\t</tbody>\r\n</table>\r\n\r\n<p>However, the orbiter&#39;s Foundry systems are inoperative and must also be restored. The Lotus has located a neutral mining colony where they should be able to obtain the equipment they need with potentially no bloodshed or violence.</p>\r\n\r\n<p>The Tenno also recovers the Mod system segment in the process of rescuing Darvo, and now has the ability to install any mods retrieved during prior and following missions &mdash; most of which will be the special &#39;Cracked&#39; or &#39;Damaged&#39; variants that are inferior to regular drops, but provide new Tenno with the vital tools they need to survive. Ordis encourages the Tenno to install some modifications so they are better prepared, somewhat eagerly recommending the use of Heat b Heat weaponry &mdash; another sign of his instability after being abandoned for so long.</p>\r\n\r\n<p>A normal Redirection mod is automatically given to players upon restoration of the Mods segment.</p>"}, {"id": 5, "quest": 1, "name": "Familiar Faces", "description": "<p>Returning again to the surface, the Tenno sets out to rescue a Corpus black marketeer named Darvo who is sympathetic to the Tenno cause &mdash; and has been imprisoned by the Grineer as a result. During the course of the mission, the true purpose of the Ascaris becomes clear; it is designed to allow Vor to assume control of the Warframe. Vor (now demoted to Captain for his failure) demonstrates partial control of the Warframe systems by temporarily halving the Tenno&#39;s maximum shields, similar to the effect of the Cryogenic Hazard, but cannot yet assume full control.</p>\r\n\r\n<p>Vor also comments on the nature of the Warframes; they do not control the &#39;divine energy&#39;, the Tenno are the &#39;divine energy&#39; &mdash; with each Warframe the Tenno owns being a &#39;glass&#39; through which that &#39;energy&#39; is focused.</p>\r\n\r\n<p>Players are rewarded with a damaged Continuity, Intensify, Stretch and Vitality mod upon mission success.</p>"}, {"id": 4, "quest": 1, "name": "Interlude II", "description": "<p>With the Communications module segment in hand, the system can be restored. This allows access to the Market, and enables Matchmaking functionality. Ordis mentions that the Tenno can now contact arms dealers (though in somewhat less flattering terms at first, given his unstable nature) to expand their arsenal. Whilst it seems there are no merchants currently available, the Lotus has located a captive arms dealer on the surface who might be sympathetic to the Tenno cause.</p>"}, {"id": 3, "quest": 1, "name": "Outreach", "description": "<p>The Tenno deploys back to Earth, with the intent of retrieving the Communications module from a Grineer outpost. This short mission introduces the Spy game mode (this was previously Interception); the Tenno must break into a Grineer Data Vault and hack the console to retrieve the module. Once this has been done, the Tenno returns to the Orbiter.</p>\r\n\r\n<p>Upon completion, players are rewarded with damaged versions of the Point Blank, Hornet Strike and Serration mods.</p>"}, {"id": 2, "quest": 1, "name": "Interlude I", "description": "<p>With the Liset ship and a handful of weapons at the ready, the Tenno is introduced to their own personal Orbiter ship, along with the Arsenal system (after restoring its functionality) only to find that it has been looted and that the vast majority of the Orbiter&#39;s systems are offline, their module segments having been removed or damaged. The Lotus recommends that the Tenno prioritize repairing the ship&#39;s Communication system so that they may further arm themselves and (optionally) coordinate with other Tenno. There are no replacement components available aboard the Orbiter, but she has located a suitable replacement on the surface of Earth.</p>"}, {"id": 1, "quest": 1, "name": "Ground Zero", "description": "<p>The Lotus cannot allow the Warframe to be captured, as losing them is bad enough already. She surges the Warframe&#39;s systems remotely, allowing the Tenno to fight back against the soldiers nearby using their innate powers. With the immediate threat dispatched, the Tenno must now find weapons and escape. This first level plays out as a tutorial, with weak enemies and gradual progression through gameplay elements starting with Warframe Powers and moving onto melee weapons (along with stealth and blocking), then secondary weapons, then primary weapons, and finally hacking and timed defense, interspersed with movement tutorials covering sliding, wallrunning, and so on. The weapons of choice provided in this mission are:</p>\r\n\r\n<ul>\r\n\t<li>Melee\r\n\t<ul>\r\n\t\t<li>Skana, a Sword class weapon, the standard weapon with moderate damage, range, and speed.</li>\r\n\t\t<li>MK1-Bo, a Staff class weapon, a strong and long ranged weapon, albeit slow in speed.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Sidearm\r\n\t<ul>\r\n\t\t<li>Lato, an accurate sidearm, ideal for all-range encounter.</li>\r\n\t\t<li>MK1-Kunai, a set of throwing knives, ideal for stealth.</li>\r\n\t</ul>\r\n\t</li>\r\n\t<li>Primary\r\n\t<ul>\r\n\t\t<li>MK1-Braton, a full-auto rifle, standard for all situations.</li>\r\n\t\t<li>MK1-Paris, a silent bow, ideal for high damage and stealth, but falls short against multiple opponents.</li>\r\n\t</ul>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Upon arrival at the checkpoint, Vor uses his Janus Key to destroy the first extraction craft (an &#39;old&#39; Liset model) before the Tenno can escape, but the Tenno soon finds their old ship, an Orokin-Era Liset, impounded by the Grineer. Ordis, its onboard AI (or &quot;Cephalon&quot;), originally mistakes the Tenno (referred to as &#39;the Operator&#39;) for a Grineer soldier, but quickly comes around when it realizes their true identity, and begins charging the ship&#39;s engines. The Tenno must hold out against Grineer soldiers for a couple of minutes whilst the drives charge, and then escapes.</p>"}]